[{"headline":"PM Modi arrives in Kuwait on 2-day visit","pic":"//images.indianexpress.com/2024/12/Kuwait.jpeg?w=210","link":"https://indianexpress.com/article/india/pm-modi-in-kuwait-emir-indian-diaspora-9737693/","contents":{"image":"https://images.indianexpress.com/2024/12/Kuwait.jpeg?w=640","text":"Prime Minister Narendra Modi arrived in Kuwait on Saturday for a two-day visit aimed at strengthening ties with the Gulf nation. This landmark visit marks the first time an Indian Prime Minister has traveled to Kuwait in 43 years.Modi is visiting at the invitation of Kuwaiti Emir Sheikh Meshal Al-Ahmad Al-Jaber Al-Sabah. During his stay, he will hold discussions with the Kuwaiti leadership and engage with the vibrant Indian diaspora.In a statement before his departure, Prime Minister Modi highlighted the importance of the visit. “We deeply value the historical connection with Kuwait that has been nurtured over generations. We are not just strong trade and energy partners but also have shared interests in peace, security, stability, and prosperity in the West Asia region,” he said. He expressed enthusiasm about meeting the Emir, the Crown Prince, and the Kuwaiti Prime Minister to outline a roadmap for a futuristic partnership.Modi’s itinerary also includes attending the opening ceremony of the 26th Arabian Gulf Cup in Kuwait. The last Indian Prime Minister to visit the Gulf nation was Indira Gandhi in 1981.India and Kuwait share robust economic ties. Kuwait ranks as one of India’s top trading partners, with bilateral trade valued at USD 10.47 billion in the financial year 2023-24. The Gulf nation is also India’s sixth-largest crude oil supplier, meeting 3 percent of its energy needs. Indian exports to Kuwait have reached a record USD 2 billion, while investments by the Kuwait Investment Authority in India exceed USD 10 billion.The Indian community, which forms the largest expatriate group in Kuwait, plays a vital role in strengthening bilateral relations. With over one million Indians making up 21 percent of Kuwait’s population and 30 percent of its workforce, their contribution spans various sectors, including the private and domestic workforce.The historical ties between India and Kuwait date back to the pre-oil era when maritime trade formed the backbone of Kuwait’s economy. This visit seeks to further deepen the longstanding friendly relations between the two nations.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.Salman Khan played a crucial role in Arjun Kapoor's journey from an aspiring filmmaker to a successful actor. He motivated him to shed weight and make his Bollywood debut in 2012 with Ishaqzaade. Arjun credits Salman for being a fearless and warm person, and for helping him through his physical transformation.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"YouTuber Rajveer Shishodia arrested, released after ‘road rage’ video goes viral","pic":"//images.indianexpress.com/2024/12/Indian-Express-19.jpg?w=210","link":"https://indianexpress.com/article/cities/delhi/youtuber-rajveer-shishodia-arrested-released-after-road-rage-video-viral-9737662/","contents":{"image":"https://images.indianexpress.com/2024/12/Indian-Express-19.jpg?w=640","text":"YouTuber Rajveer Shishodia was arrested and later released after he allegedly assaulted a car driver in a road rage incident on Thursday, the Noida police said.Dhruv Bhushan Dubey, Station House Officer (SHO), Noida Phase-3 police station, said that in a purported viral video of the incident, Shishodia assaulted Satender Kumar Singh after his car hit his vehicle. The incident took place in the first week of December, he added.After the video went viral, the police reached out to Singh and he lodged a complaint against Shishodia, SHO Dubey said. “A case was registered on Wednesday under sections 115 (2)(intentionally causing hurt), 352 (intentional hurt) and 351(2) (provoking) of Bharatiya Nyaya Sanhita and the accused was arrested and later released,” he added.The incident occurred when Shishodia was travelling towards Greater Noida West in his car. Singh’s car allegedly hit his vehicle near Parthala Flyover. In the video, Shishodia is purportedly heard saying Singh hit his car and damaged other vehicles. In a 30-second video clip of the purported incident, Shishodia can be seen slapping the man and abusing him.Shishodia has more than 5 million followers on Instagram and 3 million followers on his YouTube channel Raj-Veer Fitness Series.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed. Neetika Jha is a trainee reporter with The Indian Express, Delhi. She covers crime, health, environment as well as stories of human interest, in Noida and Ghaziabad. When not on the field she is probably working on another story idea. On weekends, she loves to read fiction over a cup of coffee (cold coffee if it is summer). The Thursday Murder club and Yellow face were her recent favourites. She loves her garden as much as she loves her job. She is an alumnus of Asian College of Journalism, Chennai.                        ... Read More \n                The Western Railway division in Mumbai is modernizing an old screw pile bridge over the Mithi River. The operation will involve two 9.5-hour track block during one of the weekends, scheduled tentatively during last week of January to dismantle and replace the aging structure. The project, expected to take two months, will improve the safety and longevity of the city's rail links.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"Body of missing 7-year-old boy retrieved nearly 3 days after Mumbai boat accident","pic":"//images.indianexpress.com/2024/12/Indian-Express-16.jpg?w=210","link":"https://indianexpress.com/article/cities/mumbai/mumbai-navy-speedboat-ferry-crash-body-found-9737512/","contents":{"image":"https://images.indianexpress.com/2024/12/Indian-Express-16.jpg?w=640","text":"The body of seven-year-old Zohan Pathan who went missing after a ferry capsized off the Mumbai coast on Wednesday was retrieved on Saturday, officials aid. Navy and Coast Guard officials had been searching for the body since the accident which took place after a Navy speedboat collided with the ferry.Zohan was the last passenger to be traced since the tragedy that claimed the lives of 15 people, including Navy personnel.Officials said the search operation was challenging because the incident occurred during a full moon, causing strong sea currents. This led authorities to deploy helicopters for search operations initially, but since then the Navy and Coast Guard continued the search with nine vessels working non-stop.The police had also roped in fishermen besides taking help from other agencies such as the Mumbai Port Trust to locate the missing boy.Zohan was last seen in the arms of his mother Sakina Pathan who drowned in the accident. Residents of Mapusa in Goa, the Pathan family had arrived in Mumbai for work which later turned into a brief vacation. They boarded the ferry from the Gateway of India on Wednesday and were headed towards Elephanta Caves when the accident occurred.The boat was reportedly overloaded and Ashraf Pathan, Zohan’s father, recalled the lack of safety precautions. “…We could see that the boat was overloaded. I was holding our ten-month-old baby and my wife Sakina was holding Zohan. After the accident, my wife, I and other members were unable to find any life jackets,” Ashraf had earlier told The Indian Express.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.Salman Khan played a crucial role in Arjun Kapoor's journey from an aspiring filmmaker to a successful actor. He motivated him to shed weight and make his Bollywood debut in 2012 with Ishaqzaade. Arjun credits Salman for being a fearless and warm person, and for helping him through his physical transformation.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"India’s net forest cover sees paltry rise of 156.41 sq km; decrease in mangroves and Western Ghats cover","pic":"//images.indianexpress.com/2024/12/forest-cover.jpg?w=210","link":"https://indianexpress.com/article/india/india-forest-tree-cover-govt-report-9737617/","contents":{"image":"https://images.indianexpress.com/2024/12/forest-cover.jpg?w=640","text":"India’s net forest cover has increased by 156.41 sq km between 2021 and 2023, as per the 2023 India State of Forest Report (ISFR), taking the geographical area under forest cover to 21.76 per cent, a paltry rise of 0.05 per cent compared to the 2021 assessment. The country has also lost old-growth forest and mangrove cover and saw a decline in forest cover across the Western Ghats.The net rise in forest cover takes the area under forest cover to 7,15,342.61 sq km. Taking into account tree cover, which has increased by 1,285.4 sq km, the total green cover put together has increased by 1,445.81 sq km, compared to 2021, covering a geographical area of 25.17 per cent.The report was released by Environment Minister Bhupender Yadav on Saturday at the Forest Research Institute in Dehradun. Yadav said that the audit and analysis of forest cover were important for policy-making and protection.Notably, even the small 0.05 rise in net forest cover was largely outside recorded forest areas (RFAs), which refer to reserved forests and protected forests. Of the 156.41 sq km increase, 149.13 sq km was outside RFAs and only 7.28 sq km was inside.There has been a loss of 1,234.95 sq km of moderately dense forests, 1,189.27 sq km of open forests and an increase of 2,431.50 sq km of very dense forests.An assessment of forest cover across the Western Ghats was done for the first time. It showed that the area earmarked as eco-sensitive by the Centre lost 58.22 sq km of forest cover since 2013. “Though very dense forests increased by 3,455.12 sq km, moderately dense forests and open forests decreased by 1,043.23 sq km and 2,480.11 sq km, respectively,” as per the report.The ISFR is released biennially and involves forest cover mapping of the country using satellite data. Forest cover is defined as “all lands, more than one hectare with a tree canopy density of more than or equal to 10% irrespective of ownership, legal status and land use. Such lands may not necessarily be a recorded forest area. It also includes orchards, bamboo and palm.” The national mapping of forest cover spanned 751 districts for the latest report compared to 636 districts in the previous one.Notably, natural disaster and hazard-resilient mangrove species have seen a decrease of 7.43 sq km in the country compared to 2021. The country’s total mangrove cover is 4,991.68 sq km, accounting for 0.15 per cent of the country’s total geographical area. A prominent decrease was recorded in Gujarat at a loss of 36 sq km, followed by a 4.65 sq km decrease in Andaman and Nicobar Islands.The northeastern states continued to record a declining trend in forest cover and as per the 2023 assessment, the decrease was by 327.30 sq km. Only Mizoram recorded an increase of 178 sq km. The highest decline was seen across Nagaland, Tripura, Meghalaya and Assam.Among states, the maximum rise in forest and tree cover was seen in Chhattisgarh (683.62 sq km), followed by Uttar Pradesh (559.19 sq km), Odisha (558.57 sq km) and Rajasthan (394.46 sq km). On the other hand, the maximum decrease was seen in Madhya Pradesh (612.41 sq km), followed by Karnataka (459.36 sq km), Ladakh (159.26 sq km) and Nagaland (125.22 sq km).Inside RFAs such as reserved and protected forests, the maximum increase was in Mizoram (192.92 sq km), followed by Odisha (118.17 sq km), Karnataka (93.14 sq km), West Bengal (64.79 sq km) and Jharkhand (52.72 sq km).Area-wise, the top three states with the largest forest and tree cover are Madhya Pradesh (85,724 sq km) followed by Arunachal Pradesh (67,083 sq km) and Maharashtra (65,383 sq km).There is an increase of 81.5 million tonnes in the carbon stock of the country as compared to the last assessment.The classification of forest cover used in the present report is based on tree canopy density, viz., Very Dense Forest (VDF) having canopy density equal to or more than 70 per cent, Moderately Dense Forest (MDF) having canopy density equal to or more than 40 per cent but less than 70 per cent, and Open Forest (OF) having canopy density equal to or more than 10 per cent but less than 40 per cent.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed. An award-winning journalist with 14 years of experience, Nikhil Ghanekar is an Assistant Editor with the National Bureau [Government] of The Indian Express in New Delhi. He primarily covers environmental policy matters which involve tracking key decisions and inner workings of the Ministry of Environment, Forest and Climate Change. He also covers the functioning of the National Green Tribunal and writes on the impact of environmental policies on wildlife conservation, forestry issues and climate change.\n\nNikhil joined The Indian Express in 2024. Originally from Mumbai, he has worked in publications such as Tehelka, Hindustan Times, DNA Newspaper, News18 and Indiaspend. In the past 14 years, he has written on a range of subjects such as sports, current affairs, civic issues, city centric environment news, central government policies and politics.                        ... Read More \n                Salman Khan played a crucial role in Arjun Kapoor's journey from an aspiring filmmaker to a successful actor. He motivated him to shed weight and make his Bollywood debut in 2012 with Ishaqzaade. Arjun credits Salman for being a fearless and warm person, and for helping him through his physical transformation.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"Gujarat man, brother injured after IED delivered at Ahmedabad home explodes; 1 held","pic":"//images.indianexpress.com/2024/12/delhi-arrest.jpg?w=210","link":"https://indianexpress.com/article/cities/ahmedabad/gujarat-man-brother-injured-ied-ahmedabad-home-explodes-9737767/","contents":{"image":"https://images.indianexpress.com/2024/12/delhi-arrest.jpg?w=640","text":"A man who works as a clerk for a Gujarat High Court advocate and his brother were injured on Saturday after an Improvised Explosive Device (IED) delivered to his house in Ahmedabad exploded. The police arrested the man who delivered the homemade bomb and said that the incident was a fallout of a personal dispute.The incident took place at 10.45 am on Saturday. Gaurav Niranjan Gadhvi delivered a homemade bomb at Baldev Sukhadia’s house. The bomb went off, injuring Baldev and his brother Kirit, the police said. Gadhvi tried to escape but was caught by locals and handed over to the police who reached the spot shortly after receiving information about the low-intensity explosion.Gadhvi has been placed under arrest, Nirajkumar Badgujar, Additional Commissioner of Police, Sector-1, Ahmedabad, confirmed.While both Baldev and Kirit suffered slight burn injuries, Kirit was also hurt by the razor blades that had been packed into the IED, the police said. The police suspect the device was detonated remotely but are awaiting confirmation from the forensic science laboratory team.After Baldev told the police that he suspected a man named Rupen Kishor Barot, the Detection of Crime Branch (DCB) raided Barot’s home and found bomb-making materials and three country-made pistols, Ajit Rajian, Deputy Commissioner of Police, said.“It primarily appears that Rupen Barot and his wife Hetal are divorced and that Barot blamed Baldev for this… it appears to be a personal revenge issue at this point but the investigation is underway,” Badgujar said.Meanwhile, the Sabarmati police, under whose jurisdiction the incident took place, questioned Gadhvi. He allegedly told the police that he was only hired to deliver the device. According to the police, he knew what the parcel contained.Gadhvi and Barot have been booked under the attempt to murder charge, among others.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.BJP MP P P Chaudhary, who has been picked to head the crucial joint parliamentary panel looking into Bills to introduce one nation, one election, has had a meteoric rise through the party ranks. While a member of the RSS from an early age, Chaudhary, 71, made his political debut only in 2014, the Modi wave election, when he won the Pali Lok Sabha seat in Rajasthan, wresting it from the Congress.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"The Big PictureThe changing world of ‘Senior Advocate’: Who sets the Bar?Subscriber Only","pic":"//images.indianexpress.com/2024/12/senior-advocate.jpg?w=210","link":"https://indianexpress.com/article/long-reads/senior-advocate-supreme-court-law-9737088/","contents":{"image":"https://images.indianexpress.com/2024/12/senior-advocate.jpg?w=640","text":"Imagine a crowded courtroom at 10:30 am on a Monday. A litigant is before the Supreme Court, the final court of the country, and for every case at this stage, the stakes are high — there are no appeals or second chances. Whether it is a death penalty, a company’s liquidation, a child custody battle or a bail application, the litigant usually doesn’t have more than a couple of minutes for her lawyer to make the case before a bench of judges.This is where the Senior Advocate — a rarefied set of some of the most sought after and often highly paid lawyers in town — steps in. From the late Fali Nariman to names such as Mukul Rohatgi, Abhishek Manu Singhvi, Kapil Sibal, Harish Salve, among others, the legal acumen of this bunch is often spoken of in the same breath as the fee they command for each appearance.Currently, there are 639 practising Senior Advocates in the Supreme Court, with 116 of them designated just this year. The designation of this unusually large number of Senior Advocates has invited its share of criticism with concerns being expressed over the “quality” of those who end up getting the coveted tag.Talking of how “too many Senior Advocates” could lead to a dilution of the Bar, a senior lawyer, who has held the designation for over a decade, said on condition of anonymity, “Earlier, when someone said ‘doyen of the Bar’, you could think of a handful of seniors. Now with 200 doyens, what is the value of their word? A weaker Bar is a matter of concern for the independence of the judiciary.”Yet, there are others who say that this once-exclusive club is now a much more democratic space with more representation for women and first-generation advocates, among others.Conferred on members of the Bar by the Supreme Court or High Courts, the designation of ‘Senior Advocate’ is a coveted one. Even retired judges of High Courts are known to apply for the designation in the Supreme Court.Once a lawyer — who has at least 10 years of experience at the Bar — is designated a Senior Advocate, she is not allowed to take on clients or litigants directly, but is briefed on the case by another lawyer. Essentially, the litigant can’t approach a Senior Advocate directly, but goes to an Advocate-on-Record (AoR), who then ‘briefs’ the Senior.The idea is that a Senior Advocate argues a proposition of law which could be independent of the client or the factual matrix of the case. Armed with these briefs, a senior lawyer could appear in many cases, across courtrooms, in a day.Senior Advocate Sanjay Hegde had once described his tribe as being “a bit like a taxi for hire, for day and date only”. The enormous influence the tag carries is no small part of the charm of being Senior Advocate.A 2015 study by the Delhi-based Vidhi Centre for Legal Policy had found that the chances of the Supreme Court agreeing to accept a case for detailed hearing roughly doubles when argued by a Senior Advocate compared with cases without a Senior Advocate — while Senior Advocates had a 59.6% success rate in getting their cases admitted, for other lawyers, it was 33.71% success.According to the 2023 book Court on Trial: A Data-Driven Account of the Supreme Court of India — co-authored by National Law School of India University, Bengaluru, professor Aparna Chandra — while Senior Advocates form just 1% of the Bar, they appear in nearly 40% of the cases at admission stage.Their role as “gatekeepers” who influence the court on which cases to admit is crucial considering how pressed judges often are for time. The book states that a typical hearing on whether to admit a Special Leave Petition — under which an aggrieved party is granted special permission to be heard in the Supreme Court — lasts for a mere 1 minute and 33 seconds on average.Data that Chandra analysed from over 5,000 cases shows that while Senior Advocates have a higher chance of being heard, that pattern does not hold as the case progresses. In the final hearing, a Senior Advocate has a success rate of 57% when compared to 60% for other advocates. Which means, since the fate of the case could very well be sealed in the initial stage, engaging a Senior Advocate at that stage could have maximum impact.Which explains the sky-high fee some of these big names command — starting from a lakh to anywhere between Rs 17-25 lakh per hearing.It was on a public interest litigation by Indira Jaising, the first woman to be designated a Senior Advocate of the Bombay High Court, that the Supreme Court in 2017 laid down objective criteria to designate Senior Advocates.The process now involves the courts inviting applications from lawyers. The selection is based on a set of criteria, which includes reported judgements, experience, publications and a personal “suitability” interview.Until the 2017 ruling, courts would invite or receive applications and discuss the candidature in full court to confer a designation. While there are oral histories in the Bar of promising advocates such as former Supreme Court judge Rohinton Nariman being designated at the age of 37 or former Chief Justice of India D Y Chandrachud getting the designation at 39, critics of the earlier system point out that they all belonged to illustrious legal families.It was Jaising who started a “gown wapsi movement” and “shed” her senior counsel gown which she termed “a symbol of discrimination”, eventually paving the way for reforms in the process.However, the criticism of the new process began soon after. Last year, the 2017 rules were challenged in court and the government, too, sought a reconsideration of the existing process.“(The existing) system has been subject to ridicule, memes and jokes. In Delhi, we recently had 170 designations (of Senior Advocates)… advocates are floating (in the city),” Solicitor General Tushar Mehta told the court during a recent hearing on December 6. While Mehta insisted that the government is not concerned with any one individual, “designation is a responsibility conferred by the court, let it not be a distribution,” he said.In 2023, the Central government sought to change the 2017 guidelines for the designation of senior lawyers, seeking some tweaks in the criteria.The 2017 ruling had, on a 100-point scale, allotted 15 points to writing articles in newspapers or journals. This was followed by a rise in lawyers publishing on several media portals.Taking note of this, the SC in 2023 reduced the points allocated to this criterion from 15 to 5. There are also concerns that designating more advocates is a “populist move.”“Especially when it comes to women, simply designating them when there are not many who will brief them will only damage their existing practice,” a former judge said.Many of these concerns are, however, dismissed by the younger members of the Bar as a reaction by the existing group of seniors to greater competition or reluctance to changing the status quo.“The designation process post the 2017 judgment is definitely more inclusive and is a better system than what we had earlier. It also makes it easier for younger members of the Bar or those practising as first-generation lawyers to aspire for the designation,” said advocate-on-record Anas Tanwir.Many other first-generation lawyers, especially women, see the existing process as a step in the right direction.\nConsider this: in 1977, Leila Seth, then a lawyer practising before the Delhi High Court, became the first woman to be designated a Senior Advocate.A year later, she went on to become the first woman judge of the Delhi High Court. After that, it took 30 years for another woman to be designated a Senior Advocate. In 2007, Indu Malhotra, who in 2018 became a judge of the Supreme Court, was designated a Senior Advocate.In what’s been a clear shift, since the new rules came into force in 2017, 40 women have been designated Senior Advocates.“This process also allows lawyers who may not have high visibility with judges but have contributed significantly in other ways to be considered. For example, the scoring system introduces measurable benchmarks such as academic contributions and pro bono work. It also allows lawyers who may not have high visibility with judges but have contributed significantly in other ways to be considered,” said Tushar Sannu Dahiya, another first-generation lawyer practising in the Delhi High Court.Senior Advocate Anindita Pujari pointed out that the new process has ensured that it is not only SC lawyers with visibility who can aspire for the designation. “Someone with a specialised technology or regulatory practice before a tribunal and who may not appear before the SC everyday can also get designated. This would have never been possible before,” Pujari said.For instance, N S Nappinai was designated a Senior Advocate by the Supreme Court in January this year. Nappinai has for over two decades of immersive practice in cyber laws and technology.“Much of this conversation (about there being too many seniors) is because it is big money. Having more seniors cuts into the pie of existing Senior Advocates,” said another lawyer who did not wish to be identified.Those who speak in favour of having more designations say it has made legal services more accessible. “If litigants can afford Senior Advocates who are starting out at lower fees, why is that a bad thing? We get visibility too in court. It’s a win-win,” a newly designated Senior Advocate said.The system has its own way of levelling out, says Vipin Nair, President of the Supreme Court Advocate-on-Record Association. “Once you become a senior, it is the lawyers who were till then your competition, who will have to send you work. They have to brief you. If they don’t think you are good enough, briefs don’t come. The market will ultimately balance it out. It’s a conscious call a lawyer has to take before applying to be Senior Advocate. Let people apply, it’ll test the competition,” he said.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.Bashar al-Assad is gone, what's happening in Syria now?Subscriber OnlyHow political drama let Constitution debate downSubscriber OnlyThe many conflicts between Nehru and AmbedkarSubscriber OnlyChhagan Bhujbal: 'I am not consulted for anything now'Subscriber OnlyWhat Indian PM's first visit to Kuwait in 4 decadesSubscriber Only12 issues that made headlines in 2024Subscriber OnlyRaj Kapoor @ 100: The showman whose magic dazzles usSubscriber OnlyHindi cinema's best to worst in 2024Subscriber OnlyHow One Hundred Years of Solitude turned into a screenplayHow raagas can heal: A life in music and memoriesSubscriber OnlyBandish Bandits Season 2 review: No straggly spots, only theBhupen Khakhar made a virtue of painting pain, he sufferedSubscriber OnlyObama includes Indian film All We Imagine as Light in his list of favorite movies, directed by Payal Kapadia. The film has gained international recognition and multiple award nominations.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"Nyay's author admitsNyay's gone wild, can sink nation ship, rich will escape, poor will drownSubscriber Only","pic":"//images.indianexpress.com/2024/12/Congress-flag-1.jpg?w=210","link":"https://indianexpress.com/article/opinion/columns/nyays-author-admits-nyays-gone-wild-can-sink-nation-ship-rich-will-escape-poor-will-drown-9736841/","contents":{"image":"https://images.indianexpress.com/2024/12/NYAY-gone-wrong_Premium-01.jpg?w=640","text":"\n\t\t\t\t\t\t\t\n\t\t\t\t\t\tOpinion by Praveen Chakravarty\t\tPraveen ChakravartyPage 21 of the Congress party’s 2019 Lok Sabha election manifesto said “To eliminate abject poverty by 2030, Congress will introduce a Nyuntam Aay Yojana (NYAY) to provide Rs 72,000 a year to the poorest one-fifth of all families. The money will be transferred to the bank account of the woman head of the family”. The Congress party lost the 2019 election badly. But this idea of an unconditional cash transfer to women in poor families has won huge.Five years after NYAY was first proposed, 15 states governed by eight different political parties have implemented some version of NYAY, after promising it in their state election manifestoes. Sixty per cent of India’s women live in these 15 states. So, a majority of poor women in India now are beneficiaries of an unconditional cash transfer from the government. Going by the trend, it is only a matter of time before other large states follow suit. This is an astonishingly rapid paradigm shift in India’s welfare model. From just an academic “universal basic income” idea mooted in the 2017 Economic Survey to a concrete election promise by a major political party in 2019 to nearly 100 million women receiving roughly $25 billion every year as unconditional cash transfer by 2024, this must rank as one of the largest and fastest “lab to reality” economic policy ideas in recent history anywhere in the world. But such a wide-scale rollout of cash transfers in such quick time is a warning, not a jingle bell.Feminists and social scientists support unconditional cash transfers for its power to liberate and empower women, especially in underdeveloped countries. Economists believe it can boost consumption demand and help stimulate the larger economy. Efficiency hunters find cash transfers appealing for their simplicity and efficiency of governance. Libertarians like it because of the freedom it provides to the individual family unit in making spending decisions. But we do not yet know how many of these promised benefits of cash transfers to women have been fulfilled in India. While some studies such as the Pratichi Trust’s assessment of Bengal’s cash transfer scheme report some encouraging findings, they lack rigour and neutrality. The truth is that it is still too early to assess the real impact of $25 billion a year “NYAY” type programmes on social development and women’s empowerment.But it is obvious that the idea has gained enormous political currency, with nearly every political party promising it in their election manifestos. However, there is no empirical or scientific evidence that cash transfers to women, either as a scheme by a ruling party or as a promise by an opposition party, have material impact on influencing voter behaviour. The Congress party promised the largest cash transfer for women in 2019 and even made it its core election plank, but lost. Similarly, in the recent Maharashtra elections where contrary to media punditry, there was no difference in voting behaviour between beneficiaries and non-beneficiaries of the ruling BJP alliance’s cash transfer to women scheme. The Congress alliance’s promise to significantly increase the cash transfer amount too didn’t strike a chord with women voters in Maharashtra.Noisy rhetoric aside, cash transfers to women is clearly not the electoral magic bullet that it is made out to be. Yet nearly all political parties in India have pounced on this idea. The Aam Aadmi Party is upping the ante on cash transfers to women for the upcoming Delhi elections and predictably, other parties will follow. NYAY has become the inevitable sapling in India’s electoral landscape that may not attract voters, but its absence can be conspicuous.These schemes come at a substantial cost, politically and financially. Cash transfers subvert the very essence of politics in terms of representing people, understanding their real issues and solving them with specific policies and programmes. If all it takes to govern is to throw money at people and let them address their needs themselves, it hollows out the politics of representative governance, as Ruchi Gupta pointed out (‘Too much or too little’, IE, December 16).Most importantly, the financial burden of such cash transfer schemes is large, real and current. Nearly $25 billion is being spent by all state governments combined on cash transfers to women every year, roughly 10 per cent of what each state government earns annually. More worryingly, these schemes have significantly increased the state government’s deficits and debt burdens. Ironically, the rising debt of state governments due to NYAY-type programmes comes back to harm the same poor women beneficiaries through increased prices (inflation) and costlier access to money (interest rates). This is why the 2019 Congress manifesto that proposed NYAY also committed that “it will be funded only through new revenues and rationalisation of current expenditure with a commitment to keeping the fiscal deficit to less than 3 per cent of GDP”. All political parties seem to have borrowed the NYAY idea unconditionally.So, after five years, $25 billion and 100 million women beneficiaries, the social, economic and even electoral gains of NYAY are still unknown and intangible, while the political and financial costs are known, tangible and large. It is likely that the social benefits of NYAY-type programmes in terms of women empowerment are enormous in the long run. But in the short run, the tangible costs far outweigh the intangible benefits. It is thus prudent to calibrate spending on cash transfers slowly every year rather than expand rapidly in one go. To be clear, this is neither a mea culpa on the NYAY idea nor is it a call for state governments to abandon the scheme. When costs are immediate, but benefits are spread over a long term, it is important to scale slowly and not too fast, be it in physical infrastructure projects such as metros or in social infrastructure projects such as women empowerment. But with the misplaced excitement and belief about cash transfer schemes leading to electoral victories, all political parties are now engaged in a “my NYAY is larger than yours” slugfest. This is a dangerous race to fiscal ruin that can collectively sink the nation ship, only for the rich to escape with their lifeboats while the poor drown helplessly. NYAY can turn into ANYAY for a poor woman, if it is not slowed down.The writer is chairman, Professionals’ Congress & co-author of the Congress’ 2019 NYAY proposalYou want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"What is Pegasus, the notorious spyware WhatsApp defeated in court?","pic":"//images.indianexpress.com/2024/12/Pegasus-spyware-AI.jpeg?w=210","link":"https://indianexpress.com/article/technology/tech-news-technology/nso-group-israel-pegasus-spyware-explained-7-points-9737664/","contents":{"image":"https://images.indianexpress.com/2024/12/Pegasus.jpg?w=640","text":"WhatsApp, on Thursday, won a lawsuit against NSO Group Technologies, the company behind the notorious Pegasus spyware. To give you a quick recap, back in 2019, the Israeli company was accused by Meta of infecting and surveilling phones of around 1,400 people for two weeks.According to a ruling by a US court judge Phyllis Hamilton, the company had not only violated the state and federal US hacking laws but also infringed WhatsApp’s terms of service. The judge also said that he had asked NSO Group to provide Pegasus’ source code earlier this year, but after they repeatedly failed to comply with the order, she granted WhatsApp’s request to sanction NSO Group.“After five years of litigation, we’re grateful for today’s decision. NSO can no longer avoid accountability for their unlawful attacks on WhatsApp, journalists, human rights activists and civil society. With this ruling, spyware companies should be on notice that their illegal actions will not be tolerated”, WhatsApp said in a statement.Here’s what you need to know about Pegasus spyware in seven points:According to NSO Group, Pegasus aka Q Suite is “a world-leading cyber intelligence solution that enables law enforcement and intelligence agencies to remotely and covertly extract data from virtually any mobile device.”Once installed, Pegasus can not only read and go through your WhatsApp chats but also retrieve any information like SMS, call history, calendar, email, browsing history or files stored on the device.Up until 2018, Pegasus primarily relied on sending its targets SMS and WhatsApp messages laced with malicious links, clicking on which would infect their device. However, the company soon switched to the “network injection” method, which allowed customers using Pegasus to infect a device without requiring any action by the target.Pegasus also used “zero-day” vulnerabilities, which are basically bugs or exploits in an operating system that the manufacturer is unaware of. Fast forward to 2019, NSO Group had developed the ability to simply place calls to a WhatsApp number to infect the device. This was particularly worrisome as the user did not even have to answer the call for Pegasus to infect their device.NSO Group says the use of Pegasus is limited to governments around the world. According to NordVPN, the biggest customers of Pegasus include Saudi Arabia, Azerbaijan, India and the United Arab Emirates. In January 2022, it was found out that NSO Group had also sold the spyware to the United States Federal Bureau of Investigation, but the deal fell apart after discussions with the Department of Justice.One of the main reasons Pegasus is so controversial is that the software was designed to prevent and fight terror and crime, but has been reportedly used by governments around the world to snoop on journalists, opposition leaders, human rights activists and even people who did not agree with their respective establishments.Since it does not require any user interaction to infect a device, the spyware can be easily installed on any device without the user even knowing it and leaves little to no digital trace.While there is currently no sure-fire way to detect if a device is infected by Pegasus, some private security firms offer tools to detect Pegasus on a device.Earlier this year, researchers at the Russian anti-virus firm Kaspersky revealed a new way to detect advanced iOS spyware like Pegasus using the iPhone’s system logs. The technique involves analysing the Shutdown.log file in iOS’ sysdiagnose archive, which retains information from every device reboot to find anomalies linked to Pegasus.iVerify, a security firm that offers subscription-based protection unveiled a new feature called “Mobile Threat Hunting”, which can help detect the notorious Pegasus spyware.In its initial investigation, the company found out that out of the 2,500 scanned devices, Pegasus was found infecting seven phones. This may seem irrelevant at first sight, but it does raise a massive red flag in the world of mobile security.The company said it used a combination of techniques like signature based detection, heuristics and machine learning to search for any signs of infection and that users who down the iVerify Basics app, which costs $1,  can scan their device once every month to see if their device is infected by Pegasus.But with the NSO Group still working on Pegasus, these methods may no longer be reliable in the near future, meaning there is no guaranteed way to check if you are infected by Pegasus.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed. Anurag Chawake is a Senior Sub-Editor at indianexpress.com. His fascination with technology and computers goes back to the days of Windows 98. Since then, he has been tinkering with various operating systems, mobile phones, and other things. Anurag usually writes on a wide range of topics including Android, gaming, and PC hardware among other things related to consumer tech. His Twitter, Instagram, Facebook and LinkedIn user name is antechx.                        ... Read More \n                Shiv Sena (UBT) MP Sanjay Raut on Saturday reiterated that the party may go solo in the upcoming civic polls including in the Brihanmumbai Municipal Corporation (BMC). The chief spokesperson of the party led by Uddhav Thackeray claimed that the Sena (UBT)’s hold in Mumbai is undisputed and if it does not win there, “the city would be separated from Maharashtra by the ruling alliance”.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"New game in town: Opinion trading sees surge in users, funding — under the radarSubscriber Only","pic":"//images.indianexpress.com/2024/12/cyber1_31ba7c.jpg?w=210","link":"https://indianexpress.com/article/business/new-game-in-town-opinion-trading-sees-surge-in-users-funding-under-the-radar-9736911/","contents":{"image":"https://images.indianexpress.com/2024/12/cyber1_31ba7c.jpg?w=640","text":"Will India take three wickets against Australia at the end of six overs? Will Bitcoin breach the $110,000 mark today? Will the Congress contest 30 or more seats in the Delhi Assembly elections in 2025?You can bet real money on the outcome of these and many more questions.Welcome to the world of opinion trading: platforms which allow users to wager on the outcome of future events. The sector is growing exponentially, raking in funding and an estimated 5 crore users, but it seems to have largely gone under the radar in India, unscrutinised.Parochially, opinion trading platforms appear to be betting platforms – and some in government also have this view. But, investors and founders argue that there is a big element of skill that goes into making money on such platforms. Whether it’s a game of skill or of chance, stakeholders in the larger online gaming sector in India are privately calling for a clear Central law to deal with opinion trading platforms, The Indian Express has learnt.The sector in India has companies like Gurugram-based Probo and MPL Opinio. While the former offers questions on a varied set of sectors like sports, elections and cryptocurrency, the latter only deals with questions related to cricket matches. These platforms have received more than Rs 4,200 crore in funding so far from over 35 investors which include Sequoia Capital (PeakXV), Elevation Capital, Accel Partners, Soma Capital and Y Combinator.India currently does not have a law which can directly deal with opinion trading platforms like Probo and MPL Opinio – though in foreign markets like United States and Australia, where this industry is more mature, governments have decided to treat the wagers as securities, thereby putting the responsibility of regulation on the stock market regulator.To give a sense of the pace of growth in India, as per industry estimates, these platforms have registered transaction volumes of over Rs 50,000 crore a year with a user base of more than 5 crore people. Collective revenues for firms in the sector are projected to be over Rs 1,000 crore for the financial year 2024-25.In India, the fundamental legal lens through which online games are seen is whether they are a game of chance or game of skill. In games of chance, no person can have a competitive advantage over another because the result purely depends on luck. In games of skill, though, there could be some amount of preparation that could allow someone to be in a better position to make a prediction.While many believe this underlying lens itself could be problematic, given that many games of skill could also involve an element of luck or chance, this is currently the legal understanding in India. In effect, games of chance are bad and games of skill are alright. So naturally, it is in any online gaming platform’s interest to claim that their platform involves a great degree of skill.Sachin Gupta, co-founder of Probo, told The Indian Express: “We have created templates for questions and calculated their skill scores, to ensure they are skill based. Where the element of chance outweighs skill, we do not allow such questions to be published on the app.”“There is an internal skill auditing team, which assesses every question over a period of events to determine a skill score, which is based on the definition of skill based games laid down by the Supreme Court – the level of adroitness, knowledge, alertness required,” he said.But not everyone shares that view. “Wagering on the probability of an outcome is betting in our opinion, and opinion trading platforms generally follow that model,” a senior government official said. The IT Ministry, in its rules for online gaming released last year, had said that permissible online real money gaming does not include “wagering on any outcome”.A gaming industry executive said, “opinion trading platforms allow users to gamble with real money by simply choosing ‘Yes’ or ‘No’ on arbitrary events happening in the future, with odds changing every second. These platforms are definitely betting platforms and involve no skill”.Lawyers working with these firms have advised them to stay away from certain sectors to avoid coming under greater regulatory scrutiny. “For instance, one clear no go area is the stock market, or any questions related to the Indian stock market, since there is a fear that it could get the Securities and Exchange Board of India (SEBI) involved,” a lawyer, who has worked with opinion trading companies, said, speaking on the condition of anonymity.Another lawyer said that while at first glance opinion trading platforms can seem like betting platforms, as it allows wagering on events, there are some fundamental differences. “For instance, there is no house on such platforms, and they do not have any control over the events they are asking questions about. When there is a house, there is of course a perverse incentive to rig the system,” the lawyer said.Google has allowed some opinion trading apps such as MPL Opinion on its Play Store, but has prohibited apps like Probo. These games are, however, available on Apple’s App Store.Incidentally, Google had allowed some fantasy sports and rummy apps on its Play Store as part of a pilot project in 2022. This pilot is currently the subject of a Competition Commission of India investigation for alleged market distortion. Generally, these apps, including opinion trading apps, acquire users through digital ads on platforms like Google and Meta’s Facebook and Instagram.The opinion trading sector is regulated across countries like the US, UK and Australia. In the US, Kalshi, the company that started the opinions trading segment – and from which Probo gets a lot of its inspiration from – is regulated by the Commodity Futures Trading Commission (CFTC), one the country’s two main stock market regulators.Although, it is worth noting that a similar prediction app called Polymarket has come under the scrutiny of the US Department of Justice allegedly accepting trades from US-based users. The company is not registered with the CFTC and as a result, can not legally allow US-based users to wager on the platform.In India, however, there is currently no direct regulator for the sector and it is yet to pique the interest of regulators like SEBI. So effectively, at the central level, there is no dedicated law that sets the guardrails for such platforms, and there is very little in terms of regulatory protection that is available to their users.The IT Ministry had come up with amendments to Information Technology Rules to regulate online gaming platforms, which could have had a bearing on firms like Probo. However, there is a question mark on the status of these rules.  For now, these laws have no regulatory teeth, which furthers the problem of the legal lacunae that exists around online gaming in general, and opinion trading platforms in particular.“We would like to get regulated. The IT Ministry has shown and continues to show interest in regulating the sector, which is a great starting point. A platform with a similar business model to ours has been regulated in the US,” Probo’s Gupta said.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.Bashar al-Assad is gone, what's happening in Syria now?Subscriber OnlyHow political drama let Constitution debate downSubscriber OnlyWhat makes the ratel or the honey badger -- streetSubscriber OnlyThe many conflicts between Nehru and AmbedkarSubscriber OnlyChhagan Bhujbal: 'I am not consulted for anything now'Subscriber OnlyWhat Indian PM's first visit to Kuwait in 4 decadesSubscriber Only12 issues that made headlines in 2024Subscriber OnlyRaj Kapoor @ 100: The showman whose magic dazzles usSubscriber OnlyHindi cinema's best to worst in 2024Subscriber OnlyHow One Hundred Years of Solitude turned into a screenplayHow raagas can heal: A life in music and memoriesSubscriber OnlyBandish Bandits Season 2 review: No straggly spots, only theBhupen Khakhar made a virtue of painting pain, he sufferedSubscriber Only Soumyarendra Barik is Special Correspondent with The Indian Express and reports on the intersection of technology, policy and society. With over five years of newsroom experience, he has reported on issues of gig workers’ rights, privacy, India’s prevalent digital divide and a range of other policy interventions that impact big tech companies. He once also tailed a food delivery worker for over 12 hours to quantify the amount of money they make, and the pain they go through while doing so. In his free time, he likes to nerd about watches, Formula 1 and football.                        ... Read More \n                BJP MP P P Chaudhary, who has been picked to head the crucial joint parliamentary panel looking into Bills to introduce one nation, one election, has had a meteoric rise through the party ranks. While a member of the RSS from an early age, Chaudhary, 71, made his political debut only in 2014, the Modi wave election, when he won the Pali Lok Sabha seat in Rajasthan, wresting it from the Congress.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"Express OpinionOn India-China ties, Delhi takes one step forward, two steps backSubscriber Only","pic":"//images.indianexpress.com/2024/12/BORDER21id.jpg?w=210","link":"https://indianexpress.com/article/opinion/columns/india-china-bilateral-relation-9736855/","contents":{"image":"https://images.indianexpress.com/2024/12/Two-steps-forward-one-step-back_Premium-01.jpg?w=640","text":"\n\t\t\t\t\t\t\t\n\t\t\t\t\t\tOpinion by Jabin T Jacob\t\tJabin T JacobWhile Indian statements on the bilateral relationship with China are exercises in brevity, Chinese statements are more expansive by comparison. Taken together, however, they provide a picture of how the relationship is evaluated by each side. With the 23rd meeting of the Special Representatives (SRs) on the India-China boundary question concluding in Beijing earlier this week, bilateral exchanges at the highest levels might have gotten closer to regular service but the meeting also highlights continuing differences.Comparing the six statements on SR meetings that have come out (three from each country) since the first “informal summit” between Indian Prime Narendra Modi and Chinese President Xi Jinping in Wuhan in 2018 — the 21st (in Chengdu, November 2018), the 22nd (in New Delhi, December 2019) and the latest one — it is evident that the Indian side has increasingly weak expectations of the relationship.In its statement on the latest meeting, the Indian side specifically referenced the “frictions (that) had emerged… in 2020” and appeared keen to underline the decisions of the new patrolling arrangement and conclusion of the disengagement process as well as separate developments such as the “resumption of the Kailash Mansarovar Yatra, data sharing on trans-border rivers and border trade”. The Chinese too, noted the latter point but otherwise merely “positively evaluated the solutions reached by the two countries on border-related issues”.While the latest Indian statement stressed the need “to use, coordinate and guide the relevant diplomatic and military mechanisms” to “maintain peace and tranquillity on the border and advance effective border management”, there was no talk any longer about specifically “promot(ing) exchanges and communication between the border personnel”, reflecting perhaps, the desire to reduce direct contacts between the actual troops on the ground as well as the reality of no-patrolling buffer zones in some areas along the LAC.As in 2021, so also in their latest statement, the Chinese described a six-point consensus that the Indians did not acknowledge as such. While past Indian statements have described talks as “constructive and forward-looking” the latest talked instead about “resolv(ing) to inject more vitality into this process”.Oddly, however, the Indian SR statement talks about “seeking a fair, reasonable and mutually acceptable framework for the settlement of the boundary question” even though such a framework already exists in the form of bilateral treaties, particularly, the 2005 Agreement on Political Parameters and Guiding Principles for the Settlement of the India-China Boundary Question. The Chinese references to the 2005 Agreement in its latest statement as well as in the last one obviously do not hold much weight given how they have repeatedly violated it. India, by contrast, has displayed a reluctance to refer directly to extant legal agreements and has — like the Chinese — preferred to reference instead the “guidance”, “directions” or “decision” of meetings between Modi and Xi.The danger now exists — as was the case post-Doklam in 2017 — that the Indian government could once again take its foot off the gas pedal of sustained political, diplomatic, military and economic pressure on China in order to achieve short-term interests. While another round of “informal summits” is hopefully out of the question, formal exchanges also need to be carefully calibrated in terms of their frequency, scope and deliverables.Consider “the imperative of a diplomatic effort to defuse these heightened tensions and restore peace and tranquillity” that External Affairs Minister S Jaishankar in his statement to Parliament earlier this month said was his government’s effort following the 2020 transgressions. Why defusing tensions and the need to restore peace is always an Indian “imperative” but not a Chinese one is a question the Indian government has yet to answer. Instead, Indian diplomacy on China has for some time swung between extremes – either pomp and ceremony signifying little or a rather masochistic thrill in simply undergoing the ragda (Hindi slang for pointless grind, often as punishment) of endless talks as a way of proving one’s diplomatic chops rather than actually focusing on the actual outcome and its longer-term implications.And the outcome — even as many on the Indian side crow about strategic patience and resolve having paid dividends in the form of the disengagement process underway in eastern Ladakh — is simply that the Chinese have driven down Indian expectations of a peaceful boundary resolution to an all-time low given that the problem of de-escalation has to be dealt with first. In essence, then, it is the Chinese that have shown strategic patience and resolve having forced the Indians to back down from strong positions, even if these were morally and politically justifiable ones. It is quite likely that de-escalation will now proceed even more slowly than disengagement did, if it proceeds at all.Given that India’s lack of proactive, like-for-like responses to China’s 2020 violations of bilateral agreements on the LAC is now clear, Beijing can perhaps breathe a little easier that the front with India is not likely to pose a major threat if China were to concentrate on its other fronts with active territorial disputes. For China then, its 2020 action and the current disengagement process is effectively a case of two steps forward, one step back, and one step gained.This reality might draw even more pressure from the Americans under Donald Trump – now stronger and more determined to follow through with his threats to adversaries and friends alike – for New Delhi to get with the larger American approach to China instead. It also risks confirming for India’s other partners similarly involved in long-standing tensions with China that New Delhi cannot be expected to intervene usefully in order to reduce Chinese pressure on them.The writer is associate professor, Department of International Relations and Governance Studies, and director, Centre of Excellence for Himalayan Studies, Shiv Nadar University, Delhi NCRYou want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"Around TownInside Mumbai’s 101-year-old Noor Mohammadi Hotel, the eatery that made Nalli Nihari a household name","pic":"//images.indianexpress.com/2024/12/Indian-Express-13.jpg?w=210","link":"https://indianexpress.com/article/cities/mumbai/around-town-mumbai-101-year-old-noor-mohammadi-hotel-eatery-m-f-husain-ustad-zakir-hussain-nalli-nihari-9737404/","contents":{"image":"https://images.indianexpress.com/2024/12/Indian-Express-13.jpg?w=640","text":"Mumbai is often called the City of Dreams, a place where countless people arrive daily with hopes of building a better life. Noor Mohammadi Hotel, which celebrated its centenary anniversary in September last year, embodies that aspiration.Founded in 1923 by Abdul Kareem, who hailed from Sambhal—a region now in the spotlight over disputes about the origins of the Shahi Jama Masjid—the eatery began as a modest ‘bhatiyar khana,’ a kitchen-cum-sale counter serving food from large pots. Over time, it grew into a dhaba and eventually a full-fledged restaurant.“My grandfather Abdul Kareem used to serve ‘halwa paratha’—a delicacy featuring paratha stuffed with sooji or atta halwa—during ‘Urs’ at the Kaliyar Sharif Dargah. The earnings from this 15-day fair sustained our family for the year, but he eventually moved to Bombay to earn some more,” recalled Khalid Hakim, who, along with his younger brother Raashid, represents the third generation running the establishment.In those days, Bhendi Bazaar was a bustling neighbourhood where migrants, including zari workers, tailors, and vendors, settled to find work. The area was said to be frequented by luminaries of Indian literature, such as Saadat Hasan Manto and Kaifi Azmi, was central to the Progressive Writers Movement, and had connections with renowned figures in Indian cinema, including Dilip Kumar and Mehboob Khan.Amid this, Abdul Kareem introduced Nalli Nihari, a dish Khalid maintains was unfamiliar to the city at the time.“Nalli Nihari is now a delicacy served in the finest of restaurants but back then nobody had even heard of it in this city,” said Khalid, adding that the dish was made for the last Mughal emperor Bahadur Shah Zafar. “At that point, the hakims in his durbar came up with this highly nutritious dish. The word ‘nalli’ means marrow-filled bones that are slow-cooked overnight—allowing the flavours to meld and the meat to become tender — and ‘nihari’ refers to food eaten in the morning (‘nihar’),” he shared, adding that the meat is meant to be so tender that even a toothless person can enjoy it.The dish’s popularity helped the eatery expand into a dhaba and later a restaurant named ‘Noor Mohammadi’—a suggestion by Abdul Kareem’s wife. As the legend goes, when Kareem decided that he had made enough money and planned to return to his village, his son Abdul Hakim persuaded him to transform the eatery into a proper restaurant. The father said that if he wishes to do so, he has to first hone his skills in the kitchen and when he did, he allowed him to transform his eatery into a restaurant in 1966.Khalid himself joined in the early 1980s after finishing SSC and brought further upgrades, including a family dining section inaugurated by Sanjay Dutt in 1986. “While most in the neighbourhood invited Dilip Sa’ab, I wanted someone my age. When I expressed this desire to a relative of mine, he took me to meet Sanjay Dutt. Upon the mention of the name ‘Noor Mohammadi’, Sanjay told us that he regularly orders from our restaurant,” he shared, showing us a black and white photo of a young Dutt in the premises, adding with a chuckle that he had forgotten to keep a pair of scissors that day.“Sanjay Dutt is a foodie. Once while chatting, he shared his recipe for chicken curry. My younger brother Raashid noted it down and prepared the spicy, gravy-based dish. When it was presented to Sanjay, not only did he approve of it but also suggested the name ‘Chicken Sanju Baba’,” he shared. The rest, they say, is history. Today, Sanju Baba Chicken is among its top-selling dishes, alongside Nalli Nihari, Shami Kabab, Chicken Hakimi, Chicken Achari and Dal Ghee, all of which see crowds flocking from near and far to Noor Mohammadi Hotel.Noor Mohammadi has also hosted other notable patrons, including the late M F Husain, who once created an impromptu sketch of a rooster calling out to their Nalli Nihari to express his admiration for the dish. Today, that sketch hangs proudly alongside black-and-white photographs of Abdul Kareem and Abdul Hakim, as well as an Instagram post by food writer Nigella Lawson praising their Chicken Hakimi as “out of this world.”The restaurant’s secret lies in its cooking methods and spice blends. “We don’t freeze food or cook on order. Everything is slow-cooked in copper handis over coal, in batches. Once a dish is sold out, it’s gone for the day,” explained Khalid. To preserve their culinary legacy, the family launched a spice brand, Hakim, allowing customers to recreate their dishes at home.“The secret is in the spices—the proportions of which only we know,” he said, introducing us to his son Wazhad Hakim, who has joined the business recently, and is learning the tricks of the trade.Over the years, the family has also entered the catering space but only for limited guests. “We cater primarily to non-Muslim weddings, offering premium services with a smaller non-vegetarian section,” Khalid noted. When asked if a franchise is in plans, he refused, saying that they have no branches except a restaurant in partnership in Kurla. However, they are eyeing expansion. “We are in talks and hopefully, there will be a Noor Mohammadi Hotel in Saudi Arabia in 2025,” he concluded.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.Shiv Sena (UBT) MP Sanjay Raut on Saturday reiterated that the party may go solo in the upcoming civic polls including in the Brihanmumbai Municipal Corporation (BMC). The chief spokesperson of the party led by Uddhav Thackeray claimed that the Sena (UBT)’s hold in Mumbai is undisputed and if it does not win there, “the city would be separated from Maharashtra by the ruling alliance”.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"UPSC Essentials Why Hindu gods dance, and those in other religions don’t","pic":"//images.indianexpress.com/2024/12/WhatsApp-Image-2024-12-20-at-1.48.47-PM.jpeg?w=210","link":"https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/devdutt-pattanaik-why-hindu-gods-dance-and-those-in-other-religions-dont-9736347/","contents":{"image":"https://images.indianexpress.com/2024/12/WhatsApp-Image-2024-12-20-at-1.48.47-PM.jpeg?w=640","text":"(The Indian Express has launched a new series of articles for UPSC aspirants written by seasoned writers and scholars on issues and concepts spanning History, Polity, International Relations, Art, Culture and Heritage, Environment, Geography, Science and Technology, and so on. Read and reflect with subject experts and boost your chance of cracking the much-coveted UPSC CSE. In the following article, Devdutt Pattanaik, a renowned writer who specialises in mythology and culture, explores diverse forms of dance across India in a broad stroke, capturing their multifaceted expressions of human creativity, rituals, cultures and identities.)Dance is an integral part of culture. It cannot be captured in a museum — except as photographs or videos. But as a performance, it is something that changes with time and space. Therefore, like music, it is an intangible heritage. Hindu temple art shows gods dancing – Shiva dancing, Krishna dancing, Ganesha dancing. The dance of devadasi is how gods were entertained in temples. But we will never see images of Buddha dancing, the Tirthankaras dancing, the Islamic prophets dancing. In fact, dance is haram in orthodox Muslim traditions while in mystical traditions of Sufism, and the bhakti movement, dance is a tool to experience the divine. In Europe, dance was linked to paganism and rejected by Christianity. Dance thus reveals the ideology of different faiths, different communities, and different tribes. For Hindus, it represented worldliness. For Buddhists, it represents temptation. Monotheistic faiths associated it with idolatry. Evidence of Indian dance comes from ancient times. The earliest is the ‘wizard dance’ of Bhimbetka caves in Central India, where people wearing horns are seen dancing. This belongs to the Stone Age. In Harappa we see seals of seven people, dressed in the same clothes, dancing around a tree. It is an indicator of a form of tribal dance. Like in the Bhimbetka caves, the dancers wear horns.In the Vedas, dance is not discussed as much as music — remember Vedas as “shruti”, to be heard. Sama Veda gave melodies to the hymns of Rig Veda.Yajur Veda introduces the idea of mudra (gestures) during ceremonies. This is said to have been the origin of dance. Later, dance and song were used as entertainment during Vedic ceremonies to tell stories related to ancient kings, sages and gods. Sculptures from the Mauryan period (321–185 BCE) at sites like Sanchi, Barhut, and Amaravati include representations of dancers. Similarly, Greek dancers in Gandharan Buddhist art imitate the followers of Bacchus/Dionysus (the Greek god of wine and ecstasy). By the Gupta period, terms like “nritya”  (expressive dance) and “nataka” (drama) appeared with Bharata Muni’s Natyashastra emerging as the classical treatise on the performing arts. In the heavens, this was the domain of apsaras (celestial dancers). On earth, this was done by ganikas (courtesans). The dance manuals in classical texts such as the Natyashastra speak of abhinaya (expressions), mudra (gestures), and angika (postures). Movements follow the rules of geometry. There is much in dance to indicate it was the forerunner of yogic asanas (yoga postures).Sanskrit plays, and Puranic stories, refer to a dance competition between gods, apsaras and royal dancers. In Tamil temple lore, Shiva competes with Shakti in a dance competition, and wins by raising a leg which the goddess is too shy to do. Then there is the story of how Bhasmasura is asked by Mohini to dance with her. By following her movements, Bhasmasura touches his head and is reduced to ash.Islam forbids dance. But Mughals who married Rajput women encouraged the tawaifs (courtesans) to perform in their courts. Thus dance was patronised in royal courts, reminding one of the dancing halls of temples, as well as the dance performed in the heavenly court of Indra. These dances continue even today in Bollywood films. Shastra means a subject that is well documented, with details classified. Classical dance is a shastra because it has a long history, is documented in some formats and requires training to perform as well as appreciate it. India has seven classical dance forms, each with distinct styles and origins. Kathakali and Mohiniattam are theatrical and performative. Bharatanatyam, characterised by its geometric and angular movements, is a modern refined version of the temple dances of the Devadasis. Kuchipudi dancers often dance on plates while Odissi is more soft and fluid, with the tribhanga pose — where the body bends in opposite directions at the neck, hips, and knees.Then, we have Sattriya from Assam, the last dance form to be given classical status. In the North, we only have Kathak as a notified classical dance form, which was performed first in temples, and then in courts.Chhau, a masculine, almost military, dance form, is performed in Bengal, Odisha, and Jharkhand. Masks are an integral part of Purulia Chhau in Bengal and Jharkhand. In Odisha, masks are not worn. Although Chhau is not as refined as the classical dance forms, some consider it classical. However, this folk-classical distinction is a contentious issue and annoys many people.Sometimes folk performances are also linked with rituals, like Karnataka’s Bhoota Kola or Kerala’s Theyyam. These performances reflect subaltern traditions, showcasing how they communicate with gods and relate to nature. In Ladakh and Shillong, one finds masked dancers enacting stories of Buddhist siddhas defeating demons and taming angry spirits. The aim of folk dance is also to unite the community through synchronised dance with simple steps and a basic percussive beat. In tribal communities, dance is usually collective rather than individual. This gave rise to harvest rituals, like the Bihu dance of Assam, typically performed during harvest. The tribes of the Northeast have many unique dances that symbolise their unique identity. Dance such as nautanki and lavani are meant for the entertainment of the masses. Thus dance can be a vehicle for politics, philosophy, festivals, rituals, identity, and entertainment. What types of dance competitions are mentioned in Sanskrit plays and Puranic stories?In Tamil temple lore, how does Shiva win the dance competition against Shakti? Which Veda introduces the idea of mudra (gestures), and in what context?How are folk performances like Bhoota Kola in Karnataka and Theyyam in Kerala connected to rituals and subaltern traditions?How can dance serve as a medium for politics, philosophy, festivals, rituals, identity, and entertainment?(Devdutt Pattanaik is a renowned mythologist who writes on art, culture and heritage.)Share your thoughts and ideas on UPSC Special articles with ashiya.parveen@indianexpress.com.Subscribe to our UPSC newsletter and stay updated with the news cues from the past week.Stay updated with the latest UPSC articles by joining our Telegram channel – IndianExpress UPSC Hub, and follow us on Instagram and X.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.Google has suggested changes to its agreements with Apple and other companies to be the default search engine on new devices, following a U.S. ruling that found it to have unlawfully dominated online search. However, the government is pushing for more extensive solutions, such as selling off Chrome and possibly its Android system.Read UPSC MagazineThis No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"Health and WellnessHow gut health is easy to restore with this 10-step guide","pic":"//images.indianexpress.com/2024/12/Untitled-design-2024-12-21T115733.639.jpg?w=210","link":"https://indianexpress.com/article/health-wellness/gut-health-easy-restore-10-step-guide-9737381/","contents":{"image":"https://images.indianexpress.com/2024/12/Untitled-design-2024-12-21T115733.639.jpg?w=640","text":"In today’s fast-paced world, gut health is more important than ever. Why? Because it’s the foundation of your digestion, nutrient absorption and even your mental well-being. Yet, so many of us face issues like bloating, inflammation, leaky gut and mood swings. The silver lining? Understanding what’s causing these problems and making a few science-backed changes can work wonders for your gut and, ultimately, your life.Modern life has thrown our gut microbiome—the trillions of bacteria and microbes living in our digestive system—out of balance. Processed foods, sugary snacks and unhealthy fats feed harmful bacteria and cause inflammation, reducing the diversity of the good bacteria we need for a healthy gut. While antibiotics save lives, they also wipe out beneficial bacteria. Other drugs like antacids and painkillers can damage the gut lining, affecting immunity and nutrient absorption. Stress affects the gut-brain axis, a bidirectional communication system between the central nervous system and the gut. Persistent stress can lead to inflammation, poor digestion and imbalances in gut bacteria. Of course, lack of sleep and a sedentary lifestyle reduce the variety of your gut microbes, leading to constipation and sluggishness. Not drinking enough water slows digestion and hampers nutrient absorption.The good news? Your gut is remarkably resilient, and you can restore its health with some thoughtful changes. Here’s how:1. Prioritise Whole Foods: Have fruits like apples and berries, vegetables like spinach and broccoli, lean proteins like chicken and fish, legumes like lentils and chickpeas, and whole grains like quinoa and brown rice. These nourish your good bacteria and reduce inflammation.2. Boost Fibre Intake: Aim for 25-30 grams of fibre daily from foods like oats, beans, whole grains, and vegetables for a strong gut lining.3. Eat Fermented Foods: Yogurt, kefir, kimchi, sauerkraut, and kombucha are packed with probiotics, which are live bacteria and yeasts that balance your gut bacteria.4. Cut Back on Sugar and Sweeteners: Refined sugar and artificial sweeteners can harm your gut. Opt for natural sweeteners like honey or monk fruit, in moderation.5. Manage Stress: Practise mindfulness, yoga, or deep breathing, which reduce gut inflammation.6. Stay Hydrated: Aim for 2-3 litres of water daily. Herbal teas and water-rich foods help, too.7. Get Moving: Regular exercise like walking, jogging, or strength training boosts gut health by enhancing microbiome diversity.8. Sleep Well: Prioritise 7-8 hours of quality sleep. A consistent sleep routine helps your gut repair itself.9. Use Antibiotics Wisely: Take them only when prescribed and necessary. After a course of antibiotics, replenish your gut with probiotics.10. Incorporate Healthy Fats: Eat more omega-3s (from fish, flaxseeds, and walnuts) and fewer omega-6-rich oils (like corn, soy, and sunflower). This balance helps reduce inflammation.Gut issues may be a modern challenge, but they’re not unbeatable. Your gut is always talking to you — are you ready to listen?(Thakkar is a functional medicine expert)You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.Noor Mohammadi Hotel, a century-old establishment in Mumbai's bustling Bhendi Bazaar, has a rich history of serving traditional dishes like Nalli Nihari and Chicken Sanju Baba. Founded by Abdul Kareem in 1923, the eatery has seen famous patrons like Sanjay Dutt and M F Husain. With plans to expand to Saudi Arabia, the family is also preserving their legacy through a spice brand, Hakim.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"SPONSOREDWhen Razorpay checked into Zostel: A 10-Year Journey with Razorpay's First Startup Customer Is Full Of Amazing Stories","pic":"//images.indianexpress.com/2024/12/razorpay-zostel-lead-image-1a_28355e.jpg?w=210","link":"https://indianexpress.com/article/branded-content/when-razorpay-checked-into-zostel-a-10-year-journey-with-razorpays-first-startup-customer-is-full-of-amazing-stories-9733674/","contents":{"image":"https://images.indianexpress.com/2024/12/razorpay-zostel-lead-image-1a_28355e.jpg?w=640","text":"“When two startups with a shared vision grow together, they amplify each other’s impact. Razorpay has been more than a payment partner—it’s been an enabler of dreams”. ~ Dharamveer Singh Chouhan, Co-founder, and CEO of ZostelA Fortuitous Meeting of Two StartupsWhat happens when a techie with a dream of building seamless digital payments meets a poker-playing backpacker-turned-hospitality disruptor? You get one of the most fascinating partnerships in Indian startup history: Razorpay and Zostel. Over the past decade, these two have done more than just carve out niches in payments and backpacker hospitality—they’ve revolutionized their industries while cheering each other on from the sidelines. It’s not every day you hear of a founder funding their payment gateway partner as an angel investor before even becoming a customer. Or of a backpacker hostel chain redefining the norm to become the world’s largest, powered by a payment system so seamless, it’s almost invisible. This is the story of two startups whose paths crossed serendipitously in Jaipur and have since scaled new heights together, one transaction and one hostel at a time. On the occasion of Razorpay’s 10th anniversary, we caught up with Dharamveer Singh Chouhan, Co-founder, and CEO of Zostel, to delve into his entrepreneurial journey, his early association with Razorpay, and how their shared ethos of solving real problems has driven them forward. Rahul Kothari, COO of Razorpay, said, “At Razorpay, our mission has always been to empower businesses with solutions that make growth effortless. Partnering with Zostel over the past decade has been a privilege—they embody the spirit of innovation and community-building. Watching their journey from a single hostel in Jaipur to a global brand has been inspiring, and we’re proud to be the silent force enabling their dreams, one seamless transaction at a time”.Zostel’s Journey from Jaipur to Global ExpansionDharamveer’s story is as inspiring as it is unconventional. Hailing from a family of entrepreneurs in Jodhpur, he carved his path, veering away from traditional businesses to embrace technology. A techie at heart, he founded his first gaming studio during his college years, which Zynga later acquired. Yet, his wanderlust and exposure to European backpacker hostels ignited a new idea. “I realized India lacked an ecosystem for affordable, community-driven travel. Backpacker hostels were not just about lodging but fostering connections. That thought stayed with me,” Dharamveer recounts. In 2013, with winnings from online poker tournaments, Dharamveer and his co-founder launched Zostel in Jaipur. What began as a single hostel has since blossomed into the world’s largest chain of backpacker hostels, with 100+ locations across India and expansions underway in celebrated and prominent destinations. Zostel and Razorpay’s journeys share a serendipitous starting point in Jaipur. When Razorpay launched its developer-first payment gateway solution, Dharamveer became an angel investor and an early customer. “Payments were a nightmare in those days—failed transactions blocked money and clunky integrations. Razorpay’s passion for solving these issues stood out. As a techie, I knew this was a game-changer,” Dharamveer shares. Zostel integrated Razorpay from the start, benefiting from its seamless operations and customer-first focus. This partnership proved invaluable during critical phases, including Zostel’s pandemic campaign, “Travel for Tomorrow,” where prepaid bookings helped sustain operations amidst lockdowns. Customer-Centricity: The Cornerstone of InnovationFor both Razorpay and Zostel, customer-centricity has been the cornerstone of innovation. Razorpay’s ability to adapt to industry trends whether through UPI integration, pay-later options, or seamless refunds has allowed Zostel to stay focused on delivering exceptional travel experiences. “Razorpay works so smoothly that it’s invisible—a hallmark of great infrastructure,” Dharamveer notes. Meanwhile, Zostel has evolved beyond hostels into pioneering ventures like Zostel Homes and Zo House, blending technology, real estate, and community. Zo House, a members-only space for creators and innovators, exemplifies this spirit, offering luxury living fused with creativity and collaboration. Zostel’s ethos is deeply rooted in community-building. Dharamveer emphasizes how hostels foster meaningful connections where solo travelers find safety and companionship or couples meeting for the first time at a Zostel café and later tying the knot. “Our philosophy is simple: create inclusive spaces where everyone feels welcomed. It’s not just about travel but transforming lives,” Dharamveer explains. This commitment extends to Zostel’s inclusive employment practices and mentorship programs, empowering staff to grow into property managers and even owners. As Zostel and Razorpay step into their next chapters, their partnership remains a testament to the power of collaboration. While Zostel focuses on global expansion and redefining hospitality, Razorpay continues to innovate in India’s burgeoning fintech space and continues to power payments for 80 of the 100 Unicorns in India. Reflecting on their intertwined journeys, Dharamveer sums it up perfectly: “When two startups with a shared vision grow together, they amplify each other’s impact. Razorpay has been more than a payment partner—it’s been an enabler of dreams.”Disclaimer:\n\nThis content is sponsored and does not reflect the views or opinions of IE Online Media Services Pvt Ltd. No journalist is involved in creating sponsored material and it does not imply any endorsement whatsoever by the editorial team. IE Online Media Services takes no responsibility for the content that appears in sponsored articles and the consequences thereof, directly, indirectly or in any manner. Viewer discretion is advised.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.In a significant ruling on Friday, a United States District Court held Israeli technology company NSO Group liable for targeting the devices of 1,400 WhatsApp users. NSO Group is the maker of the Pegasus spyware allegedly used by its government clients to infect the devices of several WhatsApp users, including activists, journalists, and other members of the civil society.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"SPONSOREDDream Sports Foundation joins forces with MSSA to push school sports in Mumbai","pic":"//images.indianexpress.com/2024/12/feature-image-2024-12-18T170540.332.jpg?w=210","link":"https://indianexpress.com/article/business/sponsored-business/dream-sports-foundation-joins-forces-with-mssa-to-push-school-sports-in-mumbai-9731226/","contents":{"image":"https://images.indianexpress.com/2024/12/feature-image-2024-12-18T170540.332.jpg?w=640","text":"In a bid to raise the standard of youths in sports, Dream Sports Foundation (DSF) has forged a five-year partnership with the Mumbai School Sports Association (MSSA).The collaboration is set to impact over 75,000 students, spans 20 sports, including Hockey, Football, Cricket, Athletics, Table Tennis, and Badminton, a statement by Dream Sports read.MSSA, founded in 1893, has a legacy of nurturing legendary athletes such as Dilip Vengsarkar, Sachin Tendulkar, Ajit Agarkar, and Yashasvi Jaiswal. Over the years, it has played a crucial role in shaping Mumbai’s sporting culture. Through this partnership, DSF aims to continue its mission to improve the quality of school sports in alignment with the National Sports Policy 2024.Key details of partnership:Bhavit Sheth, the Chief Operating Officer and Co-Founder of Dream Sports expressed his enthusiasm about the partnership, stating, “We’re thrilled to partner with an association that is integral to Mumbai’s grassroots sporting culture and has made the city proud. In line with our vision to Make Sports Better, we’re excited to support young  athletes and help unlock their potential while contributing to India’s vision of becoming a sporting superpower.” Rev. Fr Jude Rodrigues, President of MSSA, also welcomed the collaboration, highlighting its potential to strengthen Mumbai’s sporting future and legacy. “This collaboration will help Mumbai athletes stay ahead of the curve while adhering to the foundation’s vision and mission. This partnership marks the beginning of an exciting journey to add to  Mumbai’s illustrious sporting legacy,” he said.About Dream Sports Foundation: Dream Sports Foundation is the philanthropic arm of Dream Sports, India’s leading sports technology company with brands such as Dream11, FanCode and DreamSetGo in its portfolio. DSF’s vision is to make sports better by bridging the gaps in the sporting ecosystem. One of DSF’s key sports initiatives is ‘DreamGold’, a long-term elite athlete development program that is proud to support athletes like Sreeja Akula and Nethra Kumanan. To support young, promising athletes, DSF has curated partnerships with the Mary Kom Regional Boxing Foundation, Bhaichung Bhutia Football Schools, the Dilip Vengsarkar Foundation, and The Karnam Malleswari Foundation. In 2024, DSF also launched the Dream Sports Championship with a football edition for the U-17 age group.About MSSA: Founded in 1893, the Mumbai School Sports Association (MSSA) aims to promote fitness and discipline through active sports and games participation among thousands of school-going students in Mumbai. The association conducts championships across 20 sports, organizing 177 tournaments that engage approximately 75,000 students from 484 member schools. Established with a vision to inspire and elevate, MSSA has become a hub for athletes and sports enthusiasts alike. The foundation rests on its commitment to nurturing talent, fostering camaraderie, and promoting a healthy, inclusive sporting environment.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.Katrina Kaif has a close bond with her husband Vicky Kaushal and mother-in-law Veena Kaushal. She recently shared her secret for gorgeous hair - her homemade oil. She also praised her husband's understanding nature.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"PM Modi arrives in Kuwait, to hold talks on defence, securityKuwaiti Emir Sheikh Meshal Al-Ahmad Al-Jaber Al-Sabah had invited PM Modi to Kuwait.","summary":"","link":"/india-news/pm-narendra-modi-arrives-in-kuwait-to-hold-talks-on-defence-security-101734773703243.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/PTI12-21-2024-000117A-0_1734773774165_1734773812028.jpg","text":"Subscribe Now! Get features likePrime Minister Narendra Modi arrived in Kuwait on Saturday for a two-day official trip. During his stay, he will hold bilateral talks with the Gulf country's leadership and meet the Indian diaspora.Kuwaiti Emir Sheikh Meshal Al-Ahmad Al-Jaber Al-Sabah had invited PM Modi to Kuwait. Indira Gandhi was the last PM to visit the country in 1981.Indian officials said that bolstering defence and security cooperation will be a key focus of the visit.The Ministry of External Affairs also said discussions were underway with Kuwait for a bilateral investment treaty and a defence cooperation agreement.Arun Kumar Chatterjee, secretary (Overseas Indian Affairs) in the ministry, told HT that some bilateral agreements are expected to be finalised during the visit. He said that the visit is expected to strengthen ties between India and the Gulf Cooperation Council (GCC), currently chaired by Kuwait.Before departing, PM Modi said his talks with top Kuwaiti leadership would be an opportunity to chalk out a roadmap for a futuristic partnership between the two nations. “I look forward to my meetings with His Highness the Amir, the Crown Prince and the Prime Minister of Kuwait. It would be an opportunity to chalk out a roadmap for a futuristic partnership for the benefit of our people and the region,” he said.\"We deeply value the historical connection with Kuwait that has been nurtured over generations. We are not just strong trade and energy partners but also have shared interest in peace, security, stability and prosperity in the West Asia region,\" he added.India is one of the top trading partners of Kuwait. The country also has a sizable population of Indian expats; 30 percent of the country's workforce is Indian.Indian workers top the Private Sector as well as domestic sector (DSW) workforce list, according to the Indian Embassy in Kuwait.Kuwait is among India's top trading partners, with bilateral trade valued at USD 10.47 billion in the financial year 2023-24.Kuwait is India's sixth largest crude supplier, meeting 3 percent of the country's energy needs.With inputs from PTI, ANI"}},{"headline":"ISRO finds new partner in Europe to help with space exploration","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/photo-1446776709462-d6b525c57bd3_1734777886896_1734777940603.jpg","summary":"ISRO and ESA have signed a collaboration agreement to enhance human space exploration, focusing on astronaut training, mission implementation, and research.","link":"/india-news/isro-finds-new-partner-in-europe-to-help-with-space-exploration-101734777808858.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/photo-1446776709462-d6b525c57bd3_1734777886896_1734777940603.jpg","text":"Subscribe Now! Get features likeThe Indian Space Research Organisation (ISRO) and the European Space Agency (ESA) have forged a new collaboration aimed at advancing human space exploration. The two agencies signed a comprehensive agreement on Saturday to cooperate on astronaut training, mission implementation, and a variety of research experiments in space.The agreement, signed by ISRO Chairman S Somanath and ESA Director General Josef Aschbacher, lays the foundation for a range of joint activities focused on human spaceflight. Specifically, the agreement will cover areas such as astronaut training, development and integration of space experiments, utilization of ESA facilities on the International Space Station (ISS), human and biomedical research, as well as joint educational and outreach programs.One of the first major projects under the new agreement will be the Axiom-4 mission, which is set to launch with a crew that includes both ISRO's Gaganyatri astronaut and an ESA astronaut. As part of this mission, the two agencies will work together to implement a series of experiments proposed by Indian Principal Investigators on the ISS. Additionally, ISRO and ESA will explore further collaboration in ESA’s human physiological studies, technology demonstrations, and public outreach activities.In remarks following the signing, Somanath highlighted ISRO's roadmap for human spaceflight, emphasizing the agency’s long-term vision for expanding its presence in space. He also pointed to the recent approval of the Bharatiya Antariksh Station (BAS), India’s upcoming indigenous space station, as a significant opportunity for fostering interoperability between different human spaceflight platforms.Aschbacher expressed his appreciation for the progress made in strengthening ties between the two space agencies. He thanked Somanath for addressing the ESA Council and praised the agreement as a solid framework for future collaboration in space exploration.Both ISRO and ESA leaders expressed satisfaction with the progress made so far on the Axiom-4 mission and reaffirmed their commitment to continuing joint efforts in the field of human spaceflight. The partnership between the two agencies is expected to open new doors for scientific research, space technology advancements, and global collaboration in the coming years."}},{"headline":"‘There is krish koop…’: ASI surveys Sambhal's 'Kalki Vishnu' temple","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/PTI12-21-2024-000061B-0_1734775311751_1734775323589.jpg","summary":"A team of ASI stayed at the sire for about 15 minutes and also visited the temple to determine the age of the ancient well located inside its premises.","link":"/india-news/asi-surveys-sambhals-kalki-vishnu-temple-101734775062637.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/PTI12-21-2024-000061B-0_1734775311751_1734775323589.jpg","text":"Subscribe Now! Get features likeA survey of Sambhal's 'Kalki Vishnu' temple premises was conducted by the Archaeological Survey of India (ASI) team on Saturday, just a day after the agency conducted a survey of a recently discovered temple in the district.The priest of the Kalki Vishnu temple, Mahendra Prasad Sharma said it is good that the survey team came for a visit, PTI reported.\"There is a 'krish koop' (well) here. It is not closed but there is no water in it. This well is mentioned in the 'Skanda Purana' along with all pilgrimage sites of Sambhal. This well is on the temple premises, inside the old boundary,\" the news agency quoted the priest as saying.According to Vandana Mishra, Sambhal Sub-Divisional Magistrate, a team of ASI stayed at the site for about 15 minutes and also visited the temple to determine the age of the ancient well located inside its premises.\"There is a 'krish koop' here which is said to be an ancient well. Its age is yet to be determined. The team stayed for about 15 minutes and also visited the temple,\" she told PTI.On Friday, a four-member team of the ASI surveyed the recently discovered Shri Kartik Mahadev temple, five pilgrimage sites and 19 'koops' (wells).The Kartik Mahadev temple (Bhasma Shankar temple) was reopened on December 13 after the authorities said they stumbled upon the covered structure during an anti-encroachment drive.The temple housed an idol of Lord Hanuman and a Shivling. It had remained locked since 1978. The temple also has a well nearby which the authorities had planned to reopen.Sambhal District Magistrate Rajender Pensiya had earlier told reporters that the ancient temple and the well were being excavated.On December 12, the Supreme Court issued a significant directive, temporarily prohibiting courts across the nation from accepting new lawsuits and making any decisive interim or final rulings in ongoing cases related to the reclamation of religious sites, particularly mosques and dargahs."}},{"headline":"Chennai man plays rummy with money for mom's cancer treatment, dies by suicide","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/A-police-complaint-by-a-US-resident-about-his-miss_1676490120461_1734767640081.jpg","summary":"According to the report, the deceased took the extreme step after being scolded by his mother and brother for going “erratic.”","link":"/india-news/chennai-man-played-online-rummy-with-money-for-mothers-cancer-treatment-dies-by-suicide-report-101734767477305.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/A-police-complaint-by-a-US-resident-about-his-miss_1676490120461_1734767640081.jpg","text":"Subscribe Now! Get features likeA 26-year-old Chennai man reportedly died by suicide after being scolded by his mother and brother for allegedly spending the money she saved for her cancer treatment to play an online rummy game.The deceased went missing on Friday, and his body was found on Saturday morning, The Times of India reported.According to the report, the man, a resident of Second Street in Chennai's Chinnamalai, worked intermittently in a food business. The man's father died eight years ago and he lived with his mother and brother, it added.During the Covid-19 pandemic, he began playing online games, became a gaming addict, and stole ₹30,000, saved by his cancer patient mother for her treatment, to play rummy online.On Friday, the man's mother and brother chided him for going “erratic” and spending the money on the online game.The man went missing, and his family began looking for him. However, they could not contact him as his phone was switched off. They also looked for him at the houses of their relatives and his friends.At 3:30 am on Saturday, his family members checked their house's terrace, where they found he had taken the extreme step by strangling his neck using a TV cable wire in one of the rooms on the terrace.Upon receiving information, a team from Kottupuram police station arrived at the house and recovered the body. Police have launched an investigation into the incident. "}},{"headline":"Google exec says job which doesn't need a college degree is in high demand","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/photo-1516321318423-f06f85e504b3_1734769422368_1734769471240.jpg","summary":"The US Bureau of Labor Statistics expects such jobs to grow by over 30% in the next decade, which is three times faster than the average job growth rate","link":"/business/google-exec-says-job-which-doesnt-need-a-college-degree-is-in-high-demand-101734767026901.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/photo-1516321318423-f06f85e504b3_1734769422368_1734769471240.jpg","text":"Subscribe Now! Get features likeData analytics is a profession high in demand that could pay six-figure salaries without requiring a traditional college degree, according to a Moneycontrol report which cited Lisa Gevelber, Vice President at Google and founder of the Grow With Google program.Also Read: These 5 banks revise their fixed deposit interest rates: Check details“The demand for people who understand data and can use it to guide important business decisions is huge,” the report quoted Gevelber as having said.Data analysts identify trends from raw data and interpret them to create insights which can be used to help shape business strategies.They often use tools such as Excel, SQL, and Tableau to analyse metrics like sales performance or even website traffic to help companies operate more efficiently.The best part of data analytics is that it is more skill-based, rather than having the entry barrier of traditional education, with a variety of industry-recognised certifications and online training courses available.An example includes Google’s data analytics certification, which is available for $49 per month through the Grow With Google initiative. Others such as IBM and CompTIA, also offer such types of accessible training programs.Also Read: New Zealand falls into recession with abrupt economic slowdownThese certifications impart skills such as coding, working with spreadsheets, and visualising data.This is at a time when the US Bureau of Labor Statistics expects such jobs to grow by over 30% in the next decade, which is three times faster than the average job growth rate.\"The versatility of data analytics means that it doesn’t matter where you live or what industry you work in,\" the report quoted Gevelber as saying.She added that familiarity with artificial intelligence (AI) tools can give job seekers a significant edge since “using AI to clean and structure data or brainstorm visualizations can make you much more productive.”Also Read: How Zomato, Swiggy, Zepto are achieving disruptive 10-min food deliveriesEntry-level data analysts can expect to get a median salary of $93,000, while seasoned professionals may be able to take home around $110,000 annually, according to the report which cited Glassdoor.However, certain remote roles in industries like manufacturing, health care, tech, and finance, can pay even more, including amounts as much as $150,000 per year, according to the report."}},{"headline":"Delhi man stabbed to death after failing to repay ₹45,000 loan","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/Police-outside-Cambridge-School-in-Srinivaspuri-in_1734108262228_1734770391597.jpg","summary":"A 26-year-old man was fatally stabbed in Narela, Delhi, linked to a financial dispute. Three men have been arrested, while one suspect is still on the run.","link":"/cities/delhi-news/delhi-man-stabbed-to-death-after-failing-to-repay-rs-45-000-loan-101734769858729.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/Police-outside-Cambridge-School-in-Srinivaspuri-in_1734108262228_1734770391597.jpg","text":"Subscribe Now! Get features likeA 26-year-old man was stabbed to death in an apartment in the Narela area of outer north Delhi on Friday evening. The police have arrested three men in connection with the murder, which appears to be linked to a financial dispute.According to the police, Himanshu was found dead inside the flat he had been sharing with his friend Sumit Kaushik for the past four months. The police received a PCR call at 6:28 pm, and upon investigation, found that Himanshu was attacked and stabbed by four individuals, identified as Ravi, Sahil, Akshay Khatri, and Ashish.The police said that the complainant, Sumit Kaushik, witnessed the incident and stated that the accused arrived at the apartment around 6 pm, attacked Himanshu, and fled the scene. The motive behind the murder appears to be linked to a financial dispute, with Ravi allegedly borrowing ₹45,000 from Sumit Kaushik and failing to return it.The police said that Himanshu had reportedly visited Ravi's residence in Safiyabad and threatened his family, demanding repayment. Seeking revenge, Ravi, along with his accomplices, orchestrated the attack.The police have registered a case under relevant sections and arrested Ravi (30), Sahil (24), and Ashish (26). The police are still searching for Akshay Khatri, who is absconding.Earlier this month, an 18-year-old scrap shop worker was allegedly stabbed to death by his neighbours in a dispute over a common toilet not being flushed adequately.The deceased Sudheer reportedly objected to the common toilet not being flushed properly, which led to a fight between the accused's family and the deceased and his siblings.According to police, Bhikam Singh, his wife Meena, and their three sons Sanjay, 20, Rahul, 18, and a minor boy attacked the three youths. Using a kitchen knife, they stabbed Sudheer on his chest, face and scalp, which later proved fatal. His brother, Prem, 22, is undergoing treatment and his friend, Sagar, was discharged."}},{"headline":"Kohli victim of ‘EPDS’ as Chappell offers his advice: ‘He seems to need…'","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/Virat_Kohli_1734778115681_1734778115957.jpg","summary":"Former Australian captain Greg Chappell analysed Virat Kohli's struggle in recent times and called it Elite Performance Decline Syndrome or EPDS.","link":"/cricket/virat-kohli-victim-of-epds-as-greg-chappell-offers-his-advice-he-seems-to-need-a-buffer-101734776676597.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/Virat_Kohli_1734778115681_1734778115957.jpg","text":"Subscribe Now! Get features likeVirat Kohli has not been able to live up to expectations in the ongoing Border-Gavaskar Trophy. The batting maestro is under immense pressure despite scoring a century in the second innings at Perth, his numbers in the series turning out to be a big worry for the visitors. The former skipper has scored 126 runs in five innings while 100 of which came up in a single innings at Perth. The Aussie pacers have managed to exploit his weakness outside off-stump and he is constantly getting out in the same fashion.Former Australian captain Greg Chappell analysed Kohli's struggle in recent times and called it Elite Performance Decline Syndrome or EPDS, which he suggested even the likes of Sachin Tendulkar and Ricky Ponting went through.“The first visible sign of EPDS is a subtle but unmistakable shift in a player’s approach at the crease. Kohli, once renowned for his domineering starts, has in recent years shown a tendency to begin tentatively. Much like Tendulkar and Ponting before him, Kohli seems to need a buffer – a score of 20 or 30 – before he can rediscover his flow,\" Chappell wrote in his column for The Sydney Morning Herald. Chappell advised Kohli to set a target of getting to 20 or 30 first to take the psychological advantage and regain some confidence in the middle.“Reaching a score of 20 or 30 acts as a psychological turning point, helping them regain the confidence and fluency of their prime,\" he wrote.Kohli's first innings average in the 2024-25 season starting from the Bangladesh series is 73 runs in 8 completed innings with an average of 9.125. The sequence of scores are 6, 47, 0, 1, 4, 5, 7 and 3.Former India coach Chappell asserted that confidence is the key to returning to form.“The only cure that I know is to rekindle the thinking of your youth. That is easier to say than to do, but it does work. Confidence is an emotion – so if you can recreate that, there is no reason why you can’t reinvent yourself,\" Chappell suggested."}},{"headline":"Not Stree 2 or Kalki 2898 AD, this south hit is 2024's most-watched Indian film","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/Pushpa_2_The_Rule_1734774331840_1734774337540.jpg","summary":"A new year-end report from BookMyShow has revealed the biggest entertainment trends of the year, including the most-watched Indian films of 2024.","link":"/entertainment/telugu-cinema/not-stree-2-kalki-2898-ad-or-fighter-pushpa-2-the-rule-most-watched-indian-film-of-2024-sold-31-lakh-tickets-in-a-day-101734771812308.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/Pushpa_2_The_Rule_1734774331840_1734774337540.jpg","text":"Subscribe Now! Get features likeAs 2024 draws to a close, online ticketing platform, BookMyShow has released its year-end report on the biggest entertainment trends from the year. Using data from the platform, the report highlights the biggest winners and most popular films and live events from the year.Unsurprisingly, Allu Arjun-starrer Pushpa 2: The Rule has emerged as the most-watched movie of the year 2024 with 10.8 lakh solo viewers, according to the year-end report by BookMyShow. The film has scripted history by becoming only the third Indian title ever to cross ₹1500 crore at the box office. BookMyShow's report puts it at the top of the most-watched Indian films' list, ahead of other popular titles of the year, such as Stree 2, Singham Again, Bhool Bhulaiyaa 3, Kalki 2898 AD, HanuMan, Amaran, The Greatest of All Time, Devara Part 1, and Manjummel Boys.Pushpa 2: The Rule, a sequel to 2021’s blockbuster Telugu film Pushpa: The Rise, has been directed by Sukumar and sees Allu Arjun, Fahadh Faasil, and Rashmika Mandanna reprise their roles from the first film. The follow-up, which arrived in cinemas on December 5, was released in Hindi, Tamil, Kannada, Bengali and Malayalam languages.Pushpa 2 broke the record for the highest-opening by an Indian film ever, selling 31 lakh tickets for day one in just advance bookings, according to Sacnilk.According to the report, which analysed data between January 1 to December 5, November 1 was a blockbuster day on BookMyShow as the company sold a record-breaking 2.3 million tickets in just 24 hours.Taking note of the trend of old movies re-releasing in theatres, the report said films like Kal Ho Naa Ho, Tumbbad, Rockstar, and Laila Majnu turned “theatres into time machines for fans revisiting beloved classics”.Hollywood films, especially franchise titles like Deadpool & Wolverine, Dune: Part Two, Kingdom of the Planet of the Apes, and Godzilla x Kong: The New Empire, set screens ablaze with high-octane excitement, it added.Small-budget films like Aavesham, Laapaata Ladies, and Merry Christmas proved that authentic narratives resonate deeply, regardless of scale, the report said.(With PTI inputs)"}},{"headline":"This actor earned $95M for 20-minute role but hated his work in 'rubbish' filmThis Hollywood star, an Oscar winner, was not fond of his most famous role, one that earned him $95 million for a few days' work.","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/Alec_Guinness_1734777189100_1734777194195.jpg","summary":"","link":"/entertainment/hollywood/this-actor-earned-95-million-for-20-minute-role-alec-guinness-but-hated-his-dull-work-in-rubbish-film-star-wars-101734777051525.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/Alec_Guinness_1734777189100_1734777194195.jpg","text":"Subscribe Now! Get features likeImagine a $95-million paycheck for what amounts to just a few days of work in a film, translating to only 20 minutes of screen time. Most actors would give an arm and a leg for such a gig. But almost 50 years ago, when one man got this, he was so turned off by the film that he almost rejected the sequel and came back only for the director's sake. This is the story of a thespian who became a reluctant pop culture icon.By the mid-1970s, British actor Alec Guinness was a respected name in Hollywood and the UK. He had made a name for himself with acclaimed films like Kind Hearts and Coronets, The Man in the White Suit, The Lavender Hill Mob, and Great Expectations. He won the Oscar for Best Actor for Bridge on the River Kwai and later appeared in Lawrence of Arabia and Doctor Zhivago. Years after this, George Lucas contacted him to play a Merlin-like mentor character in a space opera he was making. He was offered $150,000 for the role but the actor demanded twice that, along with 2% of the backend grosses. Director George Lucas threw in another .25% as a goodwill gesture.The film was Star Wars, and the role was Obi-Wan Kenobi. Even though the character appeared for only 20 minutes in the film, it became a pop culture phenomenon, eventually becoming the role the Oscar winner would be known for. The profit-sharing agreement turned out to be a game changer for Guinness, as the franchise earned several billion over the next five decades, earning Guinness a staggering $95 million by his death in 2000.According to The Hollywood Reporter, Alec Guinness was not sold on Star Wars when he first read the script and only agreed to do the film because of the money. Privately, he had dismissed the script to friends as “fairy tale rubbish”, and was convinced he did not want to return to the character again. Later, he wrote in his diary that working on the film was 'dull rubbishy stuff'.However, once the film succeeded, the actor felt that he owed it to George Lucas to return and let him complete his character's arc. “I said yes to a day’s work on Star Wars II … It’s dull rubbishy stuff but, seeing what I owe to George Lucas, I finally hadn’t had the heart to refuse,” Guinness wrote a week after agreeing to act in The Empire Strikes Back in 1979. His character, Obi-Wan, was killed in the film. It was later revived in the prequel trilogy and played by Ewan McGregor. Obi-wan eventually starred in his own web series, titled Kenobi, which premiered on Disney+ this year with Ewan McGregor returning to the role. Funnily enough, Alec Guinness earned more for his 20-minute appearance over two movies than McGregor did over three films and a series."}},{"headline":"Shah Rukh was called ‘hakla’ behind his back, says singer Abhijeet Bhattacharya","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/abhijeet_shah_rukh_1734776482874_1734776483267.jpg","summary":"Singer Abhijeet Bhattacharya said there were many stars who would mock him for singing for Shah Rukh Khan's films.","link":"/entertainment/bollywood/shah-rukh-khan-was-called-hakla-behind-his-back-by-many-stars-claims-singer-abhijeet-bhattacharya-101734775718319.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/abhijeet_shah_rukh_1734776482874_1734776483267.jpg","text":"Subscribe Now! Get features likeSinger Abhijeet Bhattacharya was recently in the limelight after he reacted to a fan-made mashup of Dua Lipa's song Levitating and actor Shah Rukh Khan's famous track Woh Ladki Jo from his film Baadshah. He said that the song belonged to the singer first, so he must be named, not the actor. Now, in a podcast conversation on Subhankar Mishra's YouTube channel, the singer opened up about his decades-long working relationship with Shah Rukh, and whether they have patched up after all. (Also read: Abhijeet Bhattacharya salty about ‘Dua Lipa x SRK’ track going viral? Amplifies posts about not getting credit)During the conversation, Abhijeet shared how he was disappointed with a slew of songs in the 90s and even declined to sing a number of tracks because he did not like the composition. “I had become choosy, and I became a little too mindful on this and decided that I will not sing for anyone else but Shah Rukh. That became a problem, because many of his contemporaries called him ‘hakla’ (stammerer). So what happened was, there was an award ceremony in Dubai where I had won an award for Tumhe Jo Maine Dekha.”He added, “When I was getting down from the stage, there was one star who came forward and said, 'Aye! hakle ke liye gaa raha hai na tu (You are singing for that stammerer)?’ Two people said this together. I was shocked! I was like why are they feeling jealous, I got the award for my singing. After that experience, I kept losing interest in the playback singing and started focusing on my shows and concerts. Even today, I am very happy doing that.”Abhijeet has delivered several hit songs for Shah Rukh films, some of which are Tumne Jo Maine Dekha from Main Hoon Na, Tauba Tumhare Ishare from Chalte Chalte, Chaand Taare from Yes Boss, and Zara Sa Jhoom Loon Mein from Dilwale Dulhaniya Le Jaayege."}},{"headline":"Shreyas Iyer blasts 10 sixes in whirlwind century, sends reminder to selectors","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/PTI12-13-2024-000200B-0_1734770831516_1734770938424.jpg","summary":"Shreyas Iyer struck an unbeaten 114* off just 55 deliveries as he hit 10 sixes against Karnataka in Mumbai's Vijay Hazare Trophy curtain-raiser.","link":"/cricket/shreyas-iyer-smashes-10-sixes-in-breathtaking-century-sends-reminder-to-selectors-ahead-of-champions-trophy-101734770419971.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/PTI12-13-2024-000200B-0_1734770831516_1734770938424.jpg","text":"Subscribe Now! Get features likeShreyas Iyer lit up the Vijay Hazare Trophy 2024-25 opener for Mumbai, smashing 114* runs off just 55 deliveries batting at number 5 as he helped the team to 382/4 against Karnataka in a signal of intent. Iyer, who captained Mumbai to the Syed Mushtaq Ali Trophy triumph last week and now leads their List A team as well, struck 10 maximums in his rapid-fire knock as he continued to demonstrate his firepower and talent in the middle order in 50-over cricket.In a knock reminiscent of his terrific century against New Zealand in the 2023 World Cup semifinal, Iyer entered the pitch after having been provided a strong foundation by a 141-run partnership between Ayush Mhatre (78) and Hardik Tamore (84). With license to attack the bowling, Iyer left no mercy for the Karnataka bowlers as he hammered his 13th List A century at a strike rate of 207.27.The Mumbai captain was given terrific death overs support from Shivam Dube, who also remained not out with 63* off 36 deliveries in an onslaught by the Mumbai batters at the Narendra Modi Stadium B Ground in Ahmedabad. The duo joined forces at 238-4 in the 40th over, and scored 144 runs in just 65 deliveries to finish Mumbai’s innings.A terrific year on the domestic front continues for Iyer, as both captain and batter. Iyer scored 345 runs in the Syed Mushtaq Ali Trophy at a phenomenal strike rate of 188.5 as he led Mumbai to a win, having already scored 452 runs in the first five matches of the Ranji Trophy season with an average of 90.4 as Mumbai look to defend their title in the prestigious First Class tournament.Iyer also memorably led Kolkata Knight Riders to a third IPL win, and his first as captain, as KKR waltzed through the tournament as the most dominant team. Iyer then earned a 26.75 crore rupees paycheck in the IPL auction, snapped up by Punjab Kings as the franchise looks to earn its first IPL title.Iyer’s knock and performances will likely mean that he retains his spot in the middle order of the Indian ODI team. Rishabh Pant's comeback has placed question marks over whether Iyer will remain the incumbent heading into the ICC Champions Trophy in 2025.However, having hammered 530 runs in the World Cup at a strike-rate of 113.24 and an average of 66.25, Iyer has sent a message to the selectors that he doesn’t intend to relinquish a role in the Indian middle order that he has dominated in recent times.Mumbai will look to get off to a winning start in the Vijay Hazare Trophy, as the star-studded and high-potential squad looks to triple up on major Indian domestic honours and keep their place at the top of the pecking order in domestic cricket. "}},{"headline":"‘15-hour shift, verbal abuse’: Indian techie accuses founder of making him cry","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/Viral_Indian_Techie_Founder_Viral_Reddit_Abuse_1734743128044_1734743128381.jpg","summary":"An Indian techie found support on Reddit when he claimed his boss made him cry during a video call. He accused his company's co-founder of being toxic.","link":"/trending/15-hours-shift-verbal-abuse-indian-techie-accuses-startup-founder-of-making-him-cry-101734743069492.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/Viral_Indian_Techie_Founder_Viral_Reddit_Abuse_1734743128044_1734743128381.jpg","text":"Subscribe Now! Get features likeAn Indian techie shared a post on Reddit accusing a company co-founder of verbally abusing him and other employees. In an emotional post, he described the individual as toxic and recounted a recent interaction where the founder’s behaviour reduced him to tears during a video call.“I cried on Google Meet in front of the tech lead. I do not know how to face it now (sic),” the techie wrote, explaining that he works at a startup, and one of the three founders of the establishment also acts as the tech lead. In the rest of the post, he accuses the person of deliberately misbehaving with the employees on different occasions.The employee also alleged that the tech lead forces them to work up to 15-hour shifts without clear instructions. He recounted that during the incident that left him in tears, he conveyed that the instructions for a specific project were inadequate. Instead of receiving guidance, he faced verbal abuse from the founder.“I could not hold my tears and started crying, and I was not in the mental zone to work, so I told him I am taking leave after a few hours of Google Meet,” the techie added.Social media extended its support for the techie. Suggestions poured in on the post's comments section, from ways to handle stress at work to learning to be assertive to searching for new job opportunities.“Hey bud, listen, you are all good. In life, you judge yourself by your own standards and don't let anybody else make you feel bad about your emotions. You are allowed to feel whatever you feel like, and you are allowed to express it (until it doesn't hurt others). Cry your heart out, kid, and then move on. Crying is healthy, and if someone doesn't understand that, who gives a damn. You are brave. You'll thrive no matter what! Best of luck!” wrote an individual.Another added, “Try to get out of that place. You are just a resource for them. They will exploit you as much as you let them.” A third commented, “I feel bad for you, sorry, op. Remember, breaking down is okay, especially when you have toxic colleagues. It's even more difficult.” A fourth joined, “Believe in your skills, start interviewing, and dump them once you get a better job. Do it for your mental health.”In a follow-up comment, the original poster thanked everyone for their thoughtful messages. He further informed that he had another video call with his boss after the incident, during which he spoke in an assertive tone and tried to set boundaries. He also shared that he plans to apply for new jobs while continuing in his current company."}},{"headline":"Rohman Shawl spills his workout secrets; reveals 'instant' trick for burning fat","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/Rohman_Shawl_Sushmita_Sen_boyfriend_1734771202722_1734771202937.jpg","summary":"The secret to a ripped physique like Rohman Shawl's is training consistently and introducing workouts of varying intensity.","link":"/lifestyle/health/rohman-shawl-spills-diet-workout-secrets-washboard-abs-reveals-instant-trick-to-burning-fat-101734771112954.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/Rohman_Shawl_Sushmita_Sen_boyfriend_1734771202722_1734771202937.jpg","text":"Subscribe Now! Get features likeRohman Shawl is nothing if not dedicated to staying fit and healthy. The model-turned-actor, who was recently seen in the Tamil film Amaran alongside Sivakarthikeyan and Sai Pallavi, believes in eating clean, training hard, and training smart. His workout routine is proof that hard work and effort pay off – have you seen those perfect abs and big set of biceps? Also read | Srishti Dixit reveals her diet and fitness secrets, what triggered her weight loss journey: 'I eat everything but...'When it comes to health and wellness, we should all take a page out of Rohman's book – his approach isn't about losing weight or building a ripped physique; it's about feeling healthier. Don't miss his tips and tricks for motivating yourself the next time you feel like swapping gym time for couch time.In an exclusive interview with HT Lifestyle, Rohman shares his fitness mantra, workout routine and diet secrets. Excerpts:I am usually an evening person, as it helps me get better sleep at night. But I have a ritual of waking up in the morning, stretching my body, and doing 60 push-ups (3 sets of 20 reps each) on a daily basis. It helps me start my day on a high note, and I feel a sense of accomplishment.I haven’t been to a gym in a long time. For my film Amaran, I had to follow a particular body type of being lean and not so shredded, so I changed my exercise routine!! I am into callisthenics and yoga now, which can be done anywhere. Also, if there is no space, I go for a run!! Another important thing that I have included in my routine is to play football with friends once a week. It has helped me be healthy both physically and mentally. I will return to the gym if my next project demands it, but otherwise, I am quite happy following the current routine.A post shared by rohman shawl (@rohmanshawl)For me, exercise is a way of being healthy rather than looking fit. You can have all the Money, name, and fame in the world, but if you aren’t healthy, you won't be able to enjoy all of that. There can’t be a better motivation than that!For me, that would be a run of 7-8 km, which includes 3 sets of 200-meter sprints at different intervals (I have always been a sprinter; I can still cover 100 mts in around 11 seconds). It gives me instant results.I used to, not anymore. With age and experience, you realise that your body needs rest, so you go easy on it !! The more recovery time, the better the results. Having said that, that’s what works for me, as I have a certain body type. This might not work for everyone.Realising the mere fact that to reap the most of this precious life that you have been given, the least you can do is to feed your body, mind and soul in the best possible way! Once you love yourself, it’s not hard to manage it.I am not someone who counts calories, but I do follow a 2-meal-a-day plan. I only have brunch and then dinner. Since I have started doing it, I feel my body has become more active, and I feel fitter than ever. Also, I try to avoid sugar as much as possible, but I do have a sweet tooth, so sometimes I do indulge.A post shared by rohman shawl (@rohmanshawl)First of all, it’s very important to be aware of what your body is trying to tell you, because it does speak to you by giving signs. What might work for me may not work for you, so don’t just follow someone blindly. Get regular tests done and know your body type before you go on a diet. Trust me, it’s not so hard; you just need to believe in yourself!I have a very basic diet, I wake up and drink at least 2 glasses of water, and then I wait for 40 minutes before I make my own breakfast (it’s a ritual, I have to make my own breakfast), which includes 4 pieces of avocado toast, 2 sunny-side-up eggs and some coffee that keeps me going throughout the day. Then, for dinner, I usually have rice and dal with some curd and tandoori chicken. That’s the last thing that I eat unless I am in the mood to indulge, then I do have some dessert. Just a reminder: Since I am only maintaining my current body shape, I am following this. To make any changes, I will have to change my diet for sure.I wake up, stretch and do 60 push-ups (20x3 reps). Then, the evening would be callisthenics and yoga (usually 3-4 times a week). Every Wednesday evening is booked for football for 90 minutes, which I feel has helped me immensely, both physically and mentally. I would like to request you all to please find a sport of your choice and play it at least once a week, no matter what. It will help your fitness journey on another level. Then, once a week, usually on Sundays, I go for my run, which is usually 7-8 km and involves pace walking and sprints.Disclaimer: This article is for informational purposes only and not a substitute for professional medical advice. Always seek the advice of your doctor with any questions about a medical condition."}},{"headline":"Bumrah got pulled up for 'biggest sledge' to legendary batter, handed warningJasprit Bumrah was pulled up for sledging AB de Villiers during an IPL game. The Proteas batter was not pleased with the reaction of the Indian pacer.","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/ANI-20241215043-0_1734345423264_1734758765965.jpg","summary":"","link":"/cricket/jasprit-bumrah-got-pulled-up-for-biggest-sledge-to-legendary-batter-handed-stern-warning-he-stared-him-down-and-101734758484013.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/ANI-20241215043-0_1734345423264_1734758765965.jpg","text":"Subscribe Now! Get features likeThe legend of Jasprit Bumrah keeps on growing. The Indian pacer is currently the leading wicket-taker in the ongoing Border-Gavaskar Trophy. The No.1 ranked bowler in the ICC Test Rankings has taken 21 wickets in three matches, leading the attack for the visitors. Bumrah even led India in the first Test to an emphatic 295-run win in the absence of Rohit Sharma.Bumrah has managed to capture the imagination of Australian media and cricket pundits. Former Australia batter Michael Hussey recalled interacting with Jasprit Bumrah during his stint with Mumbai Indians. He spoke about having a word with the Indian pacer during the match between Mumbai Indians and Royal Challengers Bengaluru (RCB).In this particular IPL 2014 game, Bumrah dismissed AB de Villiers, and after the wicket, the pacer gave a fiery send-off to the batter, gesturing towards the pavilion.“He burst onto the scene in the IPL. I remember having one stern word with him, though. In one of his early games, he got AB de Villiers out, obviously a great of the game and gave him a big send-off, and AB wasn’t too happy about it. He sort of stared him down, and I remember just pulling Bumrah aside and saying, ‘mate, you don’t need to do that,\" Hussey told Willow Talk Podcast.\"You have got that much skill that much talent, getting the wicket is enough. That’s the biggest sledge you can give, you don’t need to give send-offs if you want to have respect in the game and get respected by your peers then maybe just don’t give send-offs’,\" he added.Jasprit Bumrah has taken the most wickets Down Under for Indian bowlers. He recently went past Kapil Dev's tally of 51 wickets.“He is such a humble and down to earth guy, it was bit off out of character for Bumrah. He is such a great guy. I love watching him bowl. He always got that smile on his face, he is always calms, consistent with his character. He doesn’t get too emotional and obviously a great talent,\" said Hussey.Jasprit Bumrah, who has 194 wickets from 43 Tests, made his debut in the longest format against South Africa in 2018. He then contributed to India's Border-Gavaskar Trophy win Down Under during the 2018-19 tour. Bumrah bowled a magical slower delivery to Shaun Marsh during the Melbourne Test, and no one can forget his spell during the Boxing Day Test during that tour.However, when the Indian speedster started out, few gave him a chance to succeed at the Test level because of his unorthodox bowling action.\"Not really surprised. He is unbelievable. I actually played a year with him in the IPL. I had one year at the Mumbai Indians. He was just a young kid coming through and I remember facing him in the nets and literally couldn’t get bat on ball. I felt like I was using a toothpick. I remember thinking oh I can’t even see the ball, can’t even pick the ball coming out of his hand. His action is so unique,\" said Hussey.\"First impression I didn’t thought he will even get to the crease. He was staggering with his run up and I was like what’s going on here, who the heck is this guy and then suddenly woof the ball whistles past my eyebrows at 145kph,\" he added.Speaking about the chatter about Bumrah when he first played the IPL, Hussey said, “In India, initially all the talks were like how he will only succeed in the white ball cricket with that bowling action and that run up. It is too much pressure on the body. He can’t play Test cricket.” “But I always thought nah he has got the skills and ability and if he has the desire to play Test cricket he could and isn’t he doing it bloody well at the moment,” he added. "}},{"headline":"Ashwin's wife's heartfelt tribute after his retirement: ‘Time to set burden…’","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/Untitled_design_1734744171163_1734744181687.jpg","summary":"Ravichandran Ashwin's wife Prithi Narayanan penned a heartfelt tribute for the cricketer, who announced his retirement, earlier this week.","link":"/cricket/ravichandran-ashwins-wife-pens-heartfelt-tribute-after-his-retirement-time-to-set-the-burden-of-you-being-down-101734742487191.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/Untitled_design_1734744171163_1734744181687.jpg","text":"Subscribe Now! Get features likeIndia spinner Ravichandran Ashwin announced his retirement from international cricket following the end of the third Test against Australia at Gabba, Brisbane. Minutes after the contest ended in a draw, Ashwin went down to the press conference room to bid adieu to international cricket. Tributes have been pouring in for the off-spinner, who hung his boots after taking 765 wickets for India across all formats of the game.Ashwin's wife, Prithi Narayanan, has now penned an emotional tribute to her husband. She recalled his cricketing journey over the years and how she felt when the 38-year-old announced his retirement.\"It has been a blurry two days for me. I have been thinking about what I can say. Do I put this down as a tribute to my all time favorite cricketer ? Maybe I’ll just take the partner angle? Or maybe a love letter from a fan girl? I guess this is a little bit of all of it,\" she wrote on Instagram.\"When I saw Ashwin's PC, I thought of small and big moments. Many, many memories over the last 13-14 years. The big wins , the MOS awards, the quiet silence in our room after an intense game, the sound of the shower running for much longer than usual on some evenings post-play, the scratch of pencil over paper as he scribbled thoughts down, the constant streaming of footage videos when he is making a game plan, the calm of meditative breathing before leaving for each game, certain songs playing on repeat while he unwinds, she added. A post shared by 𝒫𝓇𝒾𝓉𝒽𝒾 𝒜𝓈𝒽𝓌𝒾𝓃 (@prithinarayanan)Ashwin brought the curtain down on his international career as the second-highest wicket-taker for India in international cricket. He is only second to Anil Kumble in the wicket-taking charts.The premier off-spinner was also part of India's 2011 World Cup-winning and 2013 Champions Trophy-winning teams.\"The times we wept in joy - after the CT final, after the MCG win, after the Sydney draw, The Gabba win, after making a comeback in T20s…the times we sat in silence and the times when we had our hearts broken,\" wrote Prithi Narayanan.Ashwin's wife also stated that it was an \"absolute pleasure\" to watch the cricketer go about his job and become such a big match-winner for India. Ashwin has the most number of Player of the Series awards when it comes to men's Test cricket (11).\"Dear Ashwin, from not knowing how to put a kit bag together to following you to stadiums all over the world, rooting for you, watching you and learning from you, it has been an absolute pleasure. The world you introduced me to gave me the privilege to watch and enjoy a sport that I love from close quarters. It also showed me how much passion, hardwork and discipline is needed to keep your head above water. And sometimes even that is not enough,\" she said.\"I remember us talking about why you, R Ashwin, had to do all of this and a lot more to even stay relevant in the scheme of things. How awards, the best of stats, the POMs, the accolades, the records didn’t matter if you didn’t sharpen your skill sets constantly and did not put in the work. Sometimes, nothing is enough. As you end your wonderful international run, I only want to tell you that it’s all good. It is all going to be good,\" she added.Ashwin might have retired from international cricket but will continue playing club cricket. While announcing his retirement, he clearly stated that he had \"enough punch\" left in him, but his time as an international cricketer for India was up.\"It is time to set the burden of being you down. Live life on your terms, make space for those extra calories, make time for your family, make time to do absolutely nothing, share memes all day, create a new bowling variation, bug our kids out of their minds. Just do it all,\" Ashwin's wife said."}},{"headline":"Jadeja informed '5 mins' before Ravichandran Ashwin's retirement: ‘We spent…’","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/PTI09-22-2024-000124B-0_1727010122201_1734750777906.jpg","summary":"Ravindra Jadeja revealed that he got to know about Ravichandran Ashwin's retirement just five minutes prior to the press conference.","link":"/cricket/we-spent-the-whole-day-together-and-ashwin-didnt-even-give-me-a-hint-jadeja-informed-5-mins-before-retirement-101734750783494.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/PTI09-22-2024-000124B-0_1727010122201_1734750777906.jpg","text":"Subscribe Now! Get features likeAll-rounder Ravindra Jadeja was \"shocked\" like everyone else when Ravichandran Ashwin announced his international retirement following the conclusion of the third Test between India and Australia at the Gabba. Jadeja revealed that he got to know about the off-spinner's retirement just five minutes before the press conference, where Ashwin bid adieu to international cricket.Jadeja and Ashwin formed one of the most formidable bowling partnerships in Tests. The duo played 58 Tests together, scalping 587 wickets between them.The two spinners are also India's most successful bowling pair, going past the pair of Anil Kumble and Harbhajan Singh (501 wickets).\"I got to know about the retirement at the last moment, five minutes before the press conference. It was shocking. We spent the whole day together, and he didn’t even give me a hint. I got to know at the last minute. We all know how Ashwin’s mind works,\" Jadeja told reporters at the Melbourne Cricket Ground (MCG) on Saturday.Jadeja, who shared an exceptional camaraderie and bonding with Ashwin, labelled the latter his \"on-field mentor\". However, the left-arm spinner feelsyoungsters should now look to take the opportunity after the retirement of Ashwin, who scalped 537 Test wickets.Ashwin and Jadeja often bailed India out with the bat as well, with the most recent rescue job coming in the Chennai Test against Bangladesh earlier this year. \"He is like my on-field mentor. We have been playing together for so many years. We kept passing messages to each other on the field regarding the match situation, what the batters are trying to do,\" said Jadeja.\"I will miss all this. We just hope that we get a better all-rounder and bowler than Ashwin. It's not like nobody can replace a player. Everyone goes, but you do get the replacement. We have to move on. In India, we always have good talents; it is not like anyone is irreplaceable. We will have to move on. It is a golden opportunity for any youngster to grab this opportunity,\" he added.In the third Test against Australia, Jadeja's 77 in the first innings helped India walk away with a draw. The all-rounder said this innings boosted his confidence.“Scoring outside when the team is in a tough position, it gives you confidence,” he said.“Mindset will be the same. You will have to play according to the match situation and I will play according to the team’s role,\" he added.The Border-Gavaskar Trophy currently stands on level terms. India and Australia will now square off in the Boxing Day Test at MCG, beginning 26 December 2024."}},{"headline":"Shaw demoted after 'fitness, discipline' issues; asked to play in Police Shield","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/India-IPL-Cricket-8_1715860057115_1734752656617.jpg","summary":"Prithvi Shaw, who was recently snubbed from Mumbai's Vijay Hazare Trophy squad, has been asked to play the Police Shield Invitational Tournament.","link":"/cricket/prithvi-shaw-faces-demotion-after-fitness-discipline-issues-asked-to-play-in-police-shield-101734752580778.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/India-IPL-Cricket-8_1715860057115_1734752656617.jpg","text":"Subscribe Now! Get features likePrithvi Shaw is facing one setback after another. Recently, the right-handed batter was snubbed from Mumbai's squad for the first three matches of the Vijay Hazare Trophy. Subsequently, the 25-year-old took to Instagram Stories to express his displeasure. However, this move did not go down well, and since then, several issues have surfaced. Shaw's fitness and discipline have been put under the scanner.Now, Shaw has been asked to play in the Police Shield Invitational Tournament. He will lead the Mumbai Colts team. For the uninitiated, the competition involves two-day matches at various venues around Mumbai.Earlier, an MCA official, speaking to news agency PTI, raised fitness and discipline issues. Recently, the youngster who made his debut for India in 2018 also underperformed with the bat in the recently concluded Syed Mushtaq Ali Trophy, which was won by Mumbai under the leadership of Shreyas Iyer.Shaw did not even reach the 200-run mark in the entire tournament, and his only substantial knock came during the quarter-final against Vidarbha.\"In the Syed Mushtaq Ali Trophy, we were playing with 10 fielders as we were forced to hide Prithvi Shaw. The ball would pass near him, and he would barely be able to get to it,\" a MCA official told PTI.\"Even while batting, we could see he was troubled reaching to the ball. His fitness, discipline and attitude are poor and it is pretty simple, there cannot be different rules for different players,\" the official added.Recently, Shaw also went unsold in the Indian Premier League (IPL) mega auction in Jeddah, Saudi Arabia.Earlier, Shaw was even snubbed from Mumbai's Ranji Trophy squad for the first phase. It was then that he was seen working on his fitness, leading to his selection in the Syed Mushtaq Ali Trophy squad. Mumbai captain Shreyas Iyer had also said that Shaw needs to get his work ethics right and if he can do so, then sky will be the limit for him.\"He needs to get his work ethics right, if he does, the sky's the limit for him. We cannot babysit anyone. At the end of the day, it's his responsibility to figure out things for himself,\" Shreyas Iyer said after Mumbai's Syed Mushtaq Ali Trophy win.MCA Colts squad: Prithvi Shaw (c), Vishal Dabholkar, Aryan Pawar, Siddid Tiwari, Aarush Patankar, Siddharth Akre, Arjun Jaiswal, Aryan Chauhan, Vedprakash Jaiswal, Ankit Vishwakarma, Atharva Kardile, Akshat Redkar, Yash Jadhav, Manthan Korgaonkar, Pratham Salaskar, Ratnesh Chaudhary, Harsh Mendon, Anjdeep Lad."}},{"headline":"‘Can make wrong movement’: AUS legend drops verdict on Pant’s wicketkeeping","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/CRICKET-AUS-IND-54_1734751754526_1734751989982.jpg","summary":"In the ongoing Border-Gavaskar Trophy against Australia, Rishabh Pant has registered 19 catches in three matches.","link":"/cricket/can-make-wrong-movement-aus-legend-healy-drops-verdict-on-rishabh-pant-s-wicketkeeping-uses-work-in-progress-label-101734751663831.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/CRICKET-AUS-IND-54_1734751754526_1734751989982.jpg","text":"Subscribe Now! Get features likeRishabh Pant’s career came to a standstill on December 30, 2022. The wicketkeeper-batter sustained multiple injuries as his car rammed into a crash barrier, flipped over and caught fire. He was lucky to escape with his life, and was rushed to a hospital, before being airlifted to Mumbai for surgery and treatment. His comeback came in IPL 2024, and then he returned to international action in the T20 World Cup, which India won.Pant is currently in action for India in the ongoing Border-Gavaskar Trophy. On his return, he immediately re-established himself as India’s first-choice wicketkeeper, and has been performing that role with ease in Australia.Australian legendary wicketkeeper Ian Healy is of the opinion that Pant is still a ‘work in progress’. Analysing his wicketkeeping style, Healy told the Indian Express, “Rishabh Pant is a work in progress, but I saw him in the mornings and like the drills he is doing; he is bound to improve more. At times, as he did when he dropped a catch in this series earlier, he can make an initial wrong movement. Some keepers like to move a touch to their left first and then press from there. It’s better to be still and if you can’t, then you start that trigger movement a touch early so that by the time the ball is out there, you can still press to the right side. One of those two decisions have to be made.”Pant’s batting performances in the ongoing series has been below-par, and he has managed only 96 runs in three matches (five innings). The series is level at 1-1, with the third fixture ended in a draw, courtesy of rain. Meanwhile, Pant has contributed with the gloves, but also dropped some chances. On Day 1 of the second Test, he dropped Nathan McSweeney in what initially looked like an easy chance. In the three matches, he has registered 19 catches.The fourth Test will take place in Melbourne, and is scheduled to begin on December 26."}},{"headline":"Payal Kapadia receives Spirit of Cinema award at Kerala Film FestivalIndian filmmaker Payal Kapadia received the Spirit of Cinema award at the 29th International Film Festival of Kerala (IFFK) on Friday.","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/PTI12-20-2024-000454A-0_1734778325358_1734778453755.jpg","summary":"","link":"/entertainment/others/payal-kapadia-director-of-all-we-imagine-as-light-receives-spirit-of-cinema-award-at-kerala-film-festival-101734778263810.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/PTI12-20-2024-000454A-0_1734778325358_1734778453755.jpg","text":"Subscribe Now! Get features likeIndian filmmaker Payal Kapadia received the Spirit of Cinema award at the 29th International Film Festival of Kerala (IFFK) on Friday. The award was in recognition of her historic Grand Prix win at the Cannes Film Festival for her film 'All We Imagine as Light'. The achievement made her the first Indian filmmaker in 30 years to feature in Cannes' main competition section. (Also read: Payal Kapadia Interview: ‘All We Imagine As Light shows diversity's importance, One Nation One Election won't allow it’)In addition to its Grand Prix win, the film has also been nominated for two Golden Globes and the Critics' Choice Awards 2025.Kerala Chief Minister Pinarayi Vijayan presented the award to Kapadia.While speaking at the event, Vijayan praised the festival for its inclusivity and focus on feminist politics.\"The 29th International Film Festival of Kerala (IFFK) offered a remarkable visual experience. The festival strongly upheld feminist politics, with over 40 films showcased being directed by women. PK Rosy was honoured through the signature film of the festival. This event became a platform for unity and togetherness. The festival stood in solidarity with the rights of the oppressed and those enduring suffering. Every film was screened to a packed audience, reflecting the overwhelming support and enthusiasm for the event.\"The festival, which began on December 13 with a grand ceremony at Nishagandhi Auditorium in Thiruvananthapuram, will conclude on December 20.Meanwhile, talking about the film, 'All We Imagine As Light' follows the story of Prabha, a troubled nurse who receives an unexpected gift from her estranged husband, and Anu, her young roommate seeking intimacy with her boyfriend. Their journey to a beach town allows them to confront their desires and emotions.The film stars Kani Kusruti, Divya Prabha, and Chhaya Kadam in lead roles. The film is an official Indo-French co-production between Petit Chaos (France) and Chalk & Cheese and Another Birth (India). (With inputs from ANI)"}},{"headline":"Shah Rukh was called ‘hakla’ behind his back, says singer Abhijeet Bhattacharya","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/abhijeet_shah_rukh_1734776482874_1734776483267.jpg","summary":"Singer Abhijeet Bhattacharya said there were many stars who would mock him for singing for Shah Rukh Khan's films.","link":"/entertainment/bollywood/shah-rukh-khan-was-called-hakla-behind-his-back-by-many-stars-claims-singer-abhijeet-bhattacharya-101734775718319.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/abhijeet_shah_rukh_1734776482874_1734776483267.jpg","text":"Subscribe Now! Get features likeSinger Abhijeet Bhattacharya was recently in the limelight after he reacted to a fan-made mashup of Dua Lipa's song Levitating and actor Shah Rukh Khan's famous track Woh Ladki Jo from his film Baadshah. He said that the song belonged to the singer first, so he must be named, not the actor. Now, in a podcast conversation on Subhankar Mishra's YouTube channel, the singer opened up about his decades-long working relationship with Shah Rukh, and whether they have patched up after all. (Also read: Abhijeet Bhattacharya salty about ‘Dua Lipa x SRK’ track going viral? Amplifies posts about not getting credit)During the conversation, Abhijeet shared how he was disappointed with a slew of songs in the 90s and even declined to sing a number of tracks because he did not like the composition. “I had become choosy, and I became a little too mindful on this and decided that I will not sing for anyone else but Shah Rukh. That became a problem, because many of his contemporaries called him ‘hakla’ (stammerer). So what happened was, there was an award ceremony in Dubai where I had won an award for Tumhe Jo Maine Dekha.”He added, “When I was getting down from the stage, there was one star who came forward and said, 'Aye! hakle ke liye gaa raha hai na tu (You are singing for that stammerer)?’ Two people said this together. I was shocked! I was like why are they feeling jealous, I got the award for my singing. After that experience, I kept losing interest in the playback singing and started focusing on my shows and concerts. Even today, I am very happy doing that.”Abhijeet has delivered several hit songs for Shah Rukh films, some of which are Tumne Jo Maine Dekha from Main Hoon Na, Tauba Tumhare Ishare from Chalte Chalte, Chaand Taare from Yes Boss, and Zara Sa Jhoom Loon Mein from Dilwale Dulhaniya Le Jaayege."}},{"headline":"This actor earned $95M for 20-minute role but hated his work in 'rubbish' film","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/Alec_Guinness_1734777189100_1734777194195.jpg","summary":"This Hollywood star, an Oscar winner, was not fond of his most famous role, one that earned him $95 million for a few days' work.","link":"/entertainment/hollywood/this-actor-earned-95-million-for-20-minute-role-alec-guinness-but-hated-his-dull-work-in-rubbish-film-star-wars-101734777051525.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/Alec_Guinness_1734777189100_1734777194195.jpg","text":"Subscribe Now! Get features likeImagine a $95-million paycheck for what amounts to just a few days of work in a film, translating to only 20 minutes of screen time. Most actors would give an arm and a leg for such a gig. But almost 50 years ago, when one man got this, he was so turned off by the film that he almost rejected the sequel and came back only for the director's sake. This is the story of a thespian who became a reluctant pop culture icon.By the mid-1970s, British actor Alec Guinness was a respected name in Hollywood and the UK. He had made a name for himself with acclaimed films like Kind Hearts and Coronets, The Man in the White Suit, The Lavender Hill Mob, and Great Expectations. He won the Oscar for Best Actor for Bridge on the River Kwai and later appeared in Lawrence of Arabia and Doctor Zhivago. Years after this, George Lucas contacted him to play a Merlin-like mentor character in a space opera he was making. He was offered $150,000 for the role but the actor demanded twice that, along with 2% of the backend grosses. Director George Lucas threw in another .25% as a goodwill gesture.The film was Star Wars, and the role was Obi-Wan Kenobi. Even though the character appeared for only 20 minutes in the film, it became a pop culture phenomenon, eventually becoming the role the Oscar winner would be known for. The profit-sharing agreement turned out to be a game changer for Guinness, as the franchise earned several billion over the next five decades, earning Guinness a staggering $95 million by his death in 2000.According to The Hollywood Reporter, Alec Guinness was not sold on Star Wars when he first read the script and only agreed to do the film because of the money. Privately, he had dismissed the script to friends as “fairy tale rubbish”, and was convinced he did not want to return to the character again. Later, he wrote in his diary that working on the film was 'dull rubbishy stuff'.However, once the film succeeded, the actor felt that he owed it to George Lucas to return and let him complete his character's arc. “I said yes to a day’s work on Star Wars II … It’s dull rubbishy stuff but, seeing what I owe to George Lucas, I finally hadn’t had the heart to refuse,” Guinness wrote a week after agreeing to act in The Empire Strikes Back in 1979. His character, Obi-Wan, was killed in the film. It was later revived in the prequel trilogy and played by Ewan McGregor. Obi-wan eventually starred in his own web series, titled Kenobi, which premiered on Disney+ this year with Ewan McGregor returning to the role. Funnily enough, Alec Guinness earned more for his 20-minute appearance over two movies than McGregor did over three films and a series."}},{"headline":"Man rides scooter while sitting backwards, sparks backlash. WatchA man went viral for riding a scooter backward, sparking outrage online as users slammed the dangerous stunt, calling it a threat to public safety.","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/Screenshot_2024-12-21_155044_1734776468591_1734776483487.png","summary":"","link":"/trending/this-isnt-bravery-its-stupidity-man-rides-scooter-while-sitting-backwards-sparks-backlash-101734775504883.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/Screenshot_2024-12-21_155044_1734776468591_1734776483487.png","text":"Subscribe Now! Get features likeRoad safety remains a critical issue as many individuals continue to engage in reckless behaviour on public roads. Despite numerous awareness campaigns, instances of dangerous stunts and disregard for traffic norms frequently emerge, endangering not only the individuals involved but also innocent bystanders.(Also read: Woman screams in distress after bike stunt goes wrong, narrowly avoids major injuries)In a shocking incident, a video has surfaced on social media showcasing a man performing an unconventional and highly dangerous stunt while riding a scooter. The individual is seen sitting on the scooter but facing backward instead of forward, navigating the road in a manner that defies safety norms.The clip, shared on X (formerly Twitter) by user Divya Kumari, has quickly gone viral, amassing over 727k views and triggering widespread online backlash. Social media users expressed their shock and disapproval of the man's actions, highlighting the potential dangers his stunt posed not only to himself but to other commuters.Netizens criticised the act, calling it reckless and irresponsible. One user commented, \"This is sheer stupidity. It's not just his life at risk; he could cause an accident involving innocent people.\" Another added, “What if someone panics or crashes because of this nonsense? Roads are not a playground!”(Also read: Man does push-ups on moving bike in viral videos, Bihar police responds)The video attracted a flurry of reactions. A third user remarked, \"Such stunts need to be punished severely. People should understand the consequences of their actions.\" Another chimed in, stating, \"Irresponsible behaviour like this should result in a permanent ban on driving.\"Some users even questioned the enforcement of road safety laws. \"Where are the authorities? How do people like this even get away with such acts?\" wrote one concerned individual. A few comments called for stricter measures, with one stating, \"Public safety should be the priority. Recklessness like this should be curbed at all costs.\""}},{"headline":"'1 cup coffee for 25,000 pounds': Influencer reveals Syria's inflation crisis","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/vdsc_xcssss_1734772382555_1734772387875.jpg","summary":"Travel influencer's viral video revealed Syria's hyperinflation, highlighting skyrocketing costs and a collapsing financial system.","link":"/trending/1-cup-coffee-for-25-000-pounds-influencers-video-reveals-syrias-shocking-inflation-crisis-101734771791165.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/vdsc_xcssss_1734772382555_1734772387875.jpg","text":"Subscribe Now! Get features likeSyria, once a thriving hub of culture and history, is now battling an economic crisis of unprecedented scale. Years of conflict, sanctions, and global isolation have pushed the nation into hyperinflation, making daily survival a daunting task for its citizens. Recently, travel influencer Elona Karafin, known for exploring offbeat destinations, shed light on this dire situation in a viral Instagram video that has garnered nearly 10 million views.(Also read: Vintage Chevrolet newspaper ad featuring ₹3,600 car goes viral, sparks nostalgia)Elona’s video paints a grim picture of Syria’s collapsing financial system. With over 300,000 followers, she documented her visit to the country, revealing a startling reality: restaurant menus lacked price lists, leaving diners to pay with bundles of cash. “Many restaurants don’t print prices because they can’t keep up with the constant currency fluctuations,” she wrote in her caption, adding that “money counting machines are a better investment” than traditional pricing systems.The root of this economic chaos lies in the dramatic fall of the Syrian pound. Once stable at 50 Syrian pounds to 1 US dollar, the exchange rate has spiralled to an astonishing 15,000 Syrian pounds per dollar. Basic commodities have become unaffordable, with Elona citing a single cup of coffee priced at a staggering 25,000 Syrian pounds.A post shared by Elona Karafin | Travel Content Creator (@elona)This hyperinflation is the culmination of years of war, crippling international sanctions, and exclusion from global banking systems. Syrians now face the harsh reality of diminishing purchasing power, with wages unable to keep pace with soaring prices.Elona’s video sparked widespread reactions on social media, with viewers expressing shock and compassion. Comments flooded in, capturing the world’s disbelief and concern over Syria’s plight. One user remarked, “It’s heartbreaking to see a nation reduced to this.” Another wrote, “I can’t imagine living under such conditions.”(Also read: ‘Unke liye dua kiya karo…’: Pakistani man hails PM Modi amid Pakistan's inflation. Watch)A third commenter expressed frustration at the lack of international support, saying, “The world needs to do more to help Syria rebuild.” Some users highlighted the resilience of the Syrian people, noting, “Despite everything, they continue to fight for survival.” Another observed, “This is a grim reminder of how war affects ordinary lives.”"}},{"headline":"UK man runs midway through haircut to help policeman under attack. Watch","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/viral_1734770948858_1734770959212.jpg","summary":"A UK man mid-haircut heroically intervened to save a police officer from an attacker, earning widespread praise online.","link":"/trending/watch-uk-man-runs-midway-through-haircut-to-help-policeman-under-attack-internet-says-hero-with-cape-101734769806218.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/viral_1734770948858_1734770959212.jpg","text":"Subscribe Now! Get features likeIn a remarkable act of compassion, a man in the UK has become an overnight social media sensation after a video captured him abandoning his haircut to assist a police officer being assaulted on the street. The incident unfolded in Warrington, Cheshire, where 32-year-old Kyle Whiting, a resident, was getting his hair trimmed at Haron Barbers when he noticed a violent altercation outside.Without hesitation, Whiting sprang into action, still wearing his barber's cape, as he ran across the street to intervene. The video, which has since gone viral, shows him pulling the assailant off the officer and holding the man until others joined in to help.\"Before you know it, my barber had taken his phone out and had gone up to the window and started recording. I then saw the guy outside swing for the police officer and throw him down onto the ground,\" Whiting recounted to the BBC.With the cape dramatically swirling behind him, he quickly subdued the attacker, ensuring the officer’s safety. Soon after, another officer from a nearby parked police car and additional backup arrived, leading to the man’s arrest.Whiting, whose sister works as a police officer, shared that his presence at the barber shop was coincidental, as he had been accompanying his girlfriend to the A&E unit at Warrington Hospital. He reflected on the situation, saying, \"I thought, 'I'm not sitting back and watching this.' If that was my sister, I would hope somebody wouldn't hesitate to help her if she was on her own.\"The viral video has earned Whiting widespread praise on social media, with users celebrating his bravery and quick thinking. Many affectionately dubbed him the \"caped crusader\" and \"haircut hero.\"\"Not all heroes wear capes... but this one does! Can we take a moment to applaud this fella, mid-haircut - but dashing out to aid a copper with a violent criminal? Not enough people like you around!\" one user commented. Another added: \"Cape and all, what a legend.\" A third joked, \"Is it a bird? Is it a plane? No, it's haircut man!\"Cheshire Constabulary later issued a formal statement commending Mr. Whiting for his courageous actions. The statement revealed that the 50-year-old attacker was arrested and subsequently placed under the care of health professionals, thanks to Mr. Whiting’s intervention.This heartwarming story of bravery has struck a chord with people worldwide, reinforcing the idea that acts of courage and kindness can make a significant difference in critical moments.Also read: King Charles jokes ‘I’m still alive’ in reply to India-origin man's health question amid cancer treatment update. Watch "}},{"headline":"People risk it all to sip coffee on cliffside setups in China. Watch","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/Screenshot_2024-12-21_134344_1734768875647_1734768883456.png","summary":"Coffee lovers in China embraced a daring trend, sipping their brew on cliffside mattresses with stunning views, sparking awe and fear online.","link":"/trending/people-risk-it-all-to-sip-coffee-on-cliffside-setups-in-china-stunning-but-terrifying-101734767995405.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/Screenshot_2024-12-21_134344_1734768875647_1734768883456.png","text":"Subscribe Now! Get features likeEnjoying a cup of coffee has long been a cherished ritual, whether at a desk or by the beach. But in China, coffee lovers are taking their passion to dizzying heights—literally. A new trend, dubbed 'Cliff Coffee,' sees enthusiasts descending rocky cliffs to sip their favourite beverage while soaking in breathtaking views of the mountains below.(Also read: Chinese influencers pose as Middle Eastern royals to sell fake luxury goods, banned)Viral footage has captivated the internet, showcasing adventurous tourists scaling treacherous terrain in search of the perfect spot for this adrenaline-pumping coffee experience. These daring escapades highlight how far coffee enthusiasts are willing to go for their brew, setting a bold new benchmark for how coffee is enjoyed.In a recent video that has sparked fascination, people can be seen seated on mattresses precariously perched on mountainous cliffs. Local coffee shops in China have begun capitalising on the trend, offering specially designed setups for the ultimate 'Cliff Coffee' experience.A post shared by China Insider (@chinainsider)While the concept promises stunning vistas and a connection with nature, it isn’t for the faint of heart. With steep drops and narrow pathways, the idea of sipping coffee at such heights has left many online viewers both thrilled and terrified.(Also read: Chinese man spends ₹55 lakh on bride, discovers she was already married)Netizens have shared mixed reactions to this nerve-wracking yet mesmerising trend. One viewer commented, “It’s breathtaking, but I’d need more than coffee to calm my nerves up there!” Another joked, “Imagine spilling your coffee—it would take forever to reach the bottom!”Some were critical of the idea, with one user saying, “It’s beautiful, but is it worth the risk? Safety should come first.” Meanwhile, a coffee enthusiast chimed in, “I’d do it in a heartbeat—coffee and a view like that? Sign me up!”Others admired the innovation, with one remarking, “This is a genius way to combine adventure tourism with coffee culture.”"}},{"headline":"King Charles jokes ‘I’m still alive’ in reply to India-origin man's question","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/King_Charles_Indian_Viral_Video_Christmas_1734767175637_1734767175949.png","summary":"Harvinder Rattan, an Indian-origin man, asked King Charles about his health, to which he received a witty reply from the royal.","link":"/trending/king-charles-jokes-i-m-still-alive-in-reply-to-india-origin-mans-health-question-amid-cancer-treatment-update-watch-101734767115485.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/King_Charles_Indian_Viral_Video_Christmas_1734767175637_1734767175949.png","text":"Subscribe Now! Get features likeKing Charles and Queen Camilla attended a reception at the Waltham Forest Town Hall on December 20. The event celebrated community cohesion in east London. Visuals from the function have made their way onto social media, including one in which the sovereign joked when asked about his well-being. Earlier this year, Buckingham Palace announced that King Charles was diagnosed with cancer. Reportedly, his treatments will continue in the coming year 2025.Harvinder Rattan, a self-employed Indian-origin man, asked the king about his health during the reception. “Your Majesty, good morning, how are you?\" he asked. King Charles joked in reply. He said, \"I'm still alive,” with a smile.“During the visit Camilla donated toys to children living in asylum hotels and after listening to a performance by a children's choir, the King joked their ‘poor teachers’ should make the most of the Christmas break,” reported a YouTube post shared on the official channel The Royal Family Channel.In addition to the humorous exchange between the royal and the Indian-origin man, the video also captures the king and the queen consort's interactions with other people attending the event.According to People, the royal couple attended the event after hosting a pre-Christmas lunch on December 19. The meal, which was hosted at Buckingham Palace, was organised for the extended royal family.At the Waltham Forest Town Hall event, the royal couple met young people, emergency service personnel, community volunteers, and faith representatives. Rattan attended the event as a Sikh faith representative\"His treatment has been moving in a positive direction and as a managed condition the treatment cycle will continue into next year,\" a palace source told the outlet."}},{"headline":"Modi in Kuwait Live: PM meets Arabic translator of Ramayana, MahabharataPM Modi in Kuwait Live Updates: The Indian leader will visit an Indian labour camp and attend the opening ceremony of the Gulf Cup football tournament.","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/ANI-20241221065-0_1734776798677_1734776821939.jpg","summary":"","link":"/india-news/narendra-modi-in-kuwait-live-updates-pm-to-attend-gulf-cup-football-tournament-opening-interact-with-indian-diaspora-101734772057080.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/ANI-20241221065-0_1734776798677_1734776821939.jpg","text":"PM Modi in Kuwait Live Updates: Prime Minister Narendra Modi on Saturday embarked on a two-day visit to Kuwait at the invitation of Sheikh Meshal Al-Ahmad Al-Jaber Al-Sabah, the Amir of the State. Modi, the first Indian prime minister in 43 years to visit Kuwait, received a warm welcome from the Gulf nation's senior officials. Ahead of his visit, the prime minister said India and Kuwait have shared interests in peace, security, and stability in West Asia....Read More\"We deeply value the historical connection with Kuwait which has been nurtured over generations. We are not just strong trade and energy partners and have shared interest in peace, security, stability and prosperity in the West Asia region,\" he said. Modi's visit to Kuwait comes two weeks after the collapse of Bashar al-Assad's regime in Syria and amid signs of a possible ceasefire deal between Israel and Hamas in Gaza. The last Indian prime minister to visit Kuwait was Indira Gandhi in 1981. In a departure statement, Modi said his talks with the top Kuwaiti leadership would be an opportunity to chalk out a future partnership between India and Kuwait. PM Modi in Kuwait: Why this visit is significant PM in Kuwait Live Updates: On his arrival in Kuwait, PM Modi was warmly received by Sheikh Fahad Yousef Saud Al-Sabah First Deputy Prime Minister, Minister of Defence & Interior of Kuwait.\"A new chapter in the making! PM @narendramodi arrives in Kuwait to a ceremonial welcome. Warmly received by H.E Sheikh Fahad Yousef Saud Al-Sabah First Deputy PM, Minister of Defence & Interior of Kuwait, H.E. Abdullah Ali Al-Yahya, FM of Kuwait & several other Ministers & dignitaries at the airport,\" an MEA statement said on X. PM in Kuwait Live Updates: After arriving in Kuwait, PM Modi interacted with several members of the Indian diaspora in Kuwait. One diaspora member told ANI, All Indians in Kuwait are happy to welcome Prime Minister Narendra Modi here.\"PM in Kuwait Live Updates: PM Modi upon landed was met with a warm welcome from the Emir of Kuwait as well as admirers from the Indian diaspora and among Kuwaiti citizens.He posted on social media platform X saying, “Landed in Kuwait to a warm welcome. This is the first visit by an Indian PM in 43 years, and it will undoubtedly strengthen the India-Kuwait friendship across various sectors. I look forward to the programmes scheduled for later today and tomorrow.”PM in Kuwait Live Updates: Narendra Modi, after landing in Kuwait,  met Abdullateef Alnesef, the book publisher and Abdullah Baron, the translator of Ramayana and Mahabharata in the Arabic language.Abdullateef Alnesef, the book publisher told news agency ANI, “I am very happy, it is an honour for me. Mr Modi is very happy with this. These books are very important. He (Prime Minister Modi) signed both the books.”PM in Kuwait Live Updates: After a sweet exchange on social media platform X, where an ex-IFS officer's grand-daughter asked the PM to meet her ‘Nanaji’, PM Modi finally interacted with his 101-year-old admirer and his family after reaching Kuwait for a 2-day visit PM in Kuwait Live Updates: In honour of PM Modi's historic visit to Kuwait, an event titled ‘Hala Modi’ has been organised with the Indian diaspora at the Sheikh Saad Al Abdullah Sports Complex, to welcome the prime minister.PM in Kuwait Live Updates: The Congress on Saturday slammed prime minister Narendra Modi, saying the \"frequent flyer PM\" has gone to Kuwait while the people of Manipur continue to wait.Congress general secretary of communications, Jairam Ramesh, in a post on X, said, \"Such is their fate, As Mr. Modi refuses to find a date, The people of Manipur continue to wait, While the Frequent Flyer PM is off to Kuwait.\"PM in Kuwait Live Updates: In an interaction on social media platform X, an Indian woman posted a message addressed to PM Modi asking him to please meet her grandfather who is an ex-IFS officer as he is a big fan of the prime minister.In her post she said, “ Humble request to Hon'ble PM @narendramodi to meet my 101-year-old Nanaji, ex-IFS officer, in Kuwait during tmrw’s interaction with the Indian Diaspora. Nana @MangalSainHanda is a great admirer of yours.”PM Modi responded to her message, saying that he looked forward to meeting the 101-year-old Indian citizen.PM in Kuwait Live Updates: Prime minister Narendra Modi, will attend the Arabian Gulf Cup inauguration during his visit to Kuwait. Modi is visiting Kuwait the invitation of Kuwaiti Emir Sheikh Meshal Al-Ahmad Al-Jaber Al-Sabah.PM in Kuwait Live Updates: As PM Modi commences his 2-day visit in Kuwait, he will interact with the Indian diaspora in the country, where Indians constitute 21 per cent (1 million) of the total population of Kuwait and 30 per cent of its work-force (around 9 lakhs), reported news agency PTI.Indian workers top the private Sector as well as domestic sector (DSW) work force list, according to the Indian Embassy in Kuwait.PM in Kuwait Live Updates: PM Modi is visiting Kuwait, the first visit by a prime minister to the country in 43 years, and will be interacting with the Indian diaspora in the nation. He will also be discussing trade agreements with Kuwait, which is is among India's top trading partners, with bilateral trade valued at USD 10.47 billion in the financial year 2023-24.West Asian interests for both countries may also come into play, with the recency of the collapse of President Assad's regime in Syria.Prime Minister Narendra Modi reached Kuwait for a 2-day visit at the invitation of Sheikh Meshal Al-Ahmad Al-Jaber Al-Sabah, the Amir of the State of Kuwait.This is the first visit of an Indian Prime Minister to Kuwait in 43 years."}},{"headline":"'Into God's account': Minister on temple refusing to return devotee's iPhone","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/Apple-Apple-Intelligence-0_1734779117702_1734779128184.jpg","summary":"After accidentally throwing the phone while offering a donation, the devotee, identified as Dinesh, demanded his smartphone back.","link":"/india-news/into-gods-account-tamil-nadu-minister-on-temple-refusing-to-return-devotees-iphone-101734778938390.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/Apple-Apple-Intelligence-0_1734779117702_1734779128184.jpg","text":"Subscribe Now! Get features likeThe Tamil Nadu Hindu Religious and Charitable Endowments Department has declined a request by a devotee to return his Apple iPhone that had accidentally fallen into the hundial of the Sri Kandaswamy temple. The body said that the smartphone was now the temple's property.After accidentally throwing the phone while offering a donation, the devotee, identified as Dinesh, approached the officials of the Sri Kandaswamy temple and demanded the phone back.On Friday, after opening the offering box, the temple administration contacted him, saying the gadget was found in the hundial. However, he was free to retrieve only the data from it. However, Dinesh refused to accept and insisted that his phone be returned to him.HR & CE Minister P K Sekar Babu on Saturday reacted to the controversy, saying anything that is deposited in the offering box goes into God's account.\"Anything that is deposited into the offering box, even if it be an arbitrary action, goes into God's account,\" he said, reported PTI.\"As per the practices and tradition at the temples, any offerings made into the hundial directly go into the account of the deity of that temple. Rules do not permit the administration to return the offerings back to the devotees,\" he added.He said he would discuss with the department officials to see if there was any possibility to compensate the devotee and accordingly make a decision.This incident is not the first such one in the state. According to a senior HR & CE official a devotee S Sangeetha from Alappuzha in Kerala unwittingly dropped her 1.75 sovereign gold chain into the hundial of the renowned Sri Dhandayuthapani Swamy temple in Palani in May 2023.The gold chain fell into the hundial when she removed the Tulasi garland around her neck to make an offering. However, considering her financial background and after confirming through CCTV footage that the chain had fallen by accident, the chairman of the temple board of trustees bought a new gold chain of the same value at his expense and gave it to her, reported PTI.The official explained that as per the Installation, Safeguarding and Accounting of Hundial Rules, 1975, none of the offerings made into the hundials can be returned to the owner at any point, as they belonged to the temple.With inputs from PTI"}},{"headline":"Cheetah project in Gujarat faces setback due to incessant rainfall","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/150x84/-Representative-Image-_1734778665259.jpg","summary":"Gujarat government had aimed to complete the project by December. However, due to the delays caused by the heavy rains, the project is now expected to be finished by March or April next year","link":"/india-news/cheetah-project-in-gujarat-faces-setback-due-to-incessant-rainfall-101734778673291.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/-Representative-Image-_1734778665259.jpg","text":"Subscribe Now! Get features likeAhmedabad/New Delhi: Incessant rainfall in Kutch this year has delayed the establishment of a ₹20-crore cheetah conservation breeding centre in the Banni grasslands, a project sanctioned by the Centre, said officials on Saturday. “The National Tiger Conservation Authority (NTCA) did not set a specific deadline for the project, but the Gujarat government had aimed to complete it by December. However, due to the delays caused by the heavy rains, the project is now expected to be finished by March or April next year,” said a senior Gujarat forest official, who requested anonymity.He added that the Centre had already released ₹3 crore for the project.Kutch district, which houses the Banni grasslands, witnessed exceptional rainfall this year, receiving 185% of its seasonal average by August 2024. The heavy downpours, which caused widespread flooding, disrupted the groundwork for this crucial conservation project, forcing authorities to reassess their implementation strategy in the region.Earlier this year, the central zoo authority (CZA) approved the establishment of a cheetah conservation breeding centre in the Banni grasslands to facilitate the reintroduction of cheetahs to Gujarat after decades. The centre is designed to house 16 cheetahs, furthering India’s wildlife conservation efforts, said officials.The Gujarat forest department has set up a 500-hectare enclosure in Banni, Kutch, for the breeding centre. The project includes the construction of fencing, habitat redevelopment, and the establishment of a hospital. “We have built a hospital, an administrative unit, and a quarantine unit. Additionally, we have designated 70-80 hectares of Buma, a controlled and enclosed area within the breeding centre, for the soft release of cheetahs. This area will help the cheetahs transition gradually from the quarantine unit to the larger breeding enclosure, allowing them to adapt to their new environment,” said Sandeep Kumar, chief conservator of forest (CCF), Kutch territorial forest circle.Banni was chosen from ten potential sites identified in 2009 for cheetah reintroduction due to its savannah-like habitat, which resembles east African landscapes. The region also features Pilu trees (Salvadora persica), providing suitable perching spots. Historically, cheetahs were present in the area, with records of cheetah hunting in Saurashtra and Dahod until 1921 and references to their presence in Gujarat until the early 1940s, said officials.To support the cheetahs, the forest department has improved about 14,000 hectares of grasslands at Banni and introduced a chinkara (gazella) breeding program to bolster the prey base.“So far, 40 chinkaras have been released in phases to establish the prey base. These animals, sourced from the Rampara Wildlife Sanctuary, were introduced in batches of 20, 10, and 10, with the final phase completed recently. Next, the forest department aims to introduce blackbucks,” said Kumar.HT sought a comment from the ministry of environment, forest and climate change (MOEF&CC) regarding the delay in the project and is awaiting a response.In December 2023, a proposal initiated by the Gujarat government and submitted to the National Compensatory Afforestation Fund Management Authority (National CAMPA) was approved by the executive committee of National CAMPA.The Banni grasslands, along with the Kutch Desert Sanctuary, cover approximately 5,000 km² in the Kutch district of north-western Gujarat. The area lies south of the Rann of Kutch mudflats, and parts of it get inundated by seawater during the rainy season.The centre will introduce cheetahs either from Namibia or South Africa, including Kenya, with an equal mix of males and females, said another government official aware of the matter.The primary focus of this conservation centre will be cheetah breeding and development, not tourism, officials emphasised. “We may consider free-ranging cheetahs in the region with some tourism activity, perhaps a decade or two later once a substantial population has been established,” the official added.Also Read: Ecostani | Two years of Project Cheetah: More pitfalls than success“With proper management strategies and plans to restore the habitat in this presently degraded system, ungulate densities can increase substantially. Under such conditions, it would be possible for this region to support as many as 55 cheetahs, as per carrying capacity estimates,” reads a report, ‘Assessing the Potential for Reintroducing the Cheetah in India’ prepared by the Wildlife Trust of India and Wildlife Institute of India for the MOEF&CC.The region is home to various carnivores, including hyenas, wolves, jackals, Indian foxes, caracals, and jungle cats. It also hosts seasonal visitors like the lesser florican and Houbara bustard and boasts around 32 species of palatable but salt-tolerant grasses. Three Great Indian Bustards have been reported in Abdasa grasslands, about 40 km away.The Banni project initiative comes over two years after the launch of the cheetah reintroduction project at Kuno National Park in Madhya Pradesh on September 17, 2022."}},{"headline":"118 villages in Mizoram yet to be connected by all-weather roads: Guv","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/18/148x111/India_6_1734523724131_1734523741441.jpg","summary":"118 villages in Mizoram yet to be connected by all-weather roads: Guv","link":"/india-news/118-villages-in-mizoram-yet-to-be-connected-by-all-weather-roads-guv-101734778416901.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/18/550x309/India_6_1734523724131_1734523741441.jpg","text":"Subscribe Now! Get features like Aizawl, Mizoram Governor Hari Babu Kambhampati on Saturday said 118 remote villages in the state are still without all-weather roads and emphasised the need for increased support from the Centre to connect these far-flung areas.  Speaking at the 72nd plenary meeting of the North Eastern Council in Tripura's capital Agartala, Kambhampati said projects under the Pradhan Mantri Gram Sadak Yojana are limited in these villages due to fewer habitations, highlighting the need for further support. The meeting was chaired by Union Home Minister and NEC chairman Amit Shah.  Kambhampati lauded the initiative of the DoNER ministry for \"leveraging investment in the region.  Highlighting Mizoram's commitment to attracting investments, he said, \"The state has set up an inter-departmental investment promotion cell , which is currently engaging with investors in tourism and hospitality and skill development sectors.\"  Acknowledging the ongoing efforts of the DoNER ministry in establishing 24 growth centres and 20 border centres as part of the vision to create a North East economic corridor, the governor urged the ministry to \"look into the feasibility of integrating cross-border markets to attract more investment partners from neighbouring countries.\"  He further urged the DoNER ministry and the NEC to \"establish a state-of-the-art skill development centre in Mizoram to promote vocational education in the state.\"  The governor also emphasised the need to upgrade Industrial Training Institutes under the state government to bridge the employable skill gap for various trades and advocated for \"the creation of a common exhibition centre in metropolitan cities to promote handloom, handicrafts, and organic agricultural products.\"  Regarding the National Mission on Edible Oils-Oil Palm , which has been underway in Mizoram since 2021, Kambhampati pointed out challenges such as \"non-availability of sufficient seedlings and poor agriculture farm roads\" as the main hindrances to its expansion.  He stressed the need to \"devise a strong market structure\" and proposed the \"establishment of a dedicated organic certification agency for the region\" to enhance prospects in organic farming.  The governor expressed gratitude for the central government's consistent efforts to promote development in the Northeastern state and appreciated Prime Minister Narendra Modi's emphasis on the importance of the region as a vital part of the nation during the recently concluded 'Ashtalakshmi Mahotsav.'  He further lauded the DoNER ministry and NEC for formulating a comprehensive North East Region Vision 2047, which he described as \"a progressive roadmap for the region's development\" and considered it a significant achievement.  The plenary meeting was also attended by Union DoNER minister and NEC vice-chairman Jyotiraditya Scindia, Union Minister of State for DoNER Sukanta Majumdar, governors and chief ministers of Northeastern states, among others. This article was generated from an automated news agency feed without modifications to text."}},{"headline":"Gemini 2025 Tarot prediction, here's what you need to knowYou start 2025 with Jupiter's blessings in your sign, bringing opportunities for growth and success. By the end of 2025, you might earn a promotion!","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/ge5a1c422796b70edbed4eb86aa4152a1e61b44ac52457e0e4_1734779306565_1734779306835.jpg","summary":"","link":"/astrology/horoscope/gemini-2025-tarot-prediction-heres-what-you-need-to-know-101734777720566.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/ge5a1c422796b70edbed4eb86aa4152a1e61b44ac52457e0e4_1734779306565_1734779306835.jpg","text":"Subscribe Now! Get features likeGemini, your 2025 tarot card is the King of Cups, showing a year where you’ll make a big difference in people’s lives. You’ll become the trusted \"go-to person\" among your friends and at work, with trust being the key to all your connections.Also Read Taurus 2025 Tarot prediction, here's what you need to knowYou start 2025 with Jupiter's blessings in your sign, bringing opportunities for growth and success. However, to make the most of this lucky energy, you’ll need to step into a position of leadership. By the end of 2025, you might even find yourself earning a promotion!Also Read Pisces 2025 Tarot prediction, here's what you need to knowJanuary sets the stage for your success this year. Your main focus should be on building key traits like integrity, honesty, and kindness. As 2025 highlights your growth as a leader, it’s essential to prepare yourself for this role. The Nine of Wands encourages you to evaluate your current situation carefully. Use this month to restructure and reorganize your life, ensuring you understand your strengths, resources, and areas that need improvement.Also Read Aquarius 2025 Tarot prediction, here's what you need to knowIf certain habits or tasks no longer align with your future goals, it’s time to let them go. Remove them from your routine and start creating a plan for fresh, goal-oriented actions to implement in February.With 2025's focus on emotional intelligence as a tool for success, this month is all about exploring and expressing your feelings. If you spent January restructuring and planning, now is the time to fully embrace change by letting go of the old and welcoming the new. The Death card signals a transformative period where you may release the past, whether by ending old friendships, redefining relationships, or moving on from past attachments.Also Read Capricorn 2025 Tarot prediction, here's what you need to knowThis transition might bring sadness or a sense of losing part of your identity, leaving you to question if you’re making the right choices.March is all about seizing missed opportunities. As the \"go-to person\" of 2025, you'll realize how thinking outside the box gives you an edge. This month, focus on finding gaps in solutions that others might have overlooked. If you can step in and solve these problems, you’ll stand out and create a unique place for yourself as a leader.At the same time, it’s important to maintain a positive balance. You don’t want others to feel like you’re overshadowing or making them look bad. Let your humour and quirky charm shine through to win people over. Be friendly, kind, and collaborative. Use this time to make meaningful connections, build partnerships, and show that you’re a team player.April challenges your emotional growth and encourages you to trust your intuition, even when logic tries to lead you in a different direction. One important reminder this month is to avoid overspending or making risky financial decisions.The Seven of Pentacles warns against poor investments, such as putting essential funds into volatile areas like cryptocurrencies. If you receive extra money, such as a bonus, prioritize saving or paying off debt rather than splurging. Be cautious if a friend asks to borrow money — listen to your instincts and don’t commit to anything that doesn’t feel right, even if it seems reasonable. May is all about discovering who you are and what you want to become. You’ll get the chance to explore different roles, try new things, and showcase hidden talents. While being good at many things is exciting, it’s easy to feel stretched too thin.Use this time to figure out what you’re best at and how you can turn those skills into opportunities for financial success. Signs of growth in your career will appear, and you may take on more responsibilities in a leadership role. Focus on sharpening your expertise, but be mindful of burnout. Balance work with fun to stay energized for the months ahead.June is a month to manage expectations and find fulfilment within yourself. The Ten of Cups reminds you to focus on doing what you love for its own sake, not for the approval of others. It can be tough to feel unappreciated at work or in a team, especially when you’ve given your all.Leadership can sometimes feel isolating, and you might expect recognition that doesn’t come when you hope for it. This is a time to build inner strength and ask yourself if your work brings you true satisfaction. July is a month of big decisions, where your intuition becomes your greatest guide. With limited facts, you’ll need to trust your gut to navigate the unknown. You may feel uncertain about the future, and the fear of making a wrong choice could weigh on you.If you’re exploring new job opportunities, the interview process might feel overwhelming. While you could receive multiple offers with tempting perks, deciding which one to accept might leave you feeling unsure. If you do leave your current role, it’s natural to feel guilt or sadness, especially if you’ve built something meaningful.August brings out your competitive side at work. If you've recently joined a large, well-established company, you’ll start to see the workplace for what it truly is — a fast-paced, competitive environment.With a higher title and better pay comes the need to stay sharp and bring your best skills forward. Take time to study your industry closely. Identify your strengths and think about how you can add value to your team or company. If you notice a new trend or business opportunity, don’t hesitate to explore it further; it could set you apart!September is a month for finding deeper meaning in your work. You’ll focus on combining your time, energy, and effort with the relationships you build at work. This month, it's important to look beyond just the paycheck and appreciate the non-financial rewards of your job.Take time to reflect on the daily wins that go beyond money. How do your efforts help build lasting relationships? What lessons are you learning about yourself and others that can add value to your career? Consider what knowledge you’re gaining now that could give you an edge in the future.October is all about expanding your horizons and seeking guidance from mentors and other leaders. You’ll start to see your work as a chance to learn and grow. This month may lead you to critically assess your professional progress, which could inspire a shift in your approach—focusing more on mentorship.There's an opportunity for significant career growth. You might take on managing a larger team or leading a new project that shows your potential for bigger things. You could also explore trying a new role or cross-training at work, positioning yourself as an irreplaceable team member who earns more respect and admiration.November brings a focus on both financial and emotional responsibility. Work pressures may increase, and as others invest in you, the expectation for you to deliver even more value will grow.You might feel uncertain about how others perceive your contributions. Instead of staying silent or fearing failure, take the initiative to ask questions, seek feedback, and be open and transparent about your concerns. This will show your commitment to growth and improvement.King of Pentacles indicates December shows how your hard work finally pays off. You may receive unexpected rewards, with your efforts bringing both financial security and hope for the future.    Choose sun sign to read horoscope"}},{"headline":"Winter solstice, or the first day of winter 2024, brings luck to these zodiacs","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/BRITAIN-SOLSTICE--1_1734775052176_1734775070425.JPG","summary":"With the Sun entering determined Capricorn on December 21, 2024, marking the Winter Solstice, the day brings energy ideal for luck and abundance.","link":"/astrology/horoscope/winter-solstice-or-the-first-day-of-winter-2024-brings-luck-to-these-zodiac-signs-101734773625159.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/BRITAIN-SOLSTICE--1_1734775052176_1734775070425.JPG","text":"Subscribe Now! Get features likeWith the Sun entering determined Capricorn on December 21, 2024, marking the Winter Solstice, the day brings energy ideal for luck and abundance. Two zodiac signs, can embrace a practical approach toward their goals. This significant day, symbolizing new beginnings and transformation, is perfect for bold decisions and setting the foundation for lasting success.Also Read Horoscope Today: Astrological prediction for December 21, 2024CancerDuring the Capricorn season, the universe encourages you to combine emotional depth with strategic thinking. Your nurturing grace and natural intuition are your greatest strengths, helping you face challenges with calm and confidence. This morning, the Moon in Virgo opposes Saturn in Pisces, urging you to address lingering responsibilities. While it may feel overwhelming, Saturn’s energy helps you set strong emotional boundaries and build the stability you’ve been craving. Use this moment to lay a solid foundation for your future success.Later in the day, the Moon squares Jupiter in Gemini, inspiring you to aim high and embrace new opportunities. Jupiter’s expansive energy encourages growth, but it’s important to stay focused on what truly aligns with your heart. Toward evening, Uranus sparks flashes of creativity and fresh ideas as it interacts with the Moon, your ruling planet. Stay open to unexpected solutions and surprises—the universe is guiding you toward abundance and new possibilities.CapricornToday is your day to manifest abundance, Capricorn! With the Sun officially entering your sign, a fresh wave of energy brings renewal and exciting possibilities. This morning, the Sun’s connection with Uranus sparks innovative ideas and sudden opportunities, encouraging you to break free from the usual and take bold, inspired steps toward your goals. Consider this the perfect time to embrace change and steer your ambitions in an exciting new direction.As the day progresses, the Moon aligns with Pluto, inviting you to face lingering doubts and release what no longer serves you. This transformative energy empowers you to rebuild with clarity and strength, clearing the path for personal growth. By evening, the Sun’s link with Pluto amplifies your confidence and leadership, helping you align with your true self. With Venus and the Moon forming a harmonious bond, you’re reminded that vulnerability can be a powerful asset. Lead with your heart, trust your instincts, and seize this moment to shine.    Choose sun sign to read horoscope"}},{"headline":"Winter Solstice 2024: Astrology insight for each zodiac sign","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/BRITAIN-SOLSTICE--15_1734775404505_1734775446777.JPG","summary":"Let's unveil what the winter solstice 2024 means for each zodiac sign.","link":"/astrology/horoscope/winter-solstice-2024-horoscope-astrology-insight-for-each-zodiac-sign-101734521968668.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/BRITAIN-SOLSTICE--15_1734775404505_1734775446777.JPG","text":"Subscribe Now! Get features likeThe first day of winter, or the shortest day of the year 2024, on December 21, 2024, in the Northern Hemisphere, is a significant moment in the astrological calendar. It marks the longest night of the year and the turning point when the days begin to grow longer again. This is a time of powerful symbolism, representing rebirth, fresh starts, and renewal. It’s also the perfect time to pause, reflect, and recharge as you prepare for the year ahead.Let's unveil what the winter solstice 2024 means for each zodiac sign.Aries- As an Aries, you thrive in moments like these and might even feel excited by the shift. You could even be tempted to stay up all night just to see how long the darkness lasts.This season is also a natural pause in the year, making it a great time for Aries to think about their goals. On the solstice night, you might feel motivated to start something big, whether it’s writing a book, planning a family trip, or exploring a new business idea. Use this time to consider the practical steps you’ll take over the next few months. It’s the perfect moment to organise and set yourself up for the future.Taurus- The dark and chilly winter solstice is the perfect time for Taurus to cozy up and enjoy the comforts of home. Whether you’re curled up in a blanket with a warm cup of cocoa or diving into a good book, you’re more than happy to embrace the season’s slower pace.This solstice encourages Taurus to turn inward and explore life’s deeper aspects, like spirituality, personal growth, or philosophical questions. You might feel inspired to broaden your horizons through learning, travel, or meaningful self-reflection. With Uranus, the planet of change, in your sign during this time, you may also find yourself thinking about how to shake things up in the year ahead.While Uranus remains retrograde until January, this is a great time to brainstorm and jot down ideas for 2025. Share your thoughts with a trusted friend or keep them safe for later. These plans may not unfold right away, but they hold the potential for exciting developments in the near future.Gemini- The winter solstice doesn’t stir up heavy emotions for Gemini, as you’re naturally curious and always ready for fresh experiences. With Mercury, your ruling planet, in adventurous Sagittarius, you’ll feel energized to start something new, whether it’s a personal project or a career move.This solstice 2024 also highlights transformation for you, offering the chance to close old chapters and release lingering emotional baggage. Whether it’s through deep reflection or breaking free from outdated habits, this is your moment to make room for fresh opportunities and growth in your life.Cancer- The winter solstice isn't usually a big focus for you, as you're more in tune with the lunar phases. However, with the moon in Virgo on solstice day, you’ll feel a nudge to get organised and plan for the future.This time of year is all about renewal, and you may find yourself reflecting on your relationships, romantic or otherwise. The solstice invites you to strengthen connections, set new intentions with loved ones, or reconsider how you approach love and cooperation. It’s a time for growth and deeper bonding.Leo- As a Sun-ruled sign, Leo, you’re deeply influenced by the solar cycles. The winter solstice, with its long night and short day, may leave you feeling a bit drained. But don’t worry—once the solstice passes and the Sun enters Capricorn, you’ll feel recharged and ready for new challenges.During this time, your focus will shift to health, daily routines, and work-life balance. It’s a great opportunity for you to prioritize self-care, reset your wellness routine, or add more structure to your day. You’ll be motivated to tackle tasks, apply for jobs, or brainstorm new business ideas. A focus on well-being now will set you up for a positive start to the new year.Virgo- As someone who values order and routine, you’ll appreciate the subtle shift in the seasons after the winter solstice, Virgo. With the moon in your sign on Solstice Day, you’ll feel more grounded and inspired to start making plans for the year ahead.This period also encourages you to embrace joy, play, and self-expression. You might feel a strong urge to reconnect with activities that bring you happiness, whether it’s through creative projects, hobbies, or simply enjoying some well-deserved fun. It’s the perfect time to begin planning vacations, weekend getaways, or exciting trips for 2025.Libra- You’re not one for extremes, Libra, and the long night and short day of the winter solstice might feel a bit off-balance for you.This period invites you to focus on your home life and personal foundation. You may feel a desire to create a sense of stability and comfort, whether by nurturing your family or reassessing your living situation. It’s a great time to craft an environment that enhances your well-being.Scorpio- The long, dark night of the winter solstice aligns perfectly with your intense and mysterious energy, Scorpio. You thrive in the shadows and embrace challenges, so this time works in your favor.With Mars in Leo and Pluto in Aquarius, the solstice calls for balance and sparks your communication sector. It’s an ideal moment for you to focus on how you express yourself and share your ideas. Engage in learning, writing, or speaking about what truly matters to you — there’s power in your words during this time.Sagittarius- As the solstice marks the end of your season, Sagittarius, it’s also a time for fresh starts. With Mercury in your sign-on solstice night, your communication skills are enhanced, making it a great time for interviews, meetings, or conversations about your future.You may feel the need to reassess your financial situation, personal values, and how you define success. This solstice encourages you to reflect on what truly matters to you, both materially and spiritually. It’s the perfect moment to set financial goals and think about long-term security. The stars are aligned for favourable outcomes, so be sure to seize the opportunity before Mercury leaves your sign.Capricorn- The winter solstice marks the start of your season, Capricorn, signalling the beginning of a new solar year for you. As the Sun enters your sign, you'll find yourself in the spotlight, whether you seek it or not.This shift brings a surge of energy, making it the perfect time for personal reinvention and setting fresh intentions for the year ahead. The solstice encourages you to start new projects and fully embrace your ambitions.Aquarius- The winter solstice captivates you, as your curiosity about the natural world aligns with the magic of this seasonal shift. However, it also invites a calmer, more reflective energy.This is a moment to pause and look back on the year gone by, giving yourself time to recharge. You may feel drawn to step away from the busyness of life and focus on inner peace, meditation, or nurturing your spiritual growth.Pisces- The winter solstice carries a nostalgic charm, as its long night encourages reflection on the past year and lessons learned. However, with Saturn and Neptune in your sign, it also signals a time to dream bigger and aim higher.Instead of lingering in overthinking, you’ll feel motivated to set fresh goals for the coming year. This solstice also nudges you to think about the collective — your friends, community, and social circles. You may feel inspired to collaborate, share ideas, and strengthen meaningful connections that bring purpose and joy to your life. Choose sun sign to read horoscope"}},{"headline":"Tarot Card Readings: Tarot daily prediction for December 21, 2024","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/g2a61d5fb38a80fc871d32e1ca14cfc72f384af2430d50fa38_1734542409556_1734772745984.jpg","summary":"Let us delve into your daily tarot predictions for December 21, 2024.","link":"/astrology/horoscope/tarot-card-readings-tarot-daily-prediction-for-december-21-2024-101734772632727.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/g2a61d5fb38a80fc871d32e1ca14cfc72f384af2430d50fa38_1734542409556_1734772745984.jpg","text":"Subscribe Now! Get features likeWhat do you want to achieve this week? The week is young, and your heart knows the way. What excites you? What doesn’t? Start with tasks that block your creativity so you can unlock your full potential later.Also Read Monthly Tarotscopes: Here are your Tarot Predictions for December 2024Good things come with effort. While others wait for luck, you're shaping your life into what you want. Be thoughtful about your to-do list today. If something doesn’t feel right, skip it.Also Read Weekly Tarot Card Readings: Tarot prediction for December 15 to 21, 2024Thinking about meeting new people? The new year is near, and it’s a great time to expand your circle. Join a club, try a local event, or head to the gym. Have fun with it!It’s amazing how you can overlook something and later wonder how you missed it. Today, your awareness is sharper, and you’re ready to make changes now that you see things clearly.Love and friendship feel extra special now. You might bump into a soulmate or reconnect with an old friend. If you can, plan a coffee catch-up to strengthen those bonds.Confidence matters to you, and when it wavers, you know it’s time to focus on self-improvement. Identify areas where you feel weak and work on building your strength in those spots.Sometimes, disagreements happen. You might feel stuck in a relationship because you’re not on the same page. Ask yourself: does this issue really matter? Focus on using your strengths to balance the situation.Looking for better ways to manage your time? Maybe it’s time for a new planner or app to stay organized. Whether it’s digital or paper, find a system that works for you and gives you more control over your day. Do you prefer to split everything or keep finances separate? This topic might come up today. Keep the conversation open and work toward teamwork.Feeling creative? It’s the perfect time to try some fun TikTok trends with family. Gather videos to share at your next gathering. A little humour can make everyone’s day brighter.Your choices brought you to where you are now. If you’re unhappy, you can always change things. As the new year approaches, think about areas for self-improvement and make a plan to start fresh.Today, take some time for yourself. Treat yourself to a bubble bath, a relaxing tea, or bake something yummy. Recharge and enjoy a peaceful day to feel refreshed.Choose sun sign to read horoscope"}},{"headline":"Love and Relationship Horoscope for December 21, 2024","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/20/148x111/love_1724779967588_1734695181502.jpg","summary":"Daily Love Horoscope December 21, 2024: Romances in that air for the following sun signs today. Find daily astrological predictions for all sun signs.","link":"/astrology/horoscope/love-and-relationship-horoscope-for-december-21-2024-101734694524493.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/20/550x309/love_1724779967588_1734695181502.jpg","text":"Subscribe Now! Get features likeAries: This is a good day to cultivate all kinds of relationships. The planetary energy brings a positive mood to the atmosphere; people start to joke and have fun. Your relationships are sure to be filled with warmth and positivity. The positiveness of the day will strengthen your relationship and help you make some memorable moments. Singles this is the best time to go out and mingle with other people. Allow the positive energy to lead you to people who make you happy.Taurus: It is okay to accept things in your relationship as they are. Do not try to change everything about yourself and heal emotional issues at once; just take a moment and look at where you are in your process. This mindset will assist you to reduce stress and allow room for growth. Share how you feel with your partner, and know that love will lead the way in healing you. Singles, this is the day to be kind to yourself.Gemini: Your innate ability to be sociable and fluency in speaking make you an intellectual in your communication. The stars suggest you should use this energy to talk to your partner or someone you respect and have interesting discussions. It will strengthen the bond and emphasise your charismatic disposition whenever you feel like sharing your ideas. Singles, your lively communication will keep others glued to you.Cancer: Be careful of being adamant today, as it may cause tension in your interactions. Although it is crucial to hold your ground, do not let your stubbornness push you away from your loved ones. Permeability and compromise will be your strengths in terms of preserving balance. If you are in a relationship, consider whether you are making things tense by being too rigid. Talk to your partner about understanding how to make things equal.Leo: Emotions can become complicated today, which means that it can be hard to sort things out and come to some sort of conclusion. If you struggle to understand your feelings towards your partner or vice versa, this turbulence requires patience and communication. For couples, this is not the day to force conversations or decisions. Instead, try to listen to each other and appreciate each other’s points of view without making judgments.Virgo: Today, it is time to leave the mundane behind and concentrate on people. Instead of just passing the time and talking about unimportant stuff, take your loved one for a walk and have a serious discussion about your future together. For couples, this is a great chance to get your visions in tune and talk about what is important. Whether it is clearing up any issues or just making decisions, this intimate conversation will provide direction to your relationship.Libra: Your passion and commitment to your goals are your finest qualities, but the stars suggest that you also think about your relationship today. Do you work hard for someone who does not give you much in return? Love should be a work that is done in cooperation and with respect. It is a good time for those in a relationship to assess the energy levels between you and your partner. Express your expectations and work hard on your bonding.Scorpio: Be reliable and emotionally attentive to your partner today. Any action that will make your partner know that you care for their feelings will go a long way in making your relationship better. If you are single, then you should be yourself in your interactions. Demonstrate that you care about the other person's words and lay the groundwork for a real relationship. Love is all about honesty and loyalty.Sagittarius: Look to understand how valuable the knowledge and advice of your family and friends are in your life. They may have given you rather objective insights into your interpersonal relationships earlier. They understand you better than you understand yourself; they can notice things you might not, and their opinion is wise. Some of these tips may be useful to share with your partner if you are in a relationship.Capricorn: The stars shower you with emotional stability and a deep sense of wellness today, making this a good time to cultivate your relationships. You are feeling more confident, which spreads out to the people around you, making them attracted. Employ this power well to form productive relationships and strengthen existing relationships. This is a perfect day for couples to take the lead in their relationship.Aquarius: Love is not about grand gestures today. If you are committed, think about doing something that has been on your partner’s to-do list. These small gestures will deepen the connection, and add some warmth to the relationship. For singles, the energy is positive for reaching out to someone you like or spending time with friends who warm your heart with love. You may find authentic forms of relating more meaningful.Pisces: You may be experiencing a less-than-exciting day. Don’t allow it to become a stagnant relationship; be the one to revive your partnership and bring excitement back. This is a great time to be innovative and recreate an experience you both once enjoyed. But be cautious with your actions. While it is good to be spontaneous, this might not work well if you are making a move that your partner does not want or is in a bad mood to handle. Neeraj Dhankher(Vedic Astrologer, Founder - Astro Zindagi)Email: info@astrozindagi.in, neeraj@astrozindagi.inUrl: www.astrozindagi.inContact: Noida: +919910094779                            Choose sun sign to read horoscope"}},{"headline":"Get holiday-ready with these Christmas makeup looksHere are expert-approved Christmas makeup looks to try this season for a festive, flawless finish","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/christmas_makeup_looks_1734778843901_1734778857729.jpg","summary":"","link":"/htcity/htcity-showstoppers/get-holiday-ready-with-these-christmas-makeup-looks-101734778364485.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/christmas_makeup_looks_1734778843901_1734778857729.jpg","text":"Subscribe Now! Get features likeThe holiday season is here, and what better way to embrace the Christmas spirit than with a dazzling makeup look? This year, let your beauty palette reflect the festive cheer with bold lips, frosty tones, and sparkling embellishments. Here are some Christmas makeup ideas to try. “For those who love a touch of whimsy, pixie dust lids are a must-try”, says makeup artist Vimal Jain. Take cues from Sonam A Kapoor’s iridescent look with glitter on the eyelids. Combine with a nude lip, or go fully festive with a glittery lips. Pro tip: Use a glitter primer to keep the sparkle in place throughout the night.Selena Gomez’s icy blue eyeshadow captures the magic of a winter wonderland, while a bold eyeliner adds definition. Go for silvers, pale blues and shimmering whites and add a touch of highlighter to the inner corners for that frosty finish. A dewy complexion and clear gloss completes this snow-kissed look. Why settle for simple when you can shine like Sabrina Carpenter? Whether you opt for a single gem at the outer corners or a full rhinestone-encrusted wing, this high-impact style screams holiday extravagance. Pair with a sleek cat eye and a touch of bronzer for festive drama.Berry sweet lipsDeep plum or berry shades are a fave for the festive season. “This shade flatters all skin tones and pairs perfectly with subtle eye makeup. Opt for a matte lipstick for a chic, modern vibe or a glossy finish to add some holiday sparkle,” says Jain. Makeup artist Divya Arora adds, “Plum is a quintessential festive lip colour because it combines depth, richness and elegance, making it ideal for celebratory occasions; it also complements a variety of skin tones.” Take Christmas creativity to the next level with Katy Perry’s candy cane eyeliner. This whimsical look combines red and white stripes with a classic winged liner for a playful touch. Complement it with bold red lips and flushed cheeks for a vintage aesthetic. Faux freckles and voluminous lashes complete the look, which pairs beautifully with retro waves or curls."}},{"headline":"9 green flags to look out for in dating, according to relationship coach","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/couple_1734777544715_1734777544885.jpg","summary":"Relationship coach shares the 9 signs in dating that can help you identify a green flag person.","link":"/lifestyle/relationships/9-green-flags-to-look-out-for-in-dating-according-to-relationship-coach-you-feel-safe-to-101734777332984.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/couple_1734777544715_1734777544885.jpg","text":"Subscribe Now! Get features likeDating is a journey where you go through many ups and downs. It has several indicators in the form of green flags, red flags, beige flags and so on. While identifying red flag behaviour to help avoid painful heartbreaks is important, it is equally necessary to know the green flags that show the potential for a healthy and fulfilling connection. Relationship coach Hrithik Singh described green flags as positive traits or actions indicating healthy behaviours that set the foundation for a strong and lasting relationship.A post shared by Hritik Singh | Relationship Coach 🇮🇳 (@yourrelationshipschool)He shared some green flags in dating to look out for:Unlike the ambiguous nature of red-flag individuals who hesitate to commit or define the relationship, green-flag people are clear about their intentions and know what they want. Hrithik Singh said,” When someone is dating consciously and intentionally, you don’t find them saying, ‘Oh, let’s just go with the flow/I don’t know what I want/I was bored and that’s why I installed this dating app,” they are clear about what they want and are not afraid of expressing that.Green flag people take accountability. They don’t evade uncomfortable situations and own up to their mistakes. Hrithik emphasised how this shows emotional maturity. He added, “The hallmark of an emotionally mature person is that they take ownership in life. They don’t keep pointing fingers and blaming their parents/ex/circumstances, they have a healthy relationship with personal responsibility and take ownership to correct/improve themselves when someone offers them feedback.”Kindness is one of the integral values. Hrithik stated how kindness isn’t just a tool to impress or get validation but actually a way of life. Kindness has to be genuine.There’s no discrepancy between words and actions. The promises are not shallow and have actual meanings. Hrithik explained that when someone is truly committed, their words and actions will line up consistently.A true green flag will make conversations easy and effortless. They are willing to create a safe space for difficult conversations. The relationship coach highlighted how these green flag people make it emotionally safe to open up, and he reminded it’s one of the telltale signs of a good relationship.ALSO READ: Your ultimate guide to dating appsConsistency is one of the green flags in a person. The relationship coach said, “Someone who truly loves you and wants to build with you will treat your relationship like a priority and will make you feel certain, safe and appreciated. So consistency means how the green flag person is consistent in their efforts to keep building the relationship. Hrithik emphasised how consistency is the key differentiator between a partner who is emotionally invested and someone who is unavailable.” Every relationship needs work, but when it feels effortless, it’s an indicator that the partner is a green flag. The relationship coach explained that the right relationships feel effortless, not because they require no effort, but because both partners equally commit to building the connection and ‘show up’.Everyone has boundaries and thresholds, and they don't let people cross to preserve their privacy. Partners need to respect that. In fact, according to the relationship coach, it is one of the true tests of character. Hrithik explained, “The true test of someone’s character is how they respond to you when they don’t get their way. How your partner reacts to your limits/NOs demonstrates their relationship with emotional maturity and boundaries.”A partner is supposed to make you feel at ease and accept you however you are. Relationship coach Hrithik pointed out that one of the signs of a bad partner is shaming insecurities and weaponising vulnerabilities. He added, “A good partner acknowledges your insecurities/vulnerabilities and doesn't make you feel bad for your ‘ugly parts.’\"Disclaimer: This article is for informational purposes only and not a substitute for professional advice.ALSO READ: New wave: Why relationships are about more than red, green and other flags"}},{"headline":"A skyfall playlist: The newest vaporwave music is climate-themed","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/150x84/A-still-from-the-Dreamweather-track-Hazardous-Weat_1734772907303.jpeg","summary":"This sub-genre has stayed committedly under the radar. It’s making another ‘comeback’ now, with a focus on the weather channel.","link":"/lifestyle/art-culture/a-skyfall-playlist-the-newest-vaporwave-music-is-climatethemed-101734772910996.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/A-still-from-the-Dreamweather-track-Hazardous-Weat_1734772907303.jpeg","text":"Subscribe Now! Get features likeVaporwave, a sub-genre of electronic music, should ideally be both listened to and watched. The audio-visual packages serve as a throwback to the lo-fi 1980s and ’90s. The sound is meant to evoke memories of the steely ambience of shopping centres and an era of pixelated Internet interfaces. The imagery is drawn from the TV aesthetic of this era: neon colours, grainy resolution, VHS-style distortion.  Put together, the effect is of an analog dream in the internet era. Adding to the sense of a strange, disturbed nostalgia is the theme of the newer music being created in this sub-genre. Much of it now deals with the climate crisis.Before we get to how, a bit on vaporwave itself.“Musically, vaporwave typically involves slowing down and manipulating smooth jazz, elevator music or muzak. Artists often sample and distort commercial music from the 1980s and early 1990s, creating a dreamlike, almost surreal soundscape sometimes tinged with melancholia,” says music critic and columnist Sanjoy Narayan.It’s the nostalgia for what one would call a romanticised picture of the 1980s and early 1990s digital era, Narayan adds.“By sampling and distorting commercial music and imagery, vaporwave provides a subtle critique of consumer culture. It exposes the hollowness of corporate aesthetics while simultaneously finding beauty in those very systems.”Commercially, the genre has remained committedly underground. Proponents such as Ramona Langley aka Macintosh Plus aka Vektroid and Daniel Lopatin aka Oneohtrix Point Never aka OPN have indicated that going mainstream would commodify and dilute its message.Because of this relatively low visibility, the genre is written off every few years, only to make a “comeback” each time.This time around, the comeback is climate-themed.Called weatherwave or climatewave, it includes work by artists such as Kana aka Dreamweather, DJ Bloody Sunday and Anima. Vaporwave tends to be lyrics-free, relying on distortions in sound, variations in tone and video to convey its message. Through their music and videos, then, weatherwave artists explore the climate crisis as a direct fallout of hypercapitalist culture.On his eight-track album Conditions at Hickory (YouTube; June 2023), for instance, Dreamweather uses clips from a weather report from April 1989 merged with lo-fi electronic music, contrasting the present time with an earlier one when the weather was less apocalyptic, and the world less dystopian.The first track begins with static, as if one were tuning into an early radio broadcast. Sounds of warning, beeping sounds and tornado sirens start to interrupt the music.Weather channels have been a constant, and once provided a sense of comfort and familiarity in an unfamiliar place, but that is changing and he wanted to reflect that, Dreamweather has said, talking about the video on his YouTube channel.“The genre’s dreamlike, disorienting quality mirrors the psychological state of living in an era of environmental degradation,” Narayan adds. “The fragmented, nostalgic sounds can be interpreted as a response to the instability caused by climate change and economic crises.”Base notesVaporwave itself can be traced to an earlier period of global instability and disillusionment.The genre has its roots in 2009, as older millennials (those born in 1979-81) experienced their first disillusionments with the workplace and with the workings of late-stage capitalism, particularly in the wake of the US-led downturn of 2008.As they mourned the loss of the utopias they were promised, artists such as Vektroid began to release those early, distorted audio-visual packages. The term “vaporwave” is attributed to music producer Will Burnett, who first used it in 2011 to refer to this emerging sound (Vektroid released his genre-shaping album, New Dreams Ltd, that year).The word is a play on “vapourware”, a term for new technology that is promised but never delivered.Through the years, this sub-genre has spawned micro-genres too.“Hardvapor” takes a harsher, more brutalist approach, with techno sounds and computer-generated imagery focused on themes of dystopia and rebellion.In 2016, there was a brief Simpsonwave, a micro-genre made up of YouTube videos that combined clips from The Simpsons (a millennial favourite that’s been running since 1989) with vaporwave music.The apparel and gaming industries have embraced the sub-genre’s neon hues, glitch art and ’80s-’90s nostalgia. In 2018, Nike released a Vaporwave collection. Meta’s Oculus Quest 2 and Horizon Workrooms feature vaporwave-inspired virtual spaces. Virtual-reality games such as Vaporwave Road VR offer immersive neon worlds. And games such as Sunset Mall, Data Wing and Islands: Non-Places channel the sub-genre’s retro-futuristic allure.Buying into these can feel a bit like trading in Che Guevara T-shirts. Anyway, the sense of eerie familiarity, dreamlike disconnect and longing are best experienced in the music."}},{"headline":"The Last Poets: Sanjoy Narayan writes on the grandfathers of rap","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/150x84/The-cover-of-The-Last-Poets--eponymous-debut-album_1734776504752.jpg","summary":"Formed in Harlem in 1968, on the birth anniversary of Malcolm X, the group uses language and music to challenge racial injustice, celebrate Black consciousness.","link":"/lifestyle/art-culture/the-last-poets-sanjoy-narayan-writes-on-the-grandfathers-of-rap-101734776510527.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/The-cover-of-The-Last-Poets--eponymous-debut-album_1734776504752.jpg","text":"Subscribe Now! Get features likeThere is a track that has become an unlikely earworm for me over the past few weeks.  It’s called Bird’s Word and it isn’t really what you’d call a song in the traditional sense. It’s more a spoken-word recital, delivered in the form of a litany, and it’s like a history of the blues, jazz, and soul — delivered in a little over six minutes, with congas, bass, and sax playing in the background.  It’s a poem, really, written in the 1970s by the late Jalaluddin Mansur Nuriddin (birth name: Lawrence Padilla), one of the founders of The Last Poets, a poetry collective and spoken-word group formed in the late 1960s.For a jazz aficionado, the track is pure gold. Nuriddin’s lyrics trace a potent and triumphal history of black music, and pay tribute to the early blues greats: “As Billie began to sing praises to the blackman’s thing / The good Brother Monk threw in some funk / So that the whole world could see / What he is, was and always will be / A genius creatively! / Then Miles began to set new styles / That put us miles ahead / As Dizzy set us free to be ourselves / And ride to heaven from hell in the latest / El-Do-Ra-Do, comin’ for to carry us home!” ***The Last Poets were formed in Harlem on May 19, 1968, the birth anniversary of Malcolm X, three years after the black American revolutionary was assassinated. The group, whose original founders included the two surviving septuagenarians Umar Bin Hassan (birth name: Gilbert Jerome Huling), and Abiodun Oyewole (birth name: Charles David), is the progenitor of hip-hop.Known as the Grandfathers of Rap, The Last Poets blended powerful and revolutionary political poetry with rhythmic musical performances that challenged racial injustice and celebrated Black consciousness.They lived by their ideals. In 1970, Oyewole, then in his early 20s, served time in North Carolina for his role in an armed attack on an office of the Ku Klux Klan (KKK).Those were revolutionary times. The Last Poets were at the forefront of the movement. And their influence was expansive. They inspired other spoken-word performers, including Gil Scott-Heron (author of The Revolution Will Not Be Televised, inspired by The Last Poets’ When the Revolution Comes); and rappers such as Public Enemy’s Chuck D, Tupac Shakur, Mos Def, and the hip-hop band The Roots.And they’re not done. With a tally of more than 20 albums, The Last Poets’ two remaining members released a new one last month. Africanism was recorded in 2019 and features music by Tony Allen, the legendary Nigerian drummer and former musical director of the late Fela Kuti’s ensemble, who died in 2023.The album offers a powerful fusion of Afrobeat and spoken-word poetry. The Last Poets’ raw and passionate delivery is amplified by Allen’s driving rhythms, creating a dynamic and energetic sound.The lyrics harness the power of music to comment uncompromisingly on the social and political. Their style, often confrontational and intense, can seem challenging but never irrelevant. It employs raw, unfiltered language that is intentionally provocative. The poetry of this band has always been a form of linguistic warfare against oppression, played out in rhythmic speech later adopted as the style of hip-hop.But perhaps one of The Last Poets’ most remarkable achievements was transforming poetry from an academic, often-sanitised art form, into a powerful tool of social critique. They showed that a literary art could be a weapon of popular resistance. A weapon that remains razor sharp, as their new album, Africanism, shows.(To write in with feedback, email sanjoy.narayan@gmail.com)"}},{"headline":"RRB JE Answer Key News 2024 Live: Where, how to check provisional key when outRRB JE Answer Key News 2024 Live: Junior Engineer CBT 1 provisional key not released yet. Follow the blog for latest updates.","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/chandigarh-chandigarh-hindustan-admission-students_1734773531720_1734773532024.jpg","summary":"","link":"/education/competitive-exams/rrb-je-answer-key-news-2024-live-updates-cbt-1-response-sheet-provisional-key-railway-recruitment-board-junior-engineer-101734773421445.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/chandigarh-chandigarh-hindustan-admission-students_1734773531720_1734773532024.jpg","text":"RRB JE Answer Key News 2024 Live: Railway Recruitment Boards has not released the RRB JE Answer Key yet. When released, candidates who have appeared for the test can check the Junior Engineer CBT 1 provisional key on the official websites of RRBs under which they have applied.  The JE and other posts computer-based test, CBT 1 was held on December 16, 17 and 18, 2024. The exam duration was for 90 minutes and the number of questions was 100. ...Read MoreThe recruitment process will consist of these stages: the first-stage computer-based Test (CBT-I), the Second-Stage Computer-Based Test (CBT-II), Document Verification (DV), and Medical Examination (ME). The normalized score of 1st stage exam shall be used only for short listing of candidates for 2nd stage exam as per their merit. This recruitment drive will fill up 7951 posts out of which 17 for Chemical Supervisor / Research and Metallurgical Supervisor / Research and 7934 posts for Junior Engineer, Depot Material Superintendent and Chemical & Metallurgical Assistant. The registration process was started on July 30 and concluded on August 29, 2024. Whenever CBT is conducted in multiple sessions for the same syllabus, the raw marks obtained by the candidates in different sessions will be converted to normalized marks.b) The raw marks for a single-session CBT and normalized marks for multi-session CBTs will be used to compute the Merit Index, which is a common benchmark for generating merit for candidates from different Exam Groups.Candidates will be shortlisted for Document Verification based on their marks and merit in the 2nd stage CBT and options. The number of shortlisted candidates will be equal to the number of vacancies.Visit the official website of RRBs.Click on RRB JE Answer key 2024 link available on the home page.A new page will open where candidates will have to enter the login details.Click on submit and your answer key will be displayed.Check the answer key and download the page.Keep a hard copy of the same for further need.The registration process was started on July 30 and concluded on August 29, 2024.This recruitment drive will fill up 7951 posts out of which 17 for Chemical Supervisor / Research and Metallurgical Supervisor / Research and 7934 posts for Junior Engineer, Depot Material Superintendent and Chemical & Metallurgical Assistant.The normalized score of 1st stage exam shall be used only for short listing of candidates for 2nd stage exam as per their merit.The recruitment process will consist of these stages: the first-stage computer-based Test (CBT-I), the Second-Stage Computer-Based Test (CBT-II), Document Verification (DV), and Medical Examination (ME).The exam duration was for 90 minutes and the number of questions was 100.The JE and other posts computer-based test, CBT 1 was held on December 16, 17 and 18, 2024.When released, candidates who have appeared for the test can check the Junior Engineer CBT 1 provisional key on the official websites of RRBs under which they have applied.RRB JE Answer Key 2024 date and time have not been announced. "}},{"headline":"CTET Answer Key News 2024 Live: How, where to check provisional key when out","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/_a667b290-3dd0-11ea-bfbd-f812f33ac46f_1734746816471.png","summary":"CTET Answer Key News 2024 Live: CBSE CTET December provisional key has not been released yet. Follow the blog for latest updates.","link":"/education/competitive-exams/ctet-answer-key-news-2024-live-updates-cbse-december-2024-paper-1-paper-2-response-sheet-101734684945995.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/_a667b290-3dd0-11ea-bfbd-f812f33ac46f_1734746816471.png","text":"CTET Answer Key News 2024 Live: The Central Board of Secondary Education has not released CBSE CTET December Answer Key 2024 yet. When released, candidates who have appeared for Central Teacher Eligibility Test can check and download the provisional key from the official website of CBSE CTET at ctet.nic.in. ...Read MoreThe Board has till now not shared any update on the date and time of release of CTET Answer Key 2024. CTET December 2024 examination was held on December 14, 2024 at various exam centres across the country. As per past trends, the provisional answer key will be issued next. Along with the provisional answer key, the OMR answer sheet will be released and objection window will open. The answer key will likely be displayed for 2-3 days to provide an opportunity to the candidates to challenge the answers. To raise objections candidates will have to pay  ₹1000/- as processing fee for each question they objection is raised. Only paid challenges made during stipulated time will be considered. Challenges without payment of fee and those submitted on any other medium will not be considered. The subject experts will examine all the challenges received and then the final answer keys will be prepared by them. The result will be declared according to the final answer keys. In case challenge on answer key(s) is accepted by the subject expert(s), the amount will be refunded to concerned candidate after declaration of result. When released, candidates who have appeared for Central Teacher Eligibility Test can check and download the provisional key from the official website of CBSE CTET at ctet.nic.in.Visit the official website of CBSE CTET. Click on CTET provisional key 2024 link available on the home page. A new page will open where candidates will have to enter the login details. Click on submit and download the page. Keep a hard copy of the same for further need. The subject experts will examine all the challenges received and then the final answer keys will be prepared by them. The result will be declared according to the final answer keys. In case challenge on answer key(s) is accepted by the subject expert(s), the amount will be refunded to concerned candidate after declaration of result.To raise objections candidates will have to pay  ₹1000/- as processing fee for each question they objection is raised. Only paid challenges made during stipulated time will be considered. Challenges without payment of fee and those submitted on any other medium will not be considered.Along with the provisional answer key, the OMR answer sheet will be released and objection window will open. The answer key will likely be displayed for 2-3 days to provide an opportunity to the candidates to challenge the answers.CTET December 2024 examination was held on December 14, 2024 at various exam centres across the country.The Board has till now not shared any update on the date and time of release of CTET Answer Key 2024.When released, candidates who have appeared for Central Teacher Eligibility Test can check and download the provisional key from the official website of CBSE CTET at ctet.nic.in.The CBSE CTET December 2024 provisional key has not been released yet. CTET December 2024 examination was held on December 14, 2024.CBSE has not shared any update on the date and time of release of CTET Answer Key 2024.The CTET final answer key will be prepared by experts will examine all the challenges received.To raise objections candidates will have to pay  ₹1000/- as processing fee for each question they objection is raised.Only paid challenges made during stipulated time will be considered. Challenges without payment of fee and those submitted on any other medium will not be considered.All questions in CTET was Multiple Choice Questions (MCQs), with four alternatives out of which one answer was the most appropriate. The question paper was set in two languages- English and Hindi.The CBSE CTET December examination was held for two papers- Paper II was held in the morning shift from 9.30 am to 12 noon and Paper I was held in the evening shift from 2.30 pm to 5 pm.Visit the official website of CBSE CTET at ctet.nic.in.Click on CTET December Answer Key 2024 link available on the home page.A new page will open where candidates will have to enter the login details.Click on submit and your answer key will be displayed.Check the answer key and download the page.Keep a hard copy of the same for further need.The subject experts will examine all the challenges received and then the final answer keys will be prepared by them. The result will be declared according to the final answer keys.In case challenge on answer key(s) is accepted by the subject expert(s), the amount will be refunded to concerned candidate after declaration of result.To raise objections candidates will have to pay  ₹1000/- as processing fee for each question they objection is raised. Only paid challenges made during stipulated time will be considered. Challenges without payment of fee and those submitted on any other medium will not be considered.The answer key will likely be displayed for 2-3 days to provide an opportunity to the candidates to challenge the answers.Along with the provisional answer key, the OMR answer sheet will be released and objection window will open.CTET December 2024 examination was held on December 14, 2024 at various exam centres across the country.Central Board of Secondary Education will release CBSE CTET December Answer Key 2024 on the official website of CTET at ctet.nic.in.CBSE has not shared CTET Answer Key 2024 release date and time yet. "}},{"headline":"Kejriwal launches scholarship for free foreign education of Dalit students","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/PTI12-15-2024-000271A-0_1734288341476_1734773818265.jpg","summary":"The AAP supremo said under this scheme, the Delhi government will bear the entire cost of students' education, travel and accommodation. Read details below.","link":"/education/news/kejriwal-announces-ambedkar-scholarship-for-free-foreign-education-of-dalit-students-in-delhi-101734773295801.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/PTI12-15-2024-000271A-0_1734288341476_1734773818265.jpg","text":"Subscribe Now! Get features likeIn the run-up to the assembly elections in Delhi, AAP supremo Arvind Kejriwal on Saturday announced an Ambedkar scholarship for free foreign education of the city's Dalit students.Kejriwal said the Dr Ambedkar Samman Scholarship was a response to the BJP's \"insult\" of Ambedkar.Also read: BPSC aspirants meet Bihar BJP president over irregularities in 70th CSE Prelims 2024, details hereUnion Home Minister Amit Shah \"insulted and made fun of Babasaheb Dr Ambedkar in Parliament. Crores of people who love Ambedkar were deeply pained,\" the former Delhi chief minister said at the AAP headquarters.Ambedkar had said education was the way forward and secured a PhD from the US against all odds, Kejriwal told reporters.The scholarship is a response to the insult meted out by the BJP to the chief architect of the Indian Constitution, the AAP chief added.Also read: Meghalaya Board Exam 2025 datesheet revised for SSLC, HSSLC, check timetable at mbose.in\"Under the scheme, any Dalit student from Delhi will be able to receive education in foreign universities. If they get admission in any such university, the Delhi government will bear the entire cost of their education, travel and accommodation,\" Kejriwal said.Children of government employees will also be eligible for the scheme, he added, without elaborating how and when the scholarships would be given.Also read: JEE Advanced 2025: Information brochure released at jeeadv.ac.in, registration begins on April 23Ahead of the polls, due in February, the AAP supremo has promised ₹2,100 per month to all adult women and free treatment of senior citizens at government and private hospitals if his party returns to power."}},{"headline":"BPSC aspirants meet Bihar BJP president over irregularities in 70th CSE Prelims","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/IMG-20241220-WA0015_1734685934503_1734773095545.jpg","summary":"The candidates of BPSC met Bihar BJP President Dilip Jaiswal at his residence over irregularities concerning the CSE prelims.","link":"/education/news/bpsc-aspirants-meet-bihar-bjp-president-over-irregularities-in-70th-cse-prelims-2024-details-here-101734772512939.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/IMG-20241220-WA0015_1734685934503_1734773095545.jpg","text":"Subscribe Now! Get features likeBihar Public Service Commission (BPSC) aspirants met Bihar Bharatiya Janata Party (BJP) President Dilip Jaiswal at his residence on Saturday to discuss the irregularities that occurred during the 70th BPSC exam.Rohit, one of the aspirants, stated that Jaiswal had invited them to meet him and assured them that action would be taken.\"We were asked by Dilip Jaiswal to meet him and he told us that action would be taken.. if action is not taken then we will be only left with two options.. our patience is now breaking down...we will have to come down to roads and start protesting.. they are deceiving the students... we will give them a time of two days... if they do not listen to our demands we will protest and the BPSC Chairman will be responsible for whatever occurs,\" Rohit told ANI.Also read: JEE Advanced 2025: Information brochure released at jeeadv.ac.in, registration begins on April 23Further, he alleged that the BPSC had no credibility.The aspirant added, \"BPSC has no credibility... they gave our papers late to us and are just unserious about everything... we will sit with five students and they can sit with five members of their body and debate with us... if they lose then the Chairman will have to resign.\"Also read: IIM-B director, seven others booked over caste discrimination against Dalit professorMeanwhile, Jaiswal said that the demands of the students had been heard.Jaiswal while addressing the media said,\"I have heard the demands of the students and I have only advised them to not get into any politics.. BPSC is an independent body and they need to understand the demands of the students.. The body needs to sit down and think of a suitable solution and if they think the students are right, then they can form new decisions... The demands of the students need to be met and thoughtful decisions need to be taken.\"Also read: VITREE January Session Result 2025 for Vellore, Chennai, AP and Bhopal campus out at vit.ac.in, direct links hereEarlier on December 18, the aspirants had protested and demanded a re-examination of the 70th BPSC examination. "}},{"headline":"Meghalaya Board Exam 2025 datesheet revised for SSLC, HSSLC, check timetable","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/21/148x111/12th-standard-students_249d6448-723e-11e9-bdc8-80f5902ed91b_1734773264783.jpg","summary":"Meghalaya Board Exam 2025 datesheet have been revised. The SSLC, HSSLC revised dates can be checked here.","link":"/education/board-exams/meghalaya-board-exam-2025-datesheet-revised-for-sslc-hsslc-check-timetable-at-mbosein-101734773147713.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/21/550x309/12th-standard-students_249d6448-723e-11e9-bdc8-80f5902ed91b_1734773264783.jpg","text":"Subscribe Now! Get features likeMeghalaya Board of School Education has released the revised Meghalaya Board Exam 2025 datesheet for SSLC, HSSLC. Candidates who want to appear for the board examination can check the revised timetable through the official website of MBOSE at mbose.in.As per the official notice, in view of State Government’s announcement to hold the elections to Khasi Hills Autonomous District Council and the Jaintia Hills Autonomous District on February 21, 2025 and counting on February 24, 2025, the SSLC and the HSSLC examination 2025, falling on these dates have been rescheduled.Meghalaya Board Class 10 Exam 2025 Datesheet: MBOSE SSLC timetable out, check hereThe SSLC examination for Mathematics/ Special Mathematics scheduled for February 21 will now be held on February 25, 2025. The HSSLC examination for the Physics paper scheduled for February 24 will be held on March 6, 2025. The Sociology paper scheduled for February 24 will be held on March 18, and Vocational Subjects/ Poultry Farming—IV/ Computer Technique IV scheduled for February 21 will be held on March 19, 2025.With the timetable for Class 10, 12 revised, the Class 10 board examination will begin on February 10 and will end on February 25, 2025. The examination will be held in single shift- from 10 am to 1 pm. The exam halls will open at 9.30 am and question papers will be distributed at 9.45 am. The answer scripts will be distributed at 9.50 am and candidates can start writing at 10 am.Candidates can follow the steps below to download the rescheduled notice. "}},{"headline":"After Ashwin's Sudden Retirement, Wife Prithi's 1st Reaction: \"Burden...\"","pic":"https://c.ndtvimg.com/2024-09/cpvm4nn_r-ashwin-wife_625x300_24_September_24.jpeg?im=FeatureCrop,algorithm=dnn,width=100,height=120&w=100","link":"https://sports.ndtv.com/cricket/after-ravichandran-ashwins-sudden-retirement-wife-prithi-narayanans-1st-reaction-time-to-set-the-burden-7298485#pfrom=home-ndtv_lateststories_topstoriesImg","contents":{"image":"https://c.ndtvimg.com/2024-09/cpvm4nn_r-ashwin-wife_625x300_24_September_24.jpeg?im=FeatureCrop,algorithm=dnn,width=806,height=605","text":"For Ravichandran Ashwin, his family holds an important place. Time and again, Ashwin has elaborated the role played by his wife Prithi Narayanan and two daughters in his life. So, after Ashwin decided to bid goodbye to an illustrious cricket career, Prithi revealed in a long emotional post about what it was to see one of the greatest cricketers of the generation from such close quarters. Ashwin decided to retire from international cricket with two Tests left in the Border Gavaskar Trophy. \"It has been a blurry two days for me. I have been thinking about what I can say.. Do I put this down as a tribute to my all time favorite cricketer ? Maybe I'll just take the partner angle? Or maybe a love letter from a fan girl? I guess this is a little bit of all of it,\" Prithi Narayanan wrote in an Instagram post.\"When I saw Ashwins PC, I thought of small and big moments. Many many memories over the last 13-14 years. The big wins , the MOS awards, the quiet silence in our room after an intense game, the sound of the shower running for much longer than usual on some evenings post play , the scratch of pencil over paper as he scribbled thoughts down, the constant streaming of footage videos when he is making a game plan, the calm of meditative breathing before leaving for each game, certain songs playing on repeat while he unwinds. \n\"The times we weeped in joy - after the CT final, after the MCG win, after the Sydney draw, The Gabba win, after making a comeback in T20s...the times we sat in silence and the times when we had our hearts broken.\"Prithi went on to describe what it was like to witness Ashwin's journey from a close quarter.\"Dear Ashwin, from not knowing how to put a kit bag together to following you to stadiums all over the world, rooting for you, watching you and learning from you, it has been an absolute pleasure. The world you introduced me to gave me the privilege to watch and enjoy a sport that I love from close quarters,\" she wrote. \"It also showed me how much passion, hard work and discipline is needed to keep your head above water. And sometimes even that is not enough. I remember us talking about why you, R Ashwin, had to do all of this and a lot more to even stay relevant in the scheme of things. How awards, the best of stats, the POMs, the accolades, the records didn't matter if you didn't sharpen your skill sets constantly and did not put in the work. Sometimes, nothing is enough. A post shared by 𝒫𝓇𝒾𝓉𝒽𝒾 𝒜𝓈𝒽𝓌𝒾𝓃 (@prithinarayanan)\"As you end your wonderful international run, I only want to tell you that it's all good.It is all going to be good.It is time to set the burden of being you down. Live life on your terms, make space for those extra calories, make time for your family, make time to do absolutely nothing, share memes all day, create a new bowling variation, bug our kids out of their minds. Just do it all\"\n                                    Advertisement\n                                AdvertisementAdvertisementAdvertisement"}},{"headline":"Video: How Railways' Anti-Collision System 'Kavach' Helps Loco Pilots In Fog","pic":"https://c.ndtvimg.com/2024-12/bj4o9o1_kavach-railway_625x300_21_December_24.jpeg?downsize=100:120&w=100","link":"https://www.ndtv.com/india-news/railway-minister-ashwini-vaishnaw-highlights-kavach-s-role-in-preventing-accidents-during-dense-fog-7299325#pfrom=home-ndtv_lateststories_topstoriesImg","contents":{"text":"Kavach's primary function is to monitor and control train speeds.Railway Minister Ashwini Vaishnaw has highlighted the role of the ‘Kavach' system in ensuring train safety during foggy weather. Kavach, which means armour, is an anti-collision system developed to achieve the goal of “zero accidents.”In a video shared on X (formerly Twitter), a train is seen navigating through thick fog at a speed of 130 km/h. On the left, a monitor displays a green signal, indicating the train can move seamlessly. The video highlights how the Kavach system aids the loco pilot in operating the train effectively, even in adverse weather conditions.The note attached to the video read, “Dense fog outside. Kavach shows the signal right inside the cab. Pilot doesn't have to look outside for signal,” highlighting the system's ability to operate in challenging weather conditions.Dense fog outside. Kavach shows the signal right inside the cab. Pilot doesn't have to look outside for signal. pic.twitter.com/cdQJDYNGrk‘Kavach,' a homegrown Automatic Train Protection (ATP) technology, is designed to address challenges posed by unpredictable weather, such as dense fog, heavy rain and extreme temperatures. By monitoring the speed of the train and ensuring it stays within safe limits, Kavach can intervene automatically if the pilot fails to take corrective action in time. This automatic response significantly reduces the chances of accidents, especially in conditions where visibility is severely compromised. The system's real-time signal display inside the cab ensures that drivers can continue operations safely, even when they can't rely on external cues.Kavach's primary function is to monitor and control train speeds, stepping in when the loco pilot fails to respond. If the train exceeds the speed limit or the operator misses a critical signal, the system automatically applies the brakes to prevent potential collisions.Earlier this year, Vaishnaw emphasised the government's commitment to rolling out Kavach on a national scale, with plans for “mission mode” implementation. This push follows a few high-profile train accidents, including a deadly collision in Darjeeling, West Bengal, in June 2024, which occurred due to the absence of Kavach on the tracks. In the aftermath, there have been increasing calls to expedite the installation of the system, particularly in areas prone to extreme weather conditions such as fog.PromotedAs of November 2024, Kavach has been deployed on more than 1,548 route kilometres (RKm) across the South Central Railway and North Central Railway regions. Work is also progressing rapidly on key corridors such as Delhi-Mumbai and Delhi-Howrah, which together cover around 3,000 RKm. Regular trials are being conducted to ensure the system is ready for full deployment on these critical routes.Track Latest News Live on NDTV.com and get news updates from India  and around the world. Watch Live News:Follow Us:................................ Advertisement ................................"}},{"headline":"10 6s, 50-Ball Ton: Iyer Sends Clear Message To BCCI With Whirlwind Knock","pic":"https://c.ndtvimg.com/2024-12/3afgu7p8_shreyas-iyer-mca_625x300_21_December_24.jpg?im=FeatureCrop,algorithm=dnn,width=100,height=120&w=100","link":"https://sports.ndtv.com/cricket/10-sixes-50-ball-century-shreyas-iyer-sends-clear-message-to-bcci-ahead-of-champions-trophy-with-vijay-hazare-knock-7300763#pfrom=home-ndtv_lateststories_topstoriesImg","contents":{"image":"https://c.ndtvimg.com/2024-12/3afgu7p8_shreyas-iyer-mca_625x300_21_December_24.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605","text":"Mumbai captain Shreyas Iyer slammed a century against Karnataka in their Vijay Hazare Trophy match on Saturday. Iyer, who was roped by Punjab Kings for Rs 26.75 crore at the IPL meag auction, slammed an unbeaten 114 runs off 55 balls, cracking 10 sixes and five fours. Iyer's knock propelled Mumbai to a massive 382/4 in 50 overs at the Narendra Modi Stadium in Ahmedabad. The 30-year-old has been in brilliant form in this domestic season, and recently led Mumbai to the Syed Mushtaq Ali Trophy title.Iyer came out to bat following the dismissal of Ayush Mhatre with Mumbai 148/2 in 29.5 overs. Mhatre (78) and Hardik Tamore (84) added 141 runs for the second wicket to give Mumbai a strong foundation.Iyer put on a show after that. He and Shivam Dube built a huge 148-run stand, putting Mumbai in command. Dube cracked five sixes and as many fours to remain unbeaten on 63 off just 36 balls. India T20I captain Suryakumar Yadav could only manage a 16-ball 20.\nIyer is hoping to get back into the team after beind dropped from the central contract list by the BCCI earlier this year. The batter recently said that he is \"super excited\" about being a part of PBKS and is hopeful about delivering results from the very first match.\"Surreal feeling after winning Syed Mushtaq Ali Trophy. A lot of hard work took place behind the scenes. The boys were tremendous with their performance. Now we are done with this part,\" Iyer said in a video uploaded on Punjab Kings' official social media handles.\"Super excited to be part of Punjab Kings. I cannot wait to join the Punjab Kings family. It's been a great year for me to win four trophies. My main goal is to win the IPL trophy for Punjab. I can understand what the feelings must be among the fans. With Ricky coming in, we have shared a great camaraderie from the past. We would be putting our thinking caps on and brainstorming on many aspects. Hopefully, we will deliver from the match one,\" he added.(With ANI Inputs)\n                                    Advertisement\n                                AdvertisementAdvertisementAdvertisement"}},{"headline":"Jesse Eisenberg Says Playing Lex Luthor In 'Batman v Superman' Hurt His Career","pic":"https://c.ndtvimg.com/2024-12/0h1prifg_lex-luthor_625x300_21_December_24.jpeg?downsize=100:120&w=100","link":"https://www.ndtv.com/feature/jesse-eisenberg-says-playing-lex-luthor-in-batman-v-superman-hurt-his-career-7300520#pfrom=home-ndtv_lateststories_topstoriesImg","contents":{"text":"Hollywood star Jesse Eisenberg has claimed that his role as DC villain Lex Luthor in the 2016 superhero flick, Batman v Superman: Dawn of Justice, hurt his career. Mr Eisenberg played the iconic comic book villain in the movie which also saw Ben Affleck's Batman going toe-to-toe against Henry Cavill's Superman that was introduced in Man of Steel (2013) three years ago. \"I was in this Batman movie and the Batman movie was so poorly received, and I was so poorly received,\" Mr Eisenberg reflected on the Armchair Expert podcast.\"I've never said this before, and it's kind of embarrassing to admit, but I genuinely think it actually hurt my career in a real way, because I was poorly received in something so public.\"The Social Network star has appeared in movies such as Now You See Me 2, The Art of Self-Defense, Vivarium, and Zombieland: Double Tap, since the release of Batman v Superman.\"I've been in poorly received things that just don't see the light of day, and for the most part, no one knows. But this was so public, and I don't read notices or reviews or movie press or anything, so I was unaware of how poorly it was received.\"Notably, Batman v Superman, as just the second DC Extended Universe (DCEU) film attempted to introduce a multitude of characters as well as myriad storylines which led to a convoluted mess of a movie. The film received backlash from critics as well as fans alike with most panning the DC executives for trying to compete with Marvel Cinematic Universe (MCU) but not having the patience to craft the characters properly.Also Read | Superman Teaser Trailer Out, Features Superdog Krypto And Hawk GirlMr Eisenberg's statement comes in the backdrop of the release of the Superman teaser trailer. The movie, supposed to kickstart a new era in DC universe has been written and directed by James Gunn of the Guardians of the Galaxy fame. After taking over as the DC boss, Mr Gunn laid the DCEU to rest by announcing that Mr Cavill would not be returning as the Man of Steel.David Corenswet has been cast as the new Kryptonian alien with Nicholas Hoult playing the role of Lex Luthor, previously helmed by Mr Eisenberg. Both are featured in the teaser trailer with Rachel Brosnahan as Lois Lane, Skyler Gisondo as Daily Planet photographer Jimmy Olsen, and Pruitt Taylor Vince as Jonathan Kent, Clark's adopted father also appearing briefly in the 2-minute 20-second video.Track Latest News Live on NDTV.com and get news updates from India  and around the world"}},{"headline":"Don't Like Lizards? Then Sonakshi-Zaheer's Next Pitstop Isn't For You","pic":"https://c.ndtvimg.com/2024-12/93gjp8bg_sonakshi_625x300_21_December_24.jpg?downsize=100:120&w=100","link":"https://www.ndtv.com/lifestyle/dont-like-lizards-then-sonakshi-sinha-and-zaheer-iqbals-next-australian-pitstop-at-lizard-island-is-probably-not-for-you-7299773#pfrom=home-ndtv_lateststories_topstoriesImg","contents":{"text":"Apart from binging in local cuisine and spotting tourist attractions, Sonakshi Sinha and Zaheer Iqbal love a little adventure. Currently on yet another trip, this time in Australia, the couple aren't missing their chance to explore the most thrilling parts of the country. Travellers at heart, Sonakshi and Zaheer are currently exploring the best of Queensland. In her recent Instagram story, Sonakshi shared about being at the Lizard Island and wrote, \"Welcome to @austrailia. Where they aren't kidding about the Lizards.\" If you wish to get on an adventure just like the actress, here's your guide for the same.Also Read: Plan A Scuba Diving Trip To Queensland, Australia Like Sonakshi Sinha And Zaheer Iqbal DidIf you too wish to add adventure Australian escapade, add the Lizard Island to your itinerary. Here's your entire guide to plan your trip to the place.Situated in the northern reguon of Australia's Great Barrier Reef, the Lizard Island is enriched with diverse Australian wildlife and bound by private beaches. To experience a luxurious, once in a lifetime experience, you can also opt for accommodation at the island's resort that simply will take your adventure to another level.To make your travel plan easy and fuss-free, you may opt for the most common way to reach the island. You can fly to Cairns Airport and then take a connecting flight to Lizard Island Airport. One can also take a ferry from Cairns to Lizard Island.There are an array of activities and things that one can try. Your trip doesn't have to be just limited to one adventure. For the adrenaline rush, you need to add snorkelling or diving to your travel list. Visit the Lizard Island research station and explore multiple kinds of species. Of course, one cannot miss out on relaxing at one of the multiple beaches.Also Read: At St Regis' Susegado Restaurant In South Goa, Dinner By The Seaside Is Served Exquisitely Under The StarsWell, take cues from Sonakshi Sinha and Zaheer Iqbal and plan an adventurous trip to AustraliaTrack Latest News Live on NDTV.com and get news updates from India  and around the world"}},{"headline":"Star Devastated After 'Career-Ending' Axing From Aus vs India Series Squad","pic":"https://c.ndtvimg.com/2024-12/vfc0sdh_mcsweeney_625x300_21_December_24.jpg?im=FaceCrop,algorithm=dnn,width=100,height=120&w=100","link":"https://sports.ndtv.com/australia-vs-india-2024-25/star-devastated-after-career-ending-axing-from-squad-for-australia-vs-india-series-7299048#pfrom=home-ndtv_lateststories_topstoriesImg","contents":{"image":"https://c.ndtvimg.com/2024-12/vfc0sdh_mcsweeney_625x300_21_December_24.jpg?im=FaceCrop,algorithm=dnn,width=806,height=605","text":"Rookie Australia opener Nathan McSweeney admitted feeling \"devastated\" after being dropped for the last two Tests of the Border-Gavaskar Trophy against India but vowed to work hard to reclaim his spot in the national team. McSweeney was on Friday dropped by the national selectors, who handed a maiden call-up to teenage sensation Sam Kontas.\"Yeah, I mean devastated, I get the dream come true and then didn't quite work the way I wanted,\" McSweeney told Channel 7.\"But it's all part of it, and I'll get my head down and get back in the nets and work really hard and hopefully be ready to go for the next opportunity.\" The 25-year-old, who made his Test debut in the series-opener in Perth, struggled at the top with scores of 10, 0, 39, 10 not out, 9, and 4 in his six innings. He was dismissed by Indian pacer Jasprit Bumrah four times during the series.\n\"It's the game we're in. If you don't take an opportunity and you're not performing as well as you want to, your position's never safe,\" McSweeney said.\"So I missed out a few times with the bat and unfortunately wasn't able to take my opportunity, but as I said, I'll work really hard to make sure that if the opportunity comes around again, I'm definitely ready.\" Australia's chairman of selectors George Bailey acknowledged the decision was \"hard\" and said it had been \"deliberated a lot.\" However, former skipper Michael Clarke felt the move to drop McSweeney could potentially \"end his career.\" McSweeney, primarily a middle-order batter, had opened for Australia A against India A before the squad for the first Test was announced. Despite his lack of experience as an opener, he had shown promise in Adelaide's first innings, negotiating challenging conditions alongside Marnus Labuschagne.Australia great Mike Hussey sympathised with McSweeney, calling the decision \"tough.\" \"I really feel for McSweeney. I think it's tough on him. Tough call,\" Hussey said on Fox Cricket.\"I don't know (if it was the right call). It's a tough one on him. It's not easy. The ball's been moving around quite a lot for the openers. A lot of batters at the top of the order have been battling away.\" With all-rounder Cameron Green set to return from injury later in the year, competition for spots in the Australian middle-order is expected to intensify, making McSweeney's path back to the team even more challenging.\n                                    Advertisement\n                                AdvertisementAdvertisementAdvertisement"}},{"headline":"Pakistan Script Massive Record, Become 1st Team In 21st Century To...","pic":"https://c.ndtvimg.com/2024-12/cpgdhc38_pakistan-cricket-team-afp_625x300_20_December_24.jpg?im=FeatureCrop,algorithm=dnn,width=254,height=143&w=254","link":"https://sports.ndtv.com/cricket/pakistan-script-massive-record-become-1st-team-in-21st-century-to-7295052#pfrom=home-ndtv_lateststories_topstoriesImg","contents":{"image":"https://c.ndtvimg.com/2024-12/cpgdhc38_pakistan-cricket-team-afp_625x300_20_December_24.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605","text":"Pakistan veterans Babar Azam and Mohammad Rizwan laid the foundation for a convincing, series-clinching 81-run win over South Africa in the second one-day international at Newlands on Thursday. Pakistan's total of 329 all out was set up by Babar (73) and captain Rizwan (80), who put on 115 off 142 balls for the third wicket. Heinrich Klaasen made 97 for South Africa but the hosts were bowled out for 248. Fast bowlers Shaheen Afridi (four for 47) and Naseem Shah (three for 37) were the main destroyers.The win gave Pakistan an unbeatable 2-0 lead in the three-match series. Pakistan's win on Thursday saw them become the first team in 21st century to win three ODI bilaterals in South Africa.It was their fifth successive series win - and the third for the Champions Trophy hosts in the southern hemisphere season, following victories in Australia and Zimbabwe.\n\"It's a team game, from beginning to end all of the guys are involved and contributing,\" said Rizwan.  Babar and Rizwan, whose combined 204 one-day caps exceeded the total of the rest of the team, batted soundly and sensibly before Babar was out with the total on 192 in the 33rd over.Rizwan followed three overs later to a sensational diving catch off his own bowling by 18-year-old one-day debutant Kwena Maphaka.But the stage had been set for some power hitting by the batsmen who followed, notably player of the match Kamran Ghulam, who hit five sixes in making 63 off 32 balls.With a licence to go for their shots, Pakistan scored 161 runs in the last 17 overs while losing their remaining six wickets.\"Me and Babar started slowly. We were looking for 300 but we got 320-plus. I have never seen Kamran Ghulam play an innings like that,\" said Rizwan.Left-arm fast-bowler Maphaka took heavy punishment but picked up four wickets while conceding 72 runs.South Africa scored more briskly than Pakistan for most of their innings but although all of their first six batsmen made starts, only Klaasen made a significant score.Klaasen, who made 86 in a losing cause in the first match in Paarl on Tuesday, hit eight fours and four sixes off 74 balls. He was the last man out, caught on the deep midwicket boundary.(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)\n\n                                            \n                                            \n                                    Advertisement\n                                AdvertisementAdvertisementAdvertisement"}},{"headline":"\"When Top Order Doesn't Score...\": Jadeja's Stern Message To Kohli And Co.","pic":"https://c.ndtvimg.com/2019-10/bnaak7f8_virat-kohli-jadeja-afp_650x400_11_October_19.jpg?im=FitAndFill,algorithm=dnn,width=254,height=143&w=254","link":"https://sports.ndtv.com/australia-vs-india-2024-25/when-top-order-doesnt-score-ravindra-jadejas-stern-reminder-to-virat-kohli-and-co-with-bgt-on-line-7300219#pfrom=home-ndtv_lateststories_topstoriesImg","contents":{"image":"https://c.ndtvimg.com/2019-10/bnaak7f8_virat-kohli-jadeja-afp_650x400_11_October_19.jpg?im=FitAndFill,algorithm=dnn,width=806,height=605","text":"Star India all-rounder Ravindra Jadeja on Saturday said lack of runs from the top-order builds pressure on the lower-order and called for an improved performance from the batting unit in the Boxing Day Test. Jadeja played a crucial role in the rain-hit third Test against Australia at Brisbane, scoring a gritty 77 in the first innings to help India secure a draw. \"Top-order runs are very important when you play outside India, especially in Australia and South Africa. When the top order doesn't score runs, the responsibility and pressure increase on the lower order,\" Jadeja said during an interaction at the MCG.\"Hopefully, the top-order and the middle-order do well in this Test. As a team, we need the top order to perform. If everyone contributes in the batting unit, the team will do well.\" India's top-order struggled in Brisbane, barring opener KL Rahul, who scored a valiant 84. The rest of the top and middle order crumbled, but Jadeja, playing his first match of the tour, kept India afloat.\nThe match was eventually saved by the last-wicket stand between Jasprit Bumrah and Akash Deep, who produced a heroic partnership to avoid the follow-on.While Washington Sundar was preferred in the opening Test in Perth, Ravichandran Ashwin featured in the second Test in Adelaide.Jadeja said missing the first two matches worked to his advantage as it allowed him to acclimatize to the conditions and prepare for the Gabba Test.\"I got a nice few days to understand and get used to the conditions. I was here so many days, I used to bowl and bat on the tracks here. I got more familiar with the conditions here,\" he said.\"All my handwork in the nets helped me in the match and I played as per my plans.\" India had secured a massive 295-run win at Perth, but Australia levelled the series with a commanding 10-wicket victory in the Pink Ball Test at Adelaide.With the series tied 1-1, India needs just one win in the remaining matches to retain the Border-Gavaskar Trophy. Jadeja emphasized the significance of the Boxing Day Test.\"It's good that we are 1-1 after three Tests. The next two games will be very interesting too. If we win even one Test, we'll retain the trophy because we won the last two series.\"It's a good opportunity to make that one good effort. We'll see what happens in the last match but this is a very important and crucial match for us.\"\n                                    Advertisement\n                                AdvertisementAdvertisementAdvertisement"}},{"headline":"On The Top 50 Asian Celebrities List, Diljit Surpasses SRK","pic":"https://c.ndtvimg.com/2024-12/fkmtc82_e_625x300_21_December_24.jpg?downsize=254:143&w=254","link":"https://www.ndtv.com/entertainment/diljit-dosanjh-surpasses-shah-rukh-khan-on-top-50-asian-celebrities-in-the-world-list-7300174#pfrom=home-ndtv_lateststories_topstoriesImg","contents":{"text":"For all Diljit Dosanjh fans, we have a fantastic update waiting for your attention. The Punjabi singer, who is making waves with his Dil-Luminati tour in India, has claimed the top spot on the UK's list of the Top 50 Asian Celebrities in the World.Wait, there is more. He has dethroned superstar Shah Rukh Khan on the 2024 edition of the list published by UK weekly Eastern Eye. Can't believe it, right? Well, you are not alone. Diljit Dosanjh has celebrated the milestone on Instagram Stories. He has added a picture of himself and used his latest track Don for the background music. Nice one, Diljit, nice one. FYI: Don, sung by Diljit, features a voiceover by Shah Rukh Khan. Singer Charli XCX secured the second spot on the list, followed by Allu Arjun in third, Dev Patel in fourth, Priyanka Chopra in fifth, and actor Vijay in sixth.Singer Arijit Singh was placed seventh. Other notable Indians who featured on the list included Prabhas, Rajkummar Rao, Kartik Aaryan, Amitabh Bachchan, Alia Bhatt and Hrithik Roshan.Diljit Dosanjh has one more reason to celebrate. He is also on the cover of Billboard Canada.Sharing the superhit news, Diljit said, “Next up in Billboard's inaugural Global No. 1s series — @diljitdosanjh, representing #BillboardCanada. Seeing stadiums in Canada inspired him, and now he's playing them — continuing to take Punjabi music all over the world. Read the Billboard Canada cover story at the link in bio — and stay tuned as we reveal more global #BillboardNo1s cover stars, putting a spotlight on the highest-charting local artists in each territory where Billboard now operates.”A post shared by billboard (@billboard)Meanwhile, Diljit Dosanjh's latest stop in his ongoing Dil-Luminati India Tour was Mumbai. He performed at the Mahalaxmi Race Course on December 19. \n                    Entertainment I Read Latest News on NDTV Entertainment. Click NDTV Entertainment For The \n                        Latest In, \n                        bollywood , \n                        regional, \n                        hollywood, \n                        tv, \n                        web series, \n                        photos, \n                        videos and More. \n                "}},{"headline":"Watch: UK Man Leaves Haircut Midway To Help Cop Under Attack, Internet Reacts","pic":"https://c.ndtvimg.com/2024-12/qlene1k_uk_625x300_21_December_24.jpeg?downsize=254:143&w=254","link":"https://www.ndtv.com/offbeat/watch-uk-man-leaves-haircut-midway-to-help-policeman-under-attack-internet-applauds-7299887#pfrom=home-ndtv_lateststories_topstoriesImg","contents":{"text":"A man in the UK has gained overnight popularity on social media after a video showed him leaving a haircut midway and running across the street to help a police officer who was being attacked by a thug. The man, identified as Kyle Whiting, 32, was getting a trim at Haron Barbers in Warrington, Cheshire when he saw the brawl unfold on the street. Before the situation could turn pear-shaped Mr Whiting leapt out of the chair with the barber's cape still draped out to bail the cop out of trouble.With the cape swirling in the air, Mr Whiting grabbed the perp from behind and pulled him off the officer. He kept hold of him as other bystanders gathered around to help. Another officer from a marked police car parked around the corner then ran over, before a second squad vehicle pulled up and the man was detained.\"Before you know it, my barber had taken his phone out and had gone up to the window and started recording. I then saw the guy outside swing for the police officer and throw him down onto the ground,\" Mr Whiting was quoted as saying by BBC.Mr Whiting, whose sister is a police officer, said he was at the place by coincidence as he was taking his girlfriend to the A&E unit at nearby Warrington Hospital.\"I thought, 'I'm not sitting back and watching this'. If that was my sister, I would hope somebody wouldn't hesitate to help her if she was on her own,\" he said.The video clip of the incident has gone viral with social media users applauding Mr Whiting for his selflessness and quick decision-making. Some are calling him the \"caped crusader\" while others dubbed him the \"haircut hero\".\"Not all heroes wear capes... but this one does! Can we take a moment to applaud this fella, mid-haircut - but dashing out to aid a copper with a violent criminal? Not enough people like you around!\" said one user, while another added: \"Cape and all, what a legend.\"A third commented: \"Is it a bird? Is it a plane? No, it's haircut man!\"Not all heroes wear capes... but this one does!Can we take a moment to applaud this fella, mid-haircut - but dashing out to aid a copper with a violent criminal?Not enough people like you around! 💙 pic.twitter.com/6WlN5CraqWCape and all, what a legend 👏🏻Is it a bird? Is it a plane? No, it's haircut man!Cheshire Constabulary later issued a statement thanking Mr Whiting for his support during the incident. The department added that owing to Mr Whiting's effort, a 50-year-old man was arrested in connection to the case and has since been passed to the care of health professionals.Track Latest News Live on NDTV.com and get news updates from India  and around the world"}}]