[{"headline":"BJP replaces Ambedkar’s image with George Soros’s, draws flak from Congress","pic":"//images.indianexpress.com/2024/12/Congress-Ambedkar-Protest.jpg?w=210","link":"https://indianexpress.com/article/india/bjp-ambedkar-george-soros-image-congress-9733709/","contents":{"image":"https://images.indianexpress.com/2024/12/Congress-Ambedkar-Protest.jpg?w=640","text":"A day after the Opposition demanded Union Home Minister Amit Shah’s “removal” from the Cabinet, accusing him of “insulting” Dr B R Ambedkar in his remarks in Rajya Sabha on Tuesday, a fresh row erupted on Thursday over a social media post by the BJP, with the Congress saying the party has once again insulted Ambedkar.In a post on X, the BJP’s official handle used a photo of INDIA bloc MPs protesting with photos of Ambedkar and replaced it with photos of Hungarian-American hedge fund manager-turned-philanthropist George Soros inside the Parliament complex. The photo had the caption: “Hello, Congress and INDI alliance. We fixed the image for you. You’re welcome.”In a statement, Congress MP from Wayanad Priyanka Gandhi Vadra said, “After insulting Babasaheb in the House, today again the BJP has insulted him. They tampered with his photo and imposed someone else’s photo on his. This is the same thinking that damages Ambedkar’s statues at different places. This is an insult of Babasaheb, and an insult of the architect of the Constitution.”Hello, Congress and INDI alliance.We fixed the image for you.You’re welcome. pic.twitter.com/GgrjdidnqK— BJP (@BJP4India) December 18, 2024On Wednesday, the Opposition, cutting across party lines, called on Prime Minister Narendra Modi to sack Shah “before midnight”. Opposition parties also raised the issue in both Houses of Parliament and staged protests outside, displaying Ambedkar’s photographs and raising slogans like, “Amit Shah maafi maango; Babasaheb ka apmaan, nahin sahega Hindustan (Amit Shah, apologise; India will not tolerate Babasaheb’s insult).”Replying to the two-day debate in Rajya Sabha on the ‘Glorious Journey of 75 Years of the Constitution of India’, Shah had said on Tuesday: “Abhi ek fashion ho gaya hai — Ambedkar, Ambedkar, Ambedkar, Ambedkar, Ambedkar… Itna naam agar Bhagwan ka lete toh saat janmon tak swarg mil jata (There is a fashion these days — Ambedkar, Ambedkar, Ambedkar, Ambedkar, Ambedkar… Had you chanted the name of God these many times, you would have been blessed with heaven in seven births).” He went on to add, “we are happy that Ambedkar’s name is being taken”, before listing the Congress’s “injustices” towards him.Reacting to the row, PM Modi had said in a series of posts on X: “If the Congress and its rotten ecosystem think their malicious lies can hide their misdeeds of several years, especially their insult towards Dr. Ambedkar, they are gravely mistaken! The people of India have seen time and again how one Party, led by one dynasty, has indulged in every possible dirty trick to obliterate the legacy of Dr. Ambedkar and humiliate the SC/ST communities..”.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.Kiran Rao's Laapataa Ladies, India's entry to the 97th Academy Awards, has been eliminated from the Best International Feature category, causing mixed emotions among the cast and crew. Actor Ravi Kishan expressed sadness but also pride, while others in the industry questioned the Film Federation of India's decision.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"Express ResearchFrom Ottoman Empire to Berlin streets: The evolution of the döner kebabSubscriber Only","pic":"//images.indianexpress.com/2024/12/donor-kebab-eresearch-feature-I.jpg?w=210","link":"https://indianexpress.com/article/research/whose-doner-is-it-tracing-the-history-of-the-kebab-9733906/","contents":{"image":"https://images.indianexpress.com/2024/12/donor-kebab-eresearch-feature-I.jpg?w=640","text":"In 1990, as globalisation entered its swaggering adolescence and McDonald’s made its Moscow debut, a peculiar debate unfolded at Oxford’s venerable Symposium on Food and Cookery. Textile specialist Robert Chenciner presented a paper titled The Bayeux Tapestry Shish Kebab Mystery, questioning the authenticity of the famous Norman embroidery. His evidence: a panel depicting Norman knights grilling meat skewers over an open fire.To Chenciner, this was culinary anachronism. He argued that Hastings, the English town depicted in the tapestry, didn’t have kebab stalls in 1066. The shish kebab, as the story went, didn’t reach France until much later, brought by Ottoman envoys to Versailles in the 18th century. French academics were scandalised. Julia Child, ever the culinary populist, applauded as if she’d just rediscovered crème brûlée. Curators at the Bayeux Museum, however, pushed back. The issue, they suggested, wasn’t with the tapestry — it was with the kebab itself. Was this iconic snack even Turkish in origin?Few foods inspire as much cultural pride or culinary debate as the kebab. Across millennia and continents, variations on the simple concept of skewered, fire-cooked meat have emerged: satay in Indonesia, souvlaki in Greece, and tikka in the Indian subcontinent.But nowhere is the debate more intense than in Germany, where the döner kebab is practically a national dish — unofficially, if not legally. German streets are dotted with kebab shops offering a greasy, comforting antidote to late-night regrets. According to market research by Germany’s Ministry of Food and Agriculture, Germans consume over two million döner kebabs daily, fuelling a €7 billion industry. Yet this beloved snack has become the focal point of a bitter feud between Berlin and Ankara.For Germany, the döner is more than fast food; it’s a symbol of multicultural identity, woven into the fabric of its streets and social life. For Turkey, it’s about cultural pride and culinary integrity. For everyone else, it’s a reminder that food, as much as politics or art, tells a story — of migration, adaptation, and the ever-shifting boundaries of culture.And so, as Europe debates what makes a kebab truly döner, the age-old question lingers: who, if anyone, owns the right to claim it?Though often attributed to Turkish ingenuity, the kebab’s origin remains contested. Arabic, Persian, and Central Asian cuisines influenced its development. However, while variations of skewered meat exist globally, the Turkish kebab, or kebap, holds a unique place, intertwined with the Ottoman Empire’s legacy and the evolution of Middle Eastern cuisine.According to food historian Mary Işın, the Turkish kebab’s roots trace back to a 1433 account by Bertrandon de la Broquière, a French traveller who described Turkish nomads roasting sheep on spits and slicing the cooked surface. “This method of eating roasted meat – taking slices as they cook – reflects a practical approach for travellers. It’s easy to see how this evolved into the horizontal spits depicted in Ottoman miniatures,” Işın, the author of Bountiful Empire: History of Ottoman Cuisine (2018) told indianexpress.com.The earliest written mention of döner kebab doesn’t appear until 1908, but the practice of layering meat on horizontal spits dates to the 17th century. Two miniature paintings in an Ottoman translation of the Shahnameh, an epic poem written by Persian poet Fardowsi, depict kebabs as central to outdoor feasts. Later, the iconic vertical spit emerged in kebab houses, likely as a space-saving innovation. By 1853, English photographer James Robertson captured an Istanbul street vendor carving meat from a vertical spit, a precursor to the modern döner kebab.The kebab’s versatility has also contributed to its longevity. In Ottoman cuisine, kebab was any meat cooked slowly, whether roasted, grilled, or prepared in a tandır (clay oven). Ottoman elites savoured elaborate dishes like tandır kebabı, while urban middle classes enjoyed affordable skewers of şiş kebabı. Yet, as Işın explains, “Many kebabs were tied to professional cooks and communal settings, home preparation was rare due to the resources and skill required.”Religion shaped kebab preparation as well. Turkish kebabs have traditionally adhered to halal practices, with meat slaughtered under Islamic law. As Engin Akin notes in Essential Turkish Cuisine (2015), the preparation often involved a spiritual dimension, with imams reciting verses from the Quran during slaughter.What began as a humble spit-roast transformed into a global symbol of Turkish culinary identity, paving the way for adaptations like Germany’s beloved döner kebab.As Işın notes, the modern döner has strayed from its origins. “In the 1970s, döner was always lamb. Today, beef dominates because people believe lamb is greasy. The simple onions once served alongside have given way to tomatoes and peppers,” she remarked.The rise of the döner kebab as a cultural and culinary emblem in Germany is deeply intertwined with the history of Turkish migration. In 1961, West Germany signed a recruitment agreement with Turkey to address labour shortages during its economic boom. Young men from rural Turkey, known as Gastarbeiter (guest workers), migrated in large numbers to work in industries like construction and manufacturing. As economic challenges persisted back home, many extended their stays, and by the early 1970s, Turks became Germany’s largest immigrant group.The döner kebab’s evolution into a portable street food staple is widely attributed to Kadir Nurman, a Turkish immigrant in Berlin. In the early 1970s, Nurman began serving shaved meat, salad, and sauces wrapped in flatbread, catering to the fast-paced lifestyle of Berliners. While the idea of assembling a kebab into a sandwich format wasn’t entirely novel, Nurman is credited with introducing this version to German street food culture. In 2011, the Association of Turkish Döner Manufacturers formally recognised his contribution.Over time, the döner kebab has undergone significant changes. According to Manik Soi, a Mumbai-based chef, “Initially, döner kebabs in Germany were prepared with sliced veal, but by the 1980s, demand led to shifts in production.” Soi says that subsequently minced meat became common, allowing the classic döner cone to be mass-produced. Concerns over quality and cost, alongside health scares like mad cow disease, prompted a rise in chicken döner kebabs.“Turkish Germans played a pivotal role in the industrialisation of döner production,” says Soi with “entrepreneurs like Remzi Kaplan, the son of Gastarbeiter, turning döner into big business.” Kaplan Döner Production, one of the industry’s largest players, expanded beyond Germany, leveraging lower production costs in countries like Poland.In any conversation about the origin of the kebab, or food in general, it’s worth noting how migratory patterns and cultures influenced their development in the food that we see today. The primitive döner may have originated in Turkey to the best of our knowledge, but its composition and salient features were influenced by traders and cultures that passed through the land of the Turks.By the Middle Ages, Constantinople had emerged as a global hub of trade, the largest of its kind on the European continent. It served as a bustling crossroads of commerce, exchanging both rare treasures and everyday goods with distant lands like China, while also anchoring trade routes closer to home — connecting with the Rus, the Caliphate, and the Western world. Within this magnificent ‘Queen of Cities,’ a vibrant and eclectic cuisine blossomed. Rooted in Roman and Greek culinary traditions, it was elevated by the bold flavours of exotic spices and condiments sourced from far corners of the earth, creating a rich tapestry of tastes that truly embodied its cosmopolitan spirit. The spices used in early kebab recipes likely originated in India, while the oil used for cooking came from the Levant.During the Byzantine era, Turkish dining patterns cantered around the home, especially for the rich. Meat was a scarcity so while there were limited street food stall offerings scattered across Constantinople, they largely provided accompaniments to meals, rather than meals themselves. By the Ottoman period, according to food scientist Ali Batu, kebabs were found primarily in the palaces and homes of the rich. In Historical background of Turkish gastronomy from ancient times until today (2018), Batu writes, “Culinary culture of the Ottoman Empire was divided into two: the palace kitchen and the public kitchen.” While the palace kitchens adopted meats such as mutton, veal and duck, and embraced new cuisines, the public kitchens, relied on meals heavy in bread and cereals.Claudia Roden in The New Book of Middle Eastern Food says that meat had always been labelled in Arabic literature and folklore as food of the rich and aristocratic – a mark of status. For the rest of the populace, meat was a special treat reserved for feast days and festivals.To answer that, we first have to look at street food patterns. As established, Turkey already had a bazaar culture by the 1800s. However, the food served at those bazaars was for the poor and middle class. This changed, not in Turkey, but in Iran.The rise of chelow kebab in 19th-century Iran under Nasser al-Din Shah marked a turning point. As Margaret Shaida recounts in The Legendary Cuisine of Persia (2002), the Shah’s fondness for this Azari specialty led to the establishment of a restaurant near Tehran’s Grand Bazaar, sparking a nationwide culinary movement. Vendors soon expanded beyond royal grounds, offering kebabs in urban centers as an accessible, street-friendly meal. Unlike most Iranian dishes, chelow kebab thrived in public spaces, becoming the country’s first widespread restaurant staple. As Shaida writes, “Where the court led, the rest of the country followed” and soon chelow kebabs were the dominant street food across Persia.How that impacted Turkey is an interesting anecdote. A traveller passing through Persia on route to Constantinople had remarked on these household kebabs being sold on the street. The streets of Istanbul were cramped and couldn’t accommodate horizontal skewers, so the vendors opted to flip them up vertically instead. This made it more space conscious, allowed the sauces to drip back into the meat, and distributed the cooking time.This tradition influenced Turkish migrants in Germany, where döner kebab became a fast-food phenomenon in the 1960s and 70s. Eberhard Seidel, in Döner: A Turkish-German Cultural History (2022), notes that Berlin is now the “döner kebab metropolis of the world.” Originally served on plates, the dish was adapted into a portable snack with local flavours, such as garlic sauce and raw onions, catering to Germany’s urban lifestyle. The döner’s rise reflects both the integration of migrant cuisines and the tensions of cultural adaptation.The döner kebab’s evolution in Germany exemplifies food’s dual role as a unifier and divider. Celebrated as a symbol of multiculturalism, it also illustrates the power of food to transcend boundaries, adapt to new contexts, and embody both the promise and challenges of migration.Mary Işın, Bountiful Empire: History of Ottoman Cuisine, Reaktion. Books, 2018Ali Batu, Historical background of Turkish gastronomy from ancient times until today, Journey of Ehtnic Foods, 2018Engin Akin, Essential Turkish Cuisine, Stewart Tabori and Chang, 2015Margaret Shaida, The Legendary Cuisine of Persia, Interlink Pub Group, 2002Eberhard Seidel, Döner: A Turkish-German Cultural History, März Verlag GmbH, 2022You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.Chhagan Bhujbal: 'I am not consulted for anything now'Subscriber OnlyWhat Indian PM's first visit to Kuwait in 4 decadesSubscriber Only12 issues that made headlines in 2024Subscriber OnlyRaj Kapoor @ 100: The showman whose magic dazzles usSubscriber OnlyHindi cinema's best to worst in 2024Subscriber OnlyHow One Hundred Years of Solitude turned into a screenplayHow raagas can heal: A life in music and memoriesSubscriber OnlyBandish Bandits Season 2 review: No straggly spots, only theBhupen Khakhar made a virtue of painting pain, he sufferedSubscriber OnlyThe Lord of the Rings The War of the RohirrimWhy not replace car horns with bird sounds?Subscriber OnlyHeretic movie review: Hugh Grant elevates A24 horror filmActor Devoleena Bhattacharjee and her husband Shanawaz Shaikh announced the arrival of their baby boy on December 18 on Instagram. The couple received an outpouring of love and congratulations from fans and friends in the industry.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"Indians in Georgia: Exponential rise in students, visitors, farmers from Punjab","pic":"//images.indianexpress.com/2024/12/Georgia-Ravinder-Singh-and-Gurwinder-Kaur-4col.jpg?w=210","link":"https://indianexpress.com/article/india/indians-in-georgia-rise-in-students-farmers-visitors-punjab-9733527/","contents":{"image":"https://images.indianexpress.com/2024/12/Georgia-Ravinder-Singh-and-Gurwinder-Kaur-4col.jpg?w=640","text":"India was among the first countries to officially recognise Georgia after its independence from the erstwhile Soviet Union in 1991. Diplomatic relations were established a year later, in 1992, but it was the visit of Georgian Foreign Minister Irakli Menagarishvili in May 2000, that firmed up India’s ties with the small nation located at the crossroads of Eastern Europe and West Asia.However, it’s the people-to-people ties and the constant growing presence of Indian community – farmers, workers, students and now even tourists – that has put Georgia higher on Ministry of External Affairs’ engagement agenda. There were merely 2,000 Indians in Georgia in 2016, half of them students, which has now increased 10-fold as per estimates, with 16,000 of them students.In fact, as per the MEA, “There is a sizeable Indian community mostly from Punjab”. In recent years, many Indians have brought investment from Gulf countries and started mid-size businesses such as restaurants and hotels, the ministry says. Consequently, this has also led to an increased number of Indian citizens being employed as workers on such establishments.Among the 12 people who were tragically found dead due to suspected carbon monoxide poisoning at a restaurant in Georgia on Tuesday, 11 were Indian nationals. All of them hailed from the state of Punjab.In fact, monthly consular camps are organized by the Indian Embassy in Tbilisi to address all the consular issues of Indian nationals; even as the Embassy was operationalised in July, there’s yet to be a full-time ambassador. India’s Ambassador to Armenia is still concurrently accredited to Georgia.As per statistics, around 2,000 Indian citizens resided in Georgia as of July 2016, with almost half being students at the Tbilisi State Medical University. About 200 citizens were employed by Indian companies involved in the infrastructure sector till the time, while others are businessmen, agricultural farmers and workers.Interestingly, some years ago, a group of Punjabi farmers who emigrated to Georgia noted that they could purchase 200 hectares of land there from the money made by selling just one hectare of land in Punjab. This led to a rush of sorts from the state, with around 150 of them presently owning about 1,500 hectares of agricultural land.Agricultural land can be acquired on 99-year lease, which can be extended further, owing to the Georgian government’s policy of encouraging migration of people with agricultural knowledge.In 2021, when foreign minister S Jaishankar made his visit to Georgia and interacted with the Indian community, the number of Indian students in the country was roughly 8,000. However, there was an explosion post-2022, in the wake of the Russia-Ukraine war, with thousands of Indian medical students in Ukraine opting for Georgia, which is as economical.As per the MEA statistics in August 2024, around 16,000 Indian students are studying there. “Georgia hosts more than 16,000 medical students studying in 25 universities (unofficial reports put the figure at 18,000). There are many transfer students from Ukraine as well,” it said.Most go there for medical studies at various universities including Tbilisi State Medical University, European University, Caucasus International University – with over two-dozen universities in the country now accepting Indian students.With Georgia presenting itself as a more economically viable but equally picturesque alternative to other European countries, the number of Indian tourists is also gaining. As per statistics by the Georgian Embassy, the number of Indian tourists visiting Georgia has grown 64 per cent in six months of this year compared to last year, which recorded 80,000 Indians visiting Tbilisi and ski resorts around the capital, which became the spot for the Tuesday incident.Since Georgia is not a member of the European Union, the Schengen Visa doesn’t apply there. But the cheaper and simpler eVisa comes in handy for Indian nationals, despite a relatively high rejection rate, say industry experts. While there has been a direct flight between New Delhi and Tbilisi since August 2023, plans are now afoot for a direct flight service from Mumbai as well.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed. Divya A reports on travel, tourism, culture and social issues - not necessarily in that order - for The Indian Express. She's been a journalist for over a decade now, working with Khaleej Times and The Times of India, before settling down at Express. Besides writing/ editing news reports, she indulges her pen to write short stories. As Sanskriti Prabha Dutt Fellow for Excellence in Journalism, she is researching on the lives of the children of sex workers in India.                        ... Read More \n                Five militants were killed and two Indian Army personnel injured in a gunfight in Kulgam, South Kashmir. The militants' bodies have been located but their identities are yet to be ascertained. A joint team of J-K Police and Army cordoned off the area after receiving inputs about the presence of militants. This is the second major gunfight in Kulgam this year.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"Express OpinionHow political drama let Constitution debate downSubscriber Only","pic":"//images.indianexpress.com/2024/12/constitution-debate-parliament.jpg?w=210","link":"https://indianexpress.com/article/opinion/columns/how-political-drama-let-constitution-debate-down-9733092/","contents":{"image":"https://images.indianexpress.com/2024/12/Opinion1_19th-Dec.jpg?w=640","text":"\n\t\t\t\t\t\t\t\n\t\t\t\t\t\tOpinion by Suhas Palshikar\t\tSuhas PalshikarIt is difficult to say whether the ongoing posturing over the Constitution is funny or tragic. In this year, when the Constitution entered the amrit moment — 75th year — there has been a lot of unfruitful manthan — churning — in the political arena over what our Constitution means and why we should protect it. Unfortunately, the noise generated does not seem to have led to any meaningful lessons for political players and citizens.Following the Bharat Jodo Yatra, the top leadership of the Congress went into overdrive over the “red book”. They attacked the ruling party for its violation and subversion of the Constitution and, to some extent, made it an election issue. While there is no evidence that voters were swayed away from the BJP because of this, at least the Constitution became a talking point. However, this initiative of the Congress was rather vacuous because the party did not convert it into a mass movement. In all probability, Congress workers continue to be clueless about the substantive import of this invocation of the Constitution. Cynically, this move was seen as an attempt to win over the Dalits — as if the Constitution mattered only to them.As the year comes to an end, the Prime Minister has paid back in the same coin of empty symbolism and harsh polemic, arguing that the Congress always subverted the Constitution. The small difference is that while Congress argued that the Constitution was being violated today, for the ruling party, the violations of yesterday matter the most. Isn’t this both funny and tragic?There seem to be three different ways in which the Constitution has come under attack. Right from the time of its commencement, criticism was offered that the Constitution was an alien document, that it was not Indian enough; more specifically, it was not based on the values of the Hindu society. Through the Seventies, when those offering this criticism realised the value of political/civil liberties, this criticism became somewhat muted. Today, even as the PM is extolling the values of the Constitution, criticism in the English language is gaining intellectual respectability. It argues that the Constitution exemplifies colonial legacy. So, it becomes a complicated question whether to be proud of what our forefathers drafted or to bring a rupture and build a new Constitution. The PM would have done better if he had clarified this. The urge for indigenous laws, ideas, interpretations and indeed for an indigenous founding document is expanding under his leadership in the judicial, legislative and academic universes. Is this funny or tragic?The second attack has been through practice. Unless those for whom the Constitution is drafted adopt a healthy respect for it and translate it into actual practice, it is bound to remain a mute idol. In India, even as the Preamble was recited in schools and colleges, we the people always gave short shrift to its objectives — liberty, equality, justice and, above all, fraternity. No wonder the government and its institutions often found ways of using the Constitution as an instrument of repressive control rather than reasoned regulation. If today the government is undermining the Constitution, it is due to the deep-rooted rejection of the idea of limited government. The last 75 years stand testimony to our penchant for sacrificing constitutional morality at the altar of the wisdom of rulers. This line of attack often invokes national interest, collective good, welfare, etc. to underplay the importance of constitutional morality.Against this backdrop, the third attack has often been through attempts to amend, change, reform, review — and now, Indianise the Constitution. In his speech in Parliament, the PM spoke of controversial amendments. If he meant the Emergency-era amendments, then most changes have been wisely undone subsequently. If the PM had the amendments from the late Sixties in mind — the 24th and 25th amendments for instance — then those have been corrected by the 1973 Kesavananda Bharati ruling.But as is customary these days, no analysis is complete without blaming Jawaharlal Nehru. PM’s attack too implied the mistake Nehru made in the matter of the First Amendment. While it is a political tragedy that a PM presiding over the most vicious application of existing laws targeting dissent should remind us of this, let us face Nehru’s mistake. Nehru’s mistake was that he was a child of the democratic movement which believed in the capacity of the power-holders to be constrained — it trusted their discretion and ability for self-regulation. Therefore, he sought to empower the state with a belief that democratic politicians will not trespass and also that institutional mechanisms will function against misuse. Both were misplaced.What needs to be learned from this mistake? One lesson could be the need to evolve political consensus on adequate protection for citizens from the state and ensure that unseemly effects of the First Amendment are undone. Since both the BJP and the Congress stand by the Constitution, that should not be difficult. Pending this, all parties can pledge that they will not harass dissenters, arrest citizens at the drop of a hat, oppose bail except when evidence or witnesses are likely to be tampered with, or unleash government agencies against opponents. Moreover, self-doubt rather than self-assurance should mark law-making and its implementation when there is a clash between state power and citizen rights.As for the government, lofty praise for the Constitution sits ill with a Chief Minister coming out in support of a judge who openly defied the Constitution. The criticism about amendments could not have come at a more inopportune moment when the government is set to fundamentally rewrite parts of the Constitution in its ambition to streamline the electoral cycle.While the contradictions in our political life between intent and rhetoric, claims and practices are indeed funny, it is only tragic that a solemn moment is transformed into theatrical exchanges rather than introspection.Above all, what we can learn from the experience of constitutional democracy over the last seven decades is that there can be tension between public sentiments (about what is right and wrong) and constitutional norms (of fairness). There is also tension between the ambition of rulers and the scope of what governments can legitimately do. In such moments, public sentiments and goals adopted by the rulers appear democratic and attractive but in the long run, unless the Constitution is adhered to, we run the risk of Bonapartism. That certainly is not funny.The writer, based in Pune, taught Political ScienceYou want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"R Ashwin: Off-spinner who extricated his craft from web of doosras, mystery deliveries","pic":"//images.indianexpress.com/2024/12/Ashwin-40.jpg?w=210","link":"https://indianexpress.com/article/sports/cricket/r-ashwin-offspinner-doosra-mystery-doosra-legacy-retires-9732501/","contents":{"image":"https://images.indianexpress.com/2024/12/Ashwin-40.jpg?w=640","text":"In the grand pantheon of India’s spinners, Ravichandran Ashwin would inhabit a rarified space, all unto himself. There have been wizards and magicians, artists and artisans, but few explored the craft with the zeal of a scientist, the curiosity of a child, or the industry of a sculptor like Ashwin. He was the greatest off-spinner his country has seen — and among the finest the world has produced, rubbing shoulders with Muttiah Muralitharan and Jim Laker, Harbhajan Singh and Ashwin’s own contemporary Nathan Lyon.His biggest legacy — apart from the numerical peaks — was how he re-instilled the lost mystique to the art form. He did not glamorise the field like Shane Warne did leg-spin, or romanticise it like Muralitharan, or revolutionise it like Saqlain Mushtaq, but he instilled the soul back in off-spin bowling, made it a riveting spectacle again, liberating it from the dubious doosra and mystery fixation of the aughts, expanded its scope and range, tessellated more layers, embellished it with post-modern syntax and diction. So much so that he is off-spin’s renaissance man. There would be a clear demarcation as to how off-spin was before and after Ashwin.He was a classicist in a neo-classical age; he was neo-classical among classicists too. He made connoisseurs purr with his enticing flight and devilish drop; off his marvellously dexterous digits, the ball side-spun and over-spun. He entrapped batsmen with both the simplest and complex set-ups. He evoked the envy of new-age spin tyros with his practised knack of flicking the ball with the index finger, in his expertise to use different grips. He bowled seam-up with as much dexterity as he deployed the square seam.No bowler possessed as many variations as Ashwin did since the departure of Shane Warne. On that scale, he was one of the game’s originals, an irreproducible act.He was the perfect Indian spinner, assembled with a fearful symmetry. He blended the grace of Bishan Singh Bedi with the guile of Erapalli Prasanna, the brain and heart of Anil Kumble and the chutzpah of Harbhajan. That he batted better than all of them and could barge into a team as an all-rounder was a dimension that the colossal shadow of his feats with the ball would overshadow.Facing Ashwin was akin to entering a labyrinth. There were variations within variations, snares within snares, subtleties within subtleties. Like Glenn McGrath, he often foxed the best batsmen of the visiting side. He consumed Joe Root seven times, Steve Smith eight and Kane Williamson on five instances. Left-handed virtuosos invoked the devil in him. Among his most prolific victims were Ben Stokes (12), David Warner (11), Alastair Cook (9) and Kumar Sangakkara four times in the space of 23 balls in the Sri Lankan’s farewell series.There was a ubiquity about the dismissals—bowling from around the stumps, drifting inwards, landing suddenly and deviously, a few metres behind the batsman’s presumptions, the kiss of the edge, the snap of the stumps. A heavy dose of them would comprise any highlight reel tribute.But Ashwin’s duels with right-handers were equally legendary. Two dismissals illustrate his command over his craft. One was Williamson in Kanpur in 2016, a ripping off- break from a good length area after a two-over tease of lengths. Another was the straighter one that nailed Smith in Adelaide in 2020, one that was plotted months in advance with video analyst Prasanna Agoram and polished to perfection in the intervening months.He rigorously studied batmen and dissected their flaws and strengths. Minute observations like Sangakkara doesn’t get LBW to off-spinners or that Smith is more vulnerable outside the off-stump than on his pads, despite the massive shuffle. He once explained his thought patterns to this paper: “My preparation is whether I can disturb the tempo of a batter. Whether Smith would go to off-stump after 10 balls or 12 balls. Or Joe Root, when you go round the stumps in the first eight balls, he would reverse you once. There are two ways of skinning it, do I want to stop Joe Root from reversing or do I want Root to reverse or get him out?”The deconstruction of a batsman doesn’t end here. “That will depend on where Root is in his career, how confident he is. Has he got a hundred in the first two Tests? Is he in confident space, is he coming from Sri Lanka after making mountains of runs? So I will try and make a plan because I want that early blood,” he explains.Some misconstrued this as overthinking. But Ashwin stuck to his essence. “I come from a school where even before a particular method is broken, I want to make sure I stitch it up and don’t get to a point where it’s broken. Why is it happening? That’s the question that people fail to recognise. I am addressing something before they believe I should address it,” he detailed.He constantly fiddled with his action, experimenting with release points, grips and seam position. He picked new tricks from spinners far younger, he kept his senses open to the game’s ceaseless evolution. He was content with his body of work, but kept the windows of perception open to add new dimensions.It was as though bowling spin was a spiritual, timeless quest. When he ambled in off his four-step stroll of a run-up, the arms whirling, the face a portrait of calm focus, he did not seem so much his country’s greatest ever match-winner with the red ball as a philosopher in a pursuit of the deepest meaning and purpose of his vocation.The journey produced exemplary moments, triumphs and victories. He is India’s second-highest wicket-taker in Tests, hauled the most player of the series awards in Tests, and collected the second-most five-wicket hauls in an innings after Muralitharan. The average (24) and strike rate (50) are the finest by any Indian spinner of any era, making him an immortal in Indian cricket. But his biggest legacy is that he got the soul back in off-spin bowling, at a time when it was mired in suspect actions and mystery-fixation, making it a riveting spectacle again. In the journey, he just happened to pick wickets.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"Goa Liberation DayWhy India waited for 14 years after independence to move troops to GoaSubscriber Only","pic":"//images.indianexpress.com/2023/12/goa-liberation-india.jpg?w=210","link":"https://indianexpress.com/article/explained/explained-history/goa-liberation-day-why-14-years-after-independence-9074903/","contents":{"image":"https://images.indianexpress.com/2023/12/goa-liberation-india.jpg?w=640","text":"On December 19, 1961, India annexed Goa in a quick military operation, after years of diplomatic efforts to secure its independence from Portugal failed.How was Operation Vijay conducted, and what was Operation Chutney? Why did India wait for 14 years before sending troops to Goa? Why has PM Modi blamed former Prime Minister Jawaharlal Nehru for not supporting Goa’s satyagrahis? We explain.Goa under the PortugueseGoa became a Portuguese colony in 1510, when Admiral Afonso de Albuquerque defeated the Sultan of Bjiapur, Yusuf Adil Shah. In 1947, when the rest of India became independent from the British, Goa, Dadra and Nagar Haveli and Daman and Diu continued as Estado da Índia, or the Portuguese states of India.However, an independence movement had been gaining ground here, in step with the liberation movement in the rest of the country. Tristão de Bragança Cunha, known as the father of Goan nationalism, founded the Goa National Congress at the Calcutta session of the Indian National Congress in 1928. In 1946, socialist leader Ram Manohar Lohia led a historic rally in Goa. Alongside these were groups, such as the Azad Gomantak Dal, who thought an armed resistance was the only way forward.After India’s independenceThe independence of India was accompanied with the trauma of Partition and the war in Kashmir. These two issues dominated the fledgling nation’s resources and its leadership’s attention for quite some time. Nehru, thus, was reluctant to start another confrontation in the west that would attract international attention, and preferred to secure Goa’s independence through negotiations and diplomacy.However, the dictator of Portugal, Antonio de Oliveira Salazar, refused to play ball. In fact, he went a step ahead to declare the India territories as not colonies, but overseas provinces, integral parts of ‘metropolitan Portugal’. Portugal by this time had joined the North Atlantic Treaty Organisation (NATO), and Salazar demanded that any military action by India be met with a NATO response.The government of India persisted with efforts at negotiations, through a diplomatic office it had established in Lisbon.In July-August 1954, Indian activists took over Dadra and Nagar Haveli, meeting with little resistance. This encouraged freedom fighters in Goa. A flashpoint came in August 1955, when thousands of satyagrahis tried to enter Goa but were fired upon by the Portuguese, resulting in 25 deaths.Ahead of the Goa elections last year, PM Modi had slammed Nehru for this. “Pandit Nehru felt that if he launched a military operation to oust the colonial rulers from Goa, his image as a global leader of peace would be impacted,” Modi said in Rajya Sabha on February 8, 2022. He also quoted from Nehru’s 1955 Independence Day speech, accusing him of not supporting satyagrahis.It is true that Nehru in his speech had warned satyagrahis against violent action.“Goa is a part of India and nobody can separate it…We have exercised great self-control because we want that this issue should be solved peacefully… Let no one be under a misconception that we are going to take military action… Those who are going into Goa are welcome to do so, but if they call themselves satyagrahis, let them remember the principles of satyagraha—and behave accordingly. Armies do not march behind satyagrahis,” Nehru said.However, after the firing on satyagrahis, India did break off diplomatic relations with Portugal.Military actionIf Nehru was so firm on not sending in troops, what changed his mind in a matter of six years? First, because there had been no forward movement from Portugal’s side despite years of consistent Indian efforts. Second was the fact that African nations also under Portuguese colonial rule wanted India to expedite the liberation of Goa.Finally, in 1961, preparations for an armed attack on Goa began in full swing.Venkataraghavan and Subha Srinivasan, in their book ‘The Origin Story of India’s States’, write that the final trigger for military action was the Portuguese firing on an Indian steamer from Anjadip.“On 1 December, India began a surveillance and reconnaissance exercise called Operation Chutney. Two frigates began to patrol the coast of Goa, and the Indian Navy mobilised sixteen ships, divided into four task groups. The Indian Air Force (IAF) began flights to lure any Portuguese fighter jets to reveal their positions. The Indian Army stationed troops around the borders of Goa, Daman and Diu. The army would lead Operation Vijay to liberate Goa, and the navy and the air force would support it.”Military action began on December 17, and victory was swift. On the evening of December 19, Governor-General Vassalo e Silva surrendered — Goa and Daman and Diu had been liberated. Over 400 years of Portuguese rule in India had finally ended.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.Raj Kapoor @ 100: The showman whose magic dazzles usSubscriber OnlyHindi cinema's best to worst in 2024Subscriber OnlyHow One Hundred Years of Solitude turned into a screenplayHow raagas can heal: A life in music and memoriesSubscriber OnlyBandish Bandits Season 2 review: No straggly spots, only theBhupen Khakhar made a virtue of painting pain, he sufferedSubscriber OnlyThe Lord of the Rings The War of the RohirrimWhy not replace car horns with bird sounds?Subscriber OnlyHeretic movie review: Hugh Grant elevates A24 horror film Yashee is an Assistant Editor with the indianexpress.com, where she is a member of the Explained team. She is a journalist with over 10 years of experience, starting her career with the Mumbai edition of Hindustan Times. She has also worked with India Today, where she wrote opinion and analysis pieces for DailyO. Her articles break down complex issues for readers with context and insight.\n\nYashee has a Bachelor's Degree in English Literature from Presidency College, Kolkata, and a postgraduate diploma in journalism from Asian College of Journalism, Chennai, one of the premier media institutes in the countr\n\n                         ... Read More \n                Actor Devoleena Bhattacharjee and her husband Shanawaz Shaikh announced the arrival of their baby boy on December 18 on Instagram. The couple received an outpouring of love and congratulations from fans and friends in the industry.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"Is coconut oil an edible oil or a haircare product? Here is what SC ruled","pic":"//images.indianexpress.com/2024/12/coconut-oil-gst.jpg?w=210","link":"https://indianexpress.com/article/explained/explained-law/coconut-oil-edible-haircare-sc-gst-9733784/","contents":{"image":"https://images.indianexpress.com/2024/12/coconut-oil-gst.jpg?w=640","text":"Is coconut oil an edible oil or a haircare product under India’s tax regime? This question has passed through various levels of the judiciary without a clear answer for over 15 years – until the Supreme Court on Wednesday (December 18) finally held that it should be classified as an edible oil and taxed at a lower rate.Under the Goods and Services Tax (GST) regime introduced in 2017, edible oils are taxed at a lower rate (5%) than hair care products (18%). How has the taxation of coconut oil evolved in recent years? And why did the Supreme Court classify it as an edible oil?Prior to the GST regime, excise duty on coconut oil was applied under the Central Excise Tariff Act, 1985 (CET Act). In 2005, the CET Act was amended and coconut oil carried an 8% excise duty and was specifically included under Section III titled “Animal or Vegetable Fats and Oils and their Cleavage Products; Prepared Edible Fats; Animal of Vegetable Waxes”. This was in contrast to goods for “Preparations for use on the hair”, which carried a 16% excise duty under a Section VI titled “Products of the Chemical or Allied Industries”.These were in line with international norms for classifying products for taxation introduced by the World Customs Organisation in 1988, called the Harmonised System of Nomenclature (HSN).The Central Board of Excise and Customs, under the Ministry of Finance, which in the SC’s words was “conscious of the effects of the amendments made by the Act of 2005 (CET Act)”, issued a circular in June 2009 to classify coconut oil sold in small containers (less than 200 ml) as hair oil so that it could be taxed at the higher 16% rate.However, the SC’s decision recalls that this circular was withdrawn in October 2015 in view of decisions from tribunals and courts stating “just because the retail packs of coconut oil were in sizes of 200 ml or less, the same could not be presumed to be meant for use as hair oil”.Since 2017, with the introduction of the new GST regime of taxation, coconut oil carries are taxed at a 5% rate whereas products under the “Preparations for use on the hair” category carry a 18% tax.The case before the SCEven before the 2009 circular was issued, Central Excise authorities in 2007 issued several show-cause notices to Madhan Agro Industries (India) Pvt. Ltd., which sold coconut oil in packets ranging from 5 ml to 2 litres. The notices proposed imposing a higher taxation rate on coconut oil, classifying it as a hair oil product. Madhan Agro challenged this move before the Customs Excise and Service Tax Appellate Tribunal (CESTAT) in Chennai, which held that coconut oil was an edible oil and not a hair care product, following the 2005 amendment to the CET Act.The CESTAT in Chennai also passed similar orders in challenges to similar show-cause notices sent to M/s. Aishwarya Industries, M/s. Moreshwar Industries, M/s. Shivam Enterprises and M/s. Sowparnika Enterprises, all located in Puducherry, which produce coconut oil in small containers. The Commissioner of Central Excise, Salem, then challenged these orders before the SC.The SC’s decisionIn 2018, Justices Ranjan Gogoi and R Banumathi delivered a split verdict in the challenge. Justice Gogoi held that coconut oil should be classified as edible oil regardless of the package size. Justice Banumathi on the other hand, applied the “Common Parlance Test” and held that coconut oil sold in small packages is “understood in the market by dealers/consumers as ‘Hair Oil’” and must be taxed as such.The case remained pending until the SC’s decision on Wednesday.A bench comprising Chief Justice of India Sanjiv Khanna, Justice Sanjay Kumar and Justice R Mahadevan held that the headings specifically provided under the law — in line with international HSN norms — “cannot be ignored while classifying goods”. It also rejected the application of the common parlance test to determine the commonly accepted meaning and use of coconut oil in the market, stating this could only be applied “when a product is not clearly defined or specifically dealt with” under the law.The court also held that “The mere fact that coconut oil is also capable of being put to use as a cosmetic or toilet preparation, by itself, would not be sufficient to exclude such oil from the ambit of ‘coconut oil’ and subject it to classification as ‘hair oil’”. On the size of the container, the court held that “Small-sized containers are a feature common to both ‘edible oils’ as well as ‘hair oils’. Therefore, there must be something more to distinguish between them for classification of such oil… other than the size of the packing”.It also noted that “the Standards of Weights and Measures (Packaged Commodities) Rules, 1977, provide that ‘edible oil’ can be packed in specified sizes of 50 ml, 100 ml, 200 ml, 500 ml, 1 litre or 2 litres”.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.Indian cricketer R Ashwin has announced his retirement from international cricket after the third Test against Australia. The decision came as a surprise during the high-profile series. Ashwin, who returned to Chennai to a warm welcome, stated that he will continue to play for CSK and aspire to play for as long as he can.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"5 militants killed, 2 Army soldiers injured in encounter in Jammu and Kashmir","pic":"//images.indianexpress.com/2024/12/Kashmir-encounter.jpg?w=210","link":"https://indianexpress.com/article/india/jammu-and-kashmir-kulgam-encounter-militants-army-9733523/","contents":{"image":"https://images.indianexpress.com/2024/12/Kashmir-encounter.jpg?w=640","text":"At least five militants were killed and two Indian Army personnel injured in a gunfight in an orchard in South Kashmir’s Kulgam on Thursday.The Jammu and Kashmir Police said while they have located the bodies of the five militants, they are yet to recover them, and their identity can be ascertained only later.Officials said a joint team of J-K Police and Army cordoned off the Kadder village in South Kashmir’s Kulgam after the inputs about the presence of militants in the area. The police said as they were zeroing in on the target, the hiding militants rushed out of a house, fired indiscriminately on the forces and tried to break the security cordon. The joint team of the security forces retaliated leading to a gunfight.Police sources said they had inputs about the presence of four to five militants in the village. They added that they are yet to recover the militants’ bodies but they are most likely the locals.This is the second major gunfight in Kulgam this year. On July 8, six militants and two soldiers were killed in two separate gunfights in the district.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed. Bashaarat Masood is a Special Correspondent with The Indian Express. He has been covering Jammu and Kashmir, especially the conflict-ridden Kashmir valley, for two decades. Bashaarat joined The Indian Express after completing his Masters in Mass Communication and Journalism from the University in Kashmir. He has been writing on politics, conflict and development. Bashaarat was awarded with the Ramnath Goenka Excellence in Journalism Awards in 2012 for his stories on the Pathribal fake encounter.                        ... Read More \n                OpenAI's ChatGPT has made a big update on its 10th day of announcement, allowing users in the US and Canada to access it on flip and landline phones by dialing 1-800-CHATGPT for 15 minutes per month. This feature does not require an account or subscription and offers a natural language voice exchange experience. Other countries can access ChatGPT on WhatsApp by texting 1-800-242-8478.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"Andhra PradeshRed flags after SECI says Azure capacity given to Adani in public interest","pic":"//images.indianexpress.com/2024/12/adani.jpg?w=210","link":"https://indianexpress.com/article/india/red-flags-in-andhra-after-seci-says-azure-capacity-given-to-adani-in-public-interest-9733178/","contents":{"image":"https://images.indianexpress.com/2024/12/adani.jpg?w=640","text":"A SUBMISSION by Solar Energy Corporation of India (SECI), a Central government undertaking, to the apex electricity regulator that the transfer of 2,300 mega watt solar capacity from Azure Power to Adani Green Energy was made in larger “public interest” has raised red flags in the new Andhra Pradesh government led by TDP’s N Chandrababu Naidu.Sources in the state government said while there were no provisions either barring or allowing such transfer of power capacity in the 2019 tender, the question was what comprised “public interest” in the transfer to Adani. “Couldn’t it have been bid out to some other company, particularly since SECI had already tied up sale of solar power being generated,” said a source, who did not wish to be named.The Central Electricity Regulatory Commission, the apex regulatory body for the power sector, had asked SECI on October 28 this year if the transfer of power capacity from Azure Power to Adani Green Energy was allowed under the tender floated in 2019.In response, SECI told the regulator that the transfer was made in larger “public interest” as the Andhra Pradesh government was “keen on (capacity) being made available”.The transferred capacity was part of the 12,000 MW solar tender floated by SECI in 2019, which is now under scrutiny for bribery as alleged by the Securities and Exchange Commission, the capital market regulator in the US.SEC had alleged that the capacity transfer was in lieu of bribery payments made by the Adanis on Azure’s behalf as part of the $265 million bribery scheme involving state government officials.The SEC had alleged that Azure’s share of the bribe to be paid or paid to state government officials was one-third of $265 million.The Adani Group has denied these allegations as baseless. SECI and CERC did not respond to queries mailed by The Indian Express.In its filings to the US prosecutors, SEC said, “The end result of these maneuvers—Azure’s withdrawal from and forfeiture of a substantial portion of the Manufacturing Linked Projects and Adani Green’s takeover of nearly all of that portion of the projects—was that Azure transferred significant value to Adani Green, Gautam Adani, and Sagar Adani in partial satisfaction of Azure’s share of the bribes that Gautam Adani and Sagar Adani had paid or promised.”The Solar Energy Corporation of India had in separate submissions to the power regulator on December 6 and December 11, said that the transfer of Azure’s capacity to Adani Green was “not prohibited” and that “there is nothing wrong with adopting the process if it is in public interest,” according to documents accessed by The Indian Express.“These are commercial decisions which SECI is entitled to do within the approval already taken so long there is no arbitrariness, unfairness and there is public interest in doing so,” SECI said. In turn, SECI awarded the surrendered capacity to Adani Green as “it became necessary to consider the salvaging of the capacity”.“This was particularly when APDISCOMs and Government of Andhra Pradesh were keen on such 2,333 MW being made available and Adani was willing to undertake the additional capacity on the same tariff terms and conditions except commissioning schedule of the projects,” it said in filings.While there is no specific provision for transfer of capacities prior to commissioning in the tender document, SECI submitted to CERC that “it has acted within the power of the person initiating the competitive bidding process” to carry out the transfer. “It is a settled principle of law that if a thing is not prohibited, there is nothing wrong with adopting the process if it is in public interest,” it said.In November, US prosecutors had indicted the Adani Group’s chairman Gautam Adani, his nephew Sagar Adani, and six others for offering Rs 2,029 crore (US $265 million) in bribes to officials in Andhra Pradesh state government.The bribes were allegedly made after SECI was unable to sign power sale agreements (PSAs) with state discoms.After the tender was awarded, SECI had to sign PSAs with state DISCOMs, without which it could not sign power purchase agreements (PPAs) with Adani Green and Azure. US prosecutors have alleged that “SECI’s inability to find purchasers jeopardized the lucrative LOAs (letter of awards), and corresponding revenue” that was anticipated by the two companies. According to SEC’s filing, the PPAs were executed by SECI “only after Adani Green’s senior executives, Gautam Adani and Sagar Adani, undertook a massive bribery scheme to incentivize Indian state government officials to enter into contracts with SECI to buy energy at above market rates”.SEC noted that Gautam Adani personally met with the Chief Minister of Andhra Pradesh in August 2021, and “at or in connection with that meeting, Gautam Adani paid or promised a bribe to Andhra Pradesh government officials to cause the relevant Andhra Pradesh government entities to enter into Power Supply Agreements with SECI for the purchase of 7,000 MW of power capacity”.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed. Aggam Walia is a Correspondent at The Indian Express, reporting on power, renewables, and mining. His work unpacks intricate ties between corporations, government, and policy, often relying on documents sourced via the RTI Act. Off the beat, he enjoys running through Delhi's parks and forests, walking to places, and cooking pasta.                        ... Read More \n                OpenAI's ChatGPT has made a big update on its 10th day of announcement, allowing users in the US and Canada to access it on flip and landline phones by dialing 1-800-CHATGPT for 15 minutes per month. This feature does not require an account or subscription and offers a natural language voice exchange experience. Other countries can access ChatGPT on WhatsApp by texting 1-800-242-8478.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"Fearing backlash, Govt rethinks proposal for default cornea donation for all in-hospital deaths","pic":"//images.indianexpress.com/2024/12/Eye-care_759.jpg?w=210","link":"https://indianexpress.com/article/india/cornea-donation-notto-mulls-presumed-consent-for-donors-9733220/","contents":{"image":"https://images.indianexpress.com/2024/12/Eye-care_759.jpg?w=640","text":"Fearing pushback, the country’s apex organ transplant regulator is looking at alternative mechanisms to the opt-out method being examined earlier for cornea donation, under which those who die at hospitals would be presumed to be a donor unless stated otherwise, according to officials in know of the matter.Now, the National Organ and Tissue Transplant Organisation (NOTTO) is looking at whether consent can be presumed at least for those who have already signed up as donors on its new Aadhaar-linked national registry.At the moment, even if a person registers on India’s organ donor registry, it is not legally binding, and hospitals have to seek consent from family members for any organ donation, including cornea.“There were discussions underway to see how to increase cornea donation and what provisions in the law would need to be changed. The opt-out method was suggested by experts, but there is likely to be a pushback. People are very sensitive about donating their cornea, sometimes even more than other organs,” said an official.“Now, alternative mechanisms are being looked into such as consent being presumed in cases where people have registered as donors on the national portal. People have to register with their Aadhaar, so technically they have already given their consent,” the official said.While there has been an organ donation registry in the country for nearly a decade, a person had to carry the registration card to let hospitals know their wish.  Last year, the government launched an Aadhaar-linked registry to create a verifiable database that even hospitals can access to check if a patient is a registered donor.  More than 2 lakh people have registered as organ donors on this new portal — nearly 52% of them are men, and nearly 44% are aged between 30 years and 45 years.But even if a person registered on the national organ donation registry, the Human Organ and Tissue Transplantation Act would need to be amended to allow donations without the requirement of the family’s consent.The official said that several changes to the law are being looked into by a group of experts, including from the legal domain.The move is aimed at increasing the availability to corneas or the dome-shaped front layer of the eye.“While a complete opt-out method may be difficult to implement, easing some of the norms will help in increasing cornea donations. And these regulations may later be adopted for other organs as well if it works well for corneas,” the official said.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed. Anonna Dutt is a Principal Correspondent who writes primarily on health at the Indian Express. She reports on myriad topics ranging from the growing burden of non-communicable diseases such as diabetes and hypertension to the problems with pervasive infectious conditions. She reported on the government’s management of the Covid-19 pandemic and closely followed the vaccination programme.\n\nHer stories have resulted in the city government investing in high-end tests for the poor and acknowledging errors in their official reports.\n\nDutt also takes a keen interest in the country’s space programme and has written on key missions like Chandrayaan 2 and 3, Aditya L1, and Gaganyaan.\n\nShe was among the first batch of eleven media fellows with RBM Partnership to End Malaria. She was also selected to participate in the short-term programme on early childhood reporting at Columbia University’s Dart Centre. Dutt has a Bachelor’s Degree from the Symbiosis Institute of Media and Communication, Pune and a PG Diploma from the Asian College of Journalism, Chennai. She started her reporting career with the Hindustan Times.\n\nWhen not at work, she tries to appease the Duolingo owl with her French skills and sometimes takes to the dance floor.                        ... Read More \n                Indian cricketer R Ashwin has announced his retirement from international cricket after the third Test against Australia. The decision came as a surprise during the high-profile series. Ashwin, who returned to Chennai to a warm welcome, stated that he will continue to play for CSK and aspire to play for as long as he can.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"UPSC Essentials Brain-rot, Maori haka, Blood money: Terms from 2024 that aspirants must note down","pic":"//images.indianexpress.com/2024/12/Untitled-design78.jpg?w=210","link":"https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/brain-rot-maori-haka-top-24-terms-2024-yearender-aspirants-upsc-2025-9732327/","contents":{"image":"https://images.indianexpress.com/2024/12/Untitled-design78.jpg?w=640","text":"Which are the most popular keywords of 2024? From brain-rot and demure to  Keffiyeh and Black coat syndrome, here’s our pick from what trended and remained relevant for UPSC aspirants.No, it isn’t related to cryptocurrency! Cryptosporidium or Crypto, belongs to the coccidia group of protozoan parasites that can reproduce sexually and asexually. The UK Health Security Agency (UKHSA) reported 22 confirmed cases of cryptosporidiosis, a waterborne disease. The infection is caused by a parasite found in stool and can be contracted by consuming contaminated food or water.It is an initiative to achieve Nobel Peace Laureate Professor Muhammad Yunus’s vision of creating a world of three zeros—zero net carbon emission, zero wealth concentration for ending poverty, and zero unemployment by unleashing entrepreneurship in all. The mission of the 3ZERO Club is to inspire and enable the youth to ideate, create, and lead with an entrepreneurial spirit to solve the most pressing social and environmental issues of our time.The Oxford University Press (OUP) has picked Brain-rot as its “Word of the Year” for 2024. Brain-rot is the supposed deterioration of a person’s mental or intellectual state, especially viewed as the result of overconsumption of material (now particularly online content) considered to be trivial or unchallenging.4B stands for four bis, or no in the Korean language: bihon, bichulsan, biyeonae, and bisekseu, meaning the refusal of (heterosexual) marriage, childbirth, romance, and sexual relationships, respectively. The movement started in South Korea around 2016. In the aftermath of Donald Trump’s victory, many American women took to social media to announce that they are adopting it in their lives. The term “peak oil” used to mean the point when global production would top out, before entirely running out. ‘Operation Indravati’ was launched by the Indian government in March to evacuate its citizens from the turmoil-stricken Haiti to the neighboring Dominican Republic. Haiti, situated in the Caribbean, has plunged into chaos with armed gangs seizing control of the streets, resulting in the virtual disappearance of the government.Maori Haka became a trending topic when Hana-Rawhiti Maipi-Clarke, a 22-year-old Maori Party MP of New Zealand, performed it in parliament in protest of a contentious Bill. Haka is a traditional dance of Maori people which is usually performed in a group and involves chanting, dramatic facial gestures, hand movements, and stamping the feet. It also served as a means of storytelling, a way to express communal grievances, celebrate triumphs, or honour ancestors. 4E Wave movement is a student-led national movement for energy conservation that originated from students at the Government College of Engineering & Technology (GCET), Jammu. It is a youth-led initiative committed to advancing the principles of Eco-friendliness, Economy, Education, and Empowerment (4Es) in the realm of energy conservation and sustainability.Keffiyeh is a traditional headdress worn across the Middle East. In recent decades, they have come to be identified as a symbol of Palestinean identity and resistance. Recently, Pulitzer Prize-winning author Jhumpa Lahiri declined to accept an award from New York City’s Noguchi Museum Wednesday after it sacked three employees for wearing ‘keffiyeh’.Cyber slavery refers to a situation where an individual is allegedly held against their will and forced to carry out cyber fraud. Indian authorities have said that cyber slavery is an emerging and alarming form of modern-day trafficking. Individuals are coerced or trafficked into committing online scams for organised criminal networks under duress. This growing cybercrime exploits vulnerable people, trapping them in illegal activities and online frauds. A “Digital Arrest” scam involves fraudsters impersonating law enforcement via video calls, threatening fake arrests to extort money. The criminals, who often use pictures or identities of police personnel to convey authenticity, usually demand money from the target for a ‘compromise’ and closure of the case. In certain cases, the victims are “digitally arrested”, and forced to stay visible over Skype or other video conferencing platforms to the criminals until their demands are met.The Punganur is an indigenous breed native to the Punganoor, Vayalapadu, Madanapalli, and Palamaneer talukas of the Chittoor district of southern Andhra Pradesh. They are a unique dwarf breed, considered the shortest-humped cattle in the world. On the occasion of Pongal/ Makar Sankranti, Prime Minister Narendra Modi offered green fodder to a group of about six cattle belonging to the Punganur Breed.It is a coffin-sized, air-tight machine designed by Exit International. It is used for euthanasia in Switzerland. It consists of a 3D-printed detachable capsule placed on a stand with a canister of liquid nitrogen. A person lying inside it could press a button to initiate the dying process, flooding the air inside it with nitrogen gas.India launched Operation “Sadbhav” to provide aid and urgent supplies to Vietnam, Laos, and Myanmar, which are grappling with the devastating effects of Typhoon Yagi. As part of Mission Sadbhav, India has sent 10 tons of aid, including dry rations, clothing, and medicines, to Myanmar aboard the Indian naval ship INS Satpura.HFC-23, also known as trifluoromethane, is produced during the manufacture of a common refrigerant gas called HCFC-22, belonging to the hydrochlorofluorocarbon family. HFC-23 has 14,800 times more potential to cause global warming as compared to carbon dioxide. The Nature study found that about 68 per cent of the credits generated in HFC-23 abatement projects that the researchers reviewed had led to actual emissions reductions. The RBI has joined Project Nexus, a multilateral international initiative to enable instant cross-border retail payments by interlinking domestic Fast Payments Systems (FPSs). It is conceptualised by the Innovation Hub of the Bank for International Settlements (BIS). Constitutional Autochthony refers to the fact that a constitution is, legally speaking, “homegrown” or rooted in native soil. This political science term implies that the constitution’s authority and validity come from local legal factors, not from a foreign legal process thus asserting its constitutional independence. The online dictionary platform Dictionary.com has officially announced “demure” is its 2024 Word of the Year. Being demure represents a mindful, understated demeanour—being thoughtful, present, and intentionally cutesy without overdoing it.Cambridge Dictionary has declared ‘manifest’ as its word of the year for 2024, highlighting the growing influence of the concept in popular culture and beyond. It is defined as “to use methods such as visualisation and affirmation to help you imagine achieving something you want, in the belief that doing so will make it more likely to happen”.Blood money or diyya is a concept in Islamic law where victims of crimes have a say in how criminals are to be punished. In the case of murder, this principle applies to the families of victims. Although murder is punished via the death penalty, the victim’s family (specifically, heirs) may choose to “forgive” the murderer in exchange for monetary compensation. This monetary compensation is blood money.It is described as the fear and alienation experienced by marginalized communities in their interactions with the legal system, fearing the financial and mental strain due to the prolonged judicial process. It is analogous to the “White Coat Hypertension”.FOMO, or Fear of Missing Out, refers to the anxiety that is experienced when someone misses out on a social gathering with people that they really care about. It’s this sort of sinking, creeping feeling that people are bonding without us, and we have somehow missed that. Google Doodle celebrated the Tari Rangkuk Alu, a dance genre from Manggarai, Indonesia on April 29, 2024. This dance style originates from the traditional Rangkuk Alu game in Manggarai, which involves maneuvering through a moving bamboo grid.It refers to the growing tendency of companies, organisations, or even countries to make dubious or unverifiable claims about their activities, products, or services being environment-friendly or climate-friendly. Greenwashing presents a false picture of the progress being made on the climate change front, thereby pushing the world towards disaster, while at the same time rewarding entities for irresponsible behaviour.Post ScriptDear Readers,Our UPSC Current Affairs Pointers was launched to provide you with important current affairs from The Indian Express that are relevant for your Prelims and Mains preparation. We remain committed to supporting you in this journey, and your positive feedback is always welcome. Stay tuned for UPSC Current Affairs Pointers every Monday in the UPSC Essentials of The Indian Express. Let’s welcome 2025 with optimism and be ready to seize new opportunities.Happy New Year!For your queries and suggestions write at khushboo.kumari@indianexpress.comThe Indian Express UPSC Essentials brings to you the December issue of its monthly magazine. Click Here to read. Share your views and suggestions in the comment box or at manas.srivastava@indianexpress.comSubscribe to our UPSC newsletter. Stay updated with the latest UPSC articles by joining our Telegram channel – IndianExpress UPSC Hub, and follow us on Instagram and XYou want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.Karnataka High Court rules against quashing criminal proceedings for not reporting an offence under POCSO, as mandated by Sections 19 and 21. Case involves sexual assault of minor student at madrasa, where trustee was booked for failure to report.Read UPSC MagazineThis No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"Is the viral Parkinson's Challenge Finger Test accurate?","pic":"//images.indianexpress.com/2024/11/brain_600_freepik-2.jpg?w=210","link":"https://indianexpress.com/article/lifestyle/health/fact-check-viral-parkinsons-challenge-finger-test-actually-work-9685674/","contents":{"image":"https://images.indianexpress.com/2024/11/brain_600_freepik-2.jpg?w=640","text":"Can you really test your risk for developing Parkinson’s disease? Well, if some social media posts are to go by, you can with the help of the Parkinson‘s Challenge Finger Test.“Please ask adults over 50 years to perform this test to check their 10-year risk of getting Parkinson’s disease,” said Dr Siva Sundar, general medicine, demonstrating the practice along with his mother.The finger test, first demonstrated by neurosurgeon Dr Arun L Naik, requires one to be able to lock the index and middle finger of each hand, then touch the ring finger and thumb together while flapping the little finger for at least 60 times in 30 seconds.Dr Pawan Ojha, director, neurology, Fortis Hiranandani Hospital, Vashi contested that the finger test, which according to the video can predict the risk of Parkinson’s disease over 10 years, is not accurate. “Parkinson’s disease does not simply entail a slowdown of body movement, it has a host of other symptoms too, such as tremors in the limbs, difficulty in walking, postural instability resulting in sudden falls, speech, cognitive and sleep disturbances. Hence to diagnose this condition a comprehensive test is needed, and the finger test is not comprehensive at all, as it relies solely on one symptom i.e slowdown of movements,” said Dr Ojha.Dr Sudhir Kumar, consultant neurologist, Apollo Hospitals, Hyderabad too mentioned that this test can not predict the future risk of Parkinson’s disease. “In fact, there is no clinical test that can predict the risk,” added Dr Kumar.The finger-tapping test is part of a more comprehensive tool (PREDICT PD, published in 2014) aimed at predicting Parkinson’s disease in Western countries. “PREDICT PD is an online test (including family history, non-motor symptoms, and lifestyle factors), a keyboard-tapping task and a Smell Identification Test. One of the components of this test is the distal finger-tapping test,” said Dr Ojha.  A post shared by Dr Arun L Naik MCh (@doclogues)However, it’s important to note that the version of the distal finger-tapping test used in the Predict PD program differs from the one shown in the video. According to Dr Ojha, the Predict PD program deploys the keyboard tapping test, where individuals are asked to tap a keyboard for 30 seconds, those with Parkinson’s will be less coordinated and slower than those without the condition. “Slowness is a common symptom associated with a lot of health conditions like arthritis, stroke, neuropathy, and muscle weakness,” said Dr Ojha.Another test — PREDIGT — also incorporates genetic studies, such as identifying mutations in DNA. “Data is continuously being collected to improve these predictions over time. Therefore, one should avoid rushing to take the test shown in this video to assess one’s risk of Parkinson’s disease, as it could lead to confusion and unnecessary fear among the general public. Instead, one might consider taking the online survey PREDICT PD to understand the predisposition for Parkinson’s disease. It should however be followed by a visit to a neurologist for verification of diagnosis and treatment if necessary,” said Dr Ojha.DISCLAIMER: This article is based on information from the public domain and/or the experts we spoke to. Always consult your health practitioner before starting any routine.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.The Indian government launched a 100-day campaign to intensify the fight against tuberculosis, resulting in 6,267 new cases being detected. More than 5 lakh people have been screened, with a focus on vulnerable populations in 347 high-risk districts.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"Health and WellnessHow high BP patients found their real triggers","pic":"//images.indianexpress.com/2024/12/Untitled-design-39-4.jpg?w=210","link":"https://indianexpress.com/article/health-wellness/high-blood-pressure-patients-triggers-kidney-blockage-sleep-apnea-9733359/","contents":{"image":"https://images.indianexpress.com/2024/12/Untitled-design-39-4.jpg?w=640","text":"I see many patients with stubborn blood pressure (BP) every other day but let me discuss two case studies so that we understand why it can spin out of control sometimes. The other day a 60-year-old man complained of a sudden increase in BP readings he had recorded over two weeks. He had more than three medicines to control it but had difficulty keeping it down to the normal range of 130/80 mmHg. The other patient was much younger, may be in his 30s, who complained of similar conditions. The first was a heavy smoker and diabetic, the second was unhealthily overweight.Both of them were suffering from a condition where your blood pressure remains high despite the medication you take to control or lower it. This is called resistant hypertension, which results in a higher risk of stroke, kidney disease and heart failure.The 60-year-old had a history of high blood pressure, was a smoker and diabetic, which already made him prone to hypertension and heart disease. Given his uncontrollable readings, we admitted and monitored him. However, despite infusions, his BP did not settle. Suspecting an underlying condition, which is often called the secondary cause of resistant hypertension, we did some more tests. The good news is that once you identify the secondary cause, the condition is reversible.We did a renal artery doppler (ultrasound) and found that he was suffering from renal artery stenosis, where one or more arteries that carry blood to your kidneys narrow and prevent oxygenated blood from reaching them. The kidneys respond by releasing hormones, which tell the body to hold on to more salt and water, increase blood volume and elevate BP. Suspecting coronary artery disease, as happens in such cases, we did an angiography (which images blood vessels) of both the kidney and the heart and found blockages. Stenting was done for both renal and a heart artery. Once blood flow was restored with these procedures, his BP normalised.The 30-plus patient, too, had resistant hypertension because of a secondary trigger called sleep apnea, a disorder that disrupts breathing during sleep. As oxygen levels in the blood drop suddenly as a result, the body constricts blood vessels and releases hormones, which increase blood pressure. The heart has to pump harder than usual. His BP levels came down too on treating the source of the problem.The point is other than known co-morbidities, there are other triggers for BP, like those mentioned above, overproduction of adrenal hormones like cortisol, hyperactive or underactive thyroid, even cysts and tumours in the kidneys. Resistant hypertension can complicate body conditions in 20 per cent patients but people might be experiencing it for years without knowing. That’s because it hardly manifests itself except for some chest tightness or some headaches.That’s why it is important to monitor your BP regularly, more so when you have co-morbidities. You require long-term medication or a higher dose as your body needs it to control blood pressure at an optimum level.(Dr Tickoo is Director, Internal Medicine, Max Superspeciality Hospital, Delhi)You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.Former CM Baghel appeals to government for caution after children injured in crossfire between security forces and Maoists in Chhattisgarh. He questions the encounter and urges government to take responsibility for innocent tribal people caught in the crossfire.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"SponsoredUnwrap Joy This Christmas with Amazon.in’s Holiday Toy List","pic":"//images.indianexpress.com/2024/12/LEAD_b70aa4.jpg?w=210","link":"https://indianexpress.com/article/branded-content/unwrap-joy-this-christmas-with-amazon-ins-holiday-toy-list-9729773/","contents":{"image":"https://images.indianexpress.com/2024/12/LEAD_b70aa4.jpg?w=640","text":"The holiday season is an exciting time when it comes to finding the perfect toys for your little ones. Amazon India’s 2024 Holiday Toy List features a thoughtfully curated selection of exciting, educational, and entertaining toys that will surely bring smiles to kids of all ages. Whether it is nurturing imagination, critical thinking, or STEM skills, this collection ensures a holiday filled with joy and memorable moments. \n\nBe it a curious toddler or a fun-loving teenager, this year’s toy collection blends fun with learning for everyone. To make the season even more exciting, enjoy incredible savings of up to 80% on all toys, along with additional discounts through special bank offers. Unlock an extra 10% off with SBI credit cards, convenient EMI options from HDFC Bank, and exclusive offers from Federal Bank. Here are the top picks from the Amazon Holiday Toy List 2024 for your children:Artistic Adventures Creativity takes center stage with the Imagimake Spin n Pop Beads Studio, perfect for children aged 8-12. This electric bracelet maker ignites creativity while helping to enhance fine motor skills. While designing over 25 unique accessories, kids can craft stylish jewelry for themselves or create personalized gifts for friends and family. Wheels of Wonder The Popsugar Off Roader Remote Control Car is the ultimate toy for all young adventurers and thrill-seekers. Designed to enhance hand-eye coordination and spatial awareness, this rechargeable monster truck comes with two speeds and four headlight modes, setting the stage for action-packed play. It promises endless fun for kids aged 6 and above, whether they’re racing indoors or exploring outdoors. Cuddly Companions Sometimes, a cuddly companion is the best gift kids can have, and the Niku Rabbit with Chain delivers on both cuteness and play potential. This reversible bunny that transforms into a strawberry or carrot, is perfect for imaginative play. Not only does it bring comfort, but also encourages kids to form emotional bonds and develop their creativity. This delightful toy is a hit for younger kids who enjoy soft and interactive playmates.Doll Delights Your kids’ imagination will know no limits with the Barbie Dreamhouse Pool Party Doll House. This 3-story dollhouse, packed with over 75 accessories—including a slide and pet areas—offers countless possibilities for role play and storytelling. For all the Barbie fans aged 3 and above, it not only encourages children to create their own stories but also practice social interactions and fuel their creativity. With every detail designed to inspire, this dreamhouse provides a world of fun and learning in one exciting playset.Early Learning Essentials The Shumee Handmade 5-in-1 Wooden Activity Triangle is a Montessori-inspired toy with numerous developmental benefits for children aged 2 and older. The colorful and engaging toy presents a variety of activities designed to teach essential skills such as the alphabet, counting, and fine motor development to small kids. Its playful design not only captures children’s attention but also helps enhance cognitive skills, providing a fun and educational experience that supports early learning in a meaningful way.Outdoor ExcitementAs children navigate their journey, they not only enjoy the thrill of driving but also develop a sense of independence. The Baybee Bronco Battery Operated Jeep is the perfect ride-on toy for young adventurers. Designed for kids aged 3-8, this thrilling jeep brings excitement to playtime with its realistic lights and music, making every ride feel like an adventure around the yard and the driveway. Game Night Favorites For older kids and teens, Amazon.in offers the Gouda Games Cuff The Bluff, a thrilling dice and card game designed for ages 12 and up. The game encourages strategic thinking and enhances social skills, making it an exciting and interactive experience for family and friends to enjoy their time together.Another great option for both kids and adults is the BCBESTCHESS Wooden Handcrafted Chess Board Set which is also an excellent way to develop critical thinking, strategy, and problem-solving abilities. With its beautifully crafted design, this timeless classic chess board is perfect for intense matches and is a fantastic gift for anyone looking to sharpen their strategic skills.STEM Superstars You can now introduce young explorers to the wonders of the world with the Shifu Educational Globe. This augmented reality-based globe, designed for kids aged 4-10, is packed with over 1,000 fascinating facts, making geography and world knowledge both fun and engaging. Through AR technology, it brings continents, countries, and cultures to life, transforming learning into an exciting adventure.For those with a passion for engineering and excitement, the LEGO Technic Mercedes-AMG F1 W14 E Performance set is an ideal choice. Perfect for kids aged 7 and above, this detailed set allows them to build their very own Formula 1 car while learning about car mechanics and engineering principles. Don’t Miss Out on Your Children’s Joy!The 2024 Holiday Toy List from Amazon India features a diverse selection of toys that blend fun, creativity, and learning for kids of all ages. With discounts of up to 80% and exclusive offers, there’s no better time to shop – explore Amazon.in’s Holiday Toy List and check off your holiday shopping list while giving the gift of learning and excitement this season.Disclaimer:This content is sponsored and does not reflect the views or opinions of IE Online Media Services Pvt Ltd. No journalist is involved in creating sponsored material and it does not imply any endorsement whatsoever by the editorial team. IE Online Media Services takes no responsibility for the content that appears in sponsored articles and the consequences thereof, directly, indirectly or in any manner. Viewer discretion is advised.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.Former CM Baghel appeals to government for caution after children injured in crossfire between security forces and Maoists in Chhattisgarh. He questions the encounter and urges government to take responsibility for innocent tribal people caught in the crossfire.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"SPONSOREDDream Sports Foundation joins forces with MSSA to push school sports in Mumbai","pic":"//images.indianexpress.com/2024/12/feature-image-2024-12-18T170540.332.jpg?w=210","link":"https://indianexpress.com/article/business/sponsored-business/dream-sports-foundation-joins-forces-with-mssa-to-push-school-sports-in-mumbai-9731226/","contents":{"image":"https://images.indianexpress.com/2024/12/feature-image-2024-12-18T170540.332.jpg?w=640","text":"In a bid to raise the standard of youths in sports, Dream Sports Foundation (DSF) has forged a five-year partnership with the Mumbai School Sports Association (MSSA).The collaboration is set to impact over 75,000 students, spans 20 sports, including Hockey, Football, Cricket, Athletics, Table Tennis, and Badminton, a statement by Dream Sports read.MSSA, founded in 1893, has a legacy of nurturing legendary athletes such as Dilip Vengsarkar, Sachin Tendulkar, Ajit Agarkar, and Yashasvi Jaiswal. Over the years, it has played a crucial role in shaping Mumbai’s sporting culture. Through this partnership, DSF aims to continue its mission to improve the quality of school sports in alignment with the National Sports Policy 2024.Key details of partnership:Bhavit Sheth, the Chief Operating Officer and Co-Founder of Dream Sports expressed his enthusiasm about the partnership, stating, “We’re thrilled to partner with an association that is integral to Mumbai’s grassroots sporting culture and has made the city proud. In line with our vision to Make Sports Better, we’re excited to support young  athletes and help unlock their potential while contributing to India’s vision of becoming a sporting superpower.” Rev. Fr Jude Rodrigues, President of MSSA, also welcomed the collaboration, highlighting its potential to strengthen Mumbai’s sporting future and legacy. “This collaboration will help Mumbai athletes stay ahead of the curve while adhering to the foundation’s vision and mission. This partnership marks the beginning of an exciting journey to add to  Mumbai’s illustrious sporting legacy,” he said.About Dream Sports Foundation: Dream Sports Foundation is the philanthropic arm of Dream Sports, India’s leading sports technology company with brands such as Dream11, FanCode and DreamSetGo in its portfolio. DSF’s vision is to make sports better by bridging the gaps in the sporting ecosystem. One of DSF’s key sports initiatives is ‘DreamGold’, a long-term elite athlete development program that is proud to support athletes like Sreeja Akula and Nethra Kumanan. To support young, promising athletes, DSF has curated partnerships with the Mary Kom Regional Boxing Foundation, Bhaichung Bhutia Football Schools, the Dilip Vengsarkar Foundation, and The Karnam Malleswari Foundation. In 2024, DSF also launched the Dream Sports Championship with a football edition for the U-17 age group.About MSSA: Founded in 1893, the Mumbai School Sports Association (MSSA) aims to promote fitness and discipline through active sports and games participation among thousands of school-going students in Mumbai. The association conducts championships across 20 sports, organizing 177 tournaments that engage approximately 75,000 students from 484 member schools. Established with a vision to inspire and elevate, MSSA has become a hub for athletes and sports enthusiasts alike. The foundation rests on its commitment to nurturing talent, fostering camaraderie, and promoting a healthy, inclusive sporting environment.You want to be the smartest in the room.You want access to our award-winning journalism.You don’t want to be misled and misinformed.OpenAI's ChatGPT has made a big update on its 10th day of announcement, allowing users in the US and Canada to access it on flip and landline phones by dialing 1-800-CHATGPT for 15 minutes per month. This feature does not require an account or subscription and offers a natural language voice exchange experience. Other countries can access ChatGPT on WhatsApp by texting 1-800-242-8478.This No Is Already Registered.Thanks For Registered Mobile No."}},{"headline":"Parliament Live: BJP to file FIR against Rahul Gandhi after 2 MPs injuredParliament Winter Session LIVE: Session entered its penultimate day on Thursday amid the row over Home Minister Amit Shah's remarks on Dr BR Ambedkar, for which the opposition has been demanding Shah's resignation.","summary":"","link":"/india-news/parliament-winter-session-live-jpc-one-nation-one-election-amit-shah-ambedkar-remarks-congress-bjp-lok-sabha-101734576537945.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/parliament_winter_session_amit_shah_ambedkar_1734590783330_1734590783647.jpg","text":"Parliament Winter Session LIVE: The Winter Session is set to end on Friday and some big business remains amid political slugfest over several issues, the biggest one at present being Amit Shah's remarks on BR Ambedkar. Two BJP MPs were injured in what they claimed was a result of pushing by Congress and opposition members....Read MoreParliament Winter Session | Key points   Parliament Winter Session LIVE: Rajya Sabha deputy chairman Harivansh dismissed the opposition's impeachment notice seeking the removal of the chairman, sources told news agency PTI.Parliament Winter Session LIVE: Union minister Rijiju has demanded an apology from Rahul Gandhi for using force against women in the parliament complex after two BJP MP's were injured during a commotion.Parliament Winter Session LIVE: Leader of Rajya Sabha J P Nadda condemned Rahul Gandhi's conduct with BJP MPs in Parliament complex. Members of both parties have arrived at the Parliament complex police station to file FIRs against the other. Rajya Sabha proceedings adjourned for the day amid continuous uproar by treasury, opposition benches over Ambedkar issue.Lok Sabha proceedings adjourned for the day amid continuous uproar by treasury, opposition benches over Ambedkar issue.BJP legal team along with party MPs Anurag Thakur, Bansuri Swaraj, and others reached Parliament Street police station to file a complaint against Congress MP and Lok Sabha LoP Rahul Gandhi.AAP convener Arvind Kejriwal said on Thursday: \"A day before yesterday, Union Home Minister Amit Shah made a statement in Parliament. His words were insulting but his tone clearly expressed his repressed anger for Babasaheb Ambedkar. If he had said it only once, we could have thought it was a mistake. However, PM Modi supported his statement the next day.\" Samajwadi Party MP Awadesh Prasad arrived at Delhi's RML Hosptial to meet injured BJP MP Pratap Chandra Sarangi.\"Whatever happened is sad and against democratic beliefs. This should not happen by anyone. There is some decorum of the House, and it should be maintained by everyone,\" he said to the mediaAnurag Thakur, Bansuri Swaraj and Hemang Joshi will file an FiR against Rahul Gandhi for pushing two BJP MPsUnion Ministers Pralhad Joshi and Shivraj Singh Chouhan meet BJP MPs Pratap Sarangi and Mukesh Rajput at Delhi's Ram Manohar Lohia Hospital.Pratap Sarangi and Mukesh Rajput allegedly sustained injuries during commotion between INDIA and BJP MPs.BJP MP Nishikant Dubey confronted LoP Rahul Gandhi while checking on BJP's Pratap Sarangi, who was allegedly injured. PM Modi has called BJP's Pratap Sarangi and Mukesh Rajput and inquired about their health after the injuries in Parliament today.BJP is exploring legal options against Congress MPs for pushing Pratap Sarangi and Mukesh Rajput of the BJP, who have sustained injuries.Competing marches by opposition and NDA MPs led to shoving and jostling inside Parliament House premises on Thursday with BJP's Sarangi and Rajput getting injured in the melee amid allegations that Congress leader Rahul Gandhi pushed him.Amid opposition's faceoff with the ruling BJP-led alliance in Parliament, in which 2 BJP MPs were injured on Thursday, Union Minister Shivraj Singh Chouhan said, \"...This is a black day in Parliamentary history. Decorum has been torn apart. Democracy has been shredded and sullied. There is no other example like that of the hooliganism of Rahul Gandhi and Congress party...Such conduct was never seen in the Parliamentary history of India. Why are they releasing their frustration in Parliament if they lost Haryana and Maharashtra?...A workshop should be called to train Rahul Gandhi and Congress people to understand the conduct in democracy...I am sad...Amit Shah's speech exposed Congress...They are so frustrated with it that they have stooped to hooliganism now. We condemn this hooliganism...\" TDP MP Appalanaidu Kalisetti met BJP MPs Mukesh Rajput and Pratap Chandra Sarang at RML Hospital. They have been after sustaining injuries during jostling with INDIA Alliance MPs.  Samajwadi Party MPs, including actor-politician Jaya Bachchan, and other INDIA bloc members protested at Parliament premises over Union Home Minister Amit Shah's statement on Babasaheb Ambedkar.BJP MP Mukesh Rajput got injured allegedly due to a push by Rahul Gandhi in Parlisment. His condition is serious and he has been admitted to the ICU of RML hospital, according to news agency ANI.Leader of the Opposition in the Rajya Sabha and Congress president Mallikarjun Kharge has submitted a privilege notice against the Union Home Minister for remarks on Dr Ambedkar in the Rajya Sabha on December 17.According to ANI, BJP MP Pratap Chandra Sarangi says, \"Rahul Gandhi pushed an MP who fell on me after which I fell down...I was standing near the stairs when Rahul Gandhi came and pushed an MP who then fell on me...\"MPs of INDIA bloc climb the walls of Makar Dwar at the Parliament and protest with placards demanding an apology and resignation of Union Home Minister Amit Shah over his remarks on Babasaheb Ambedkar in Rajya Sabha, ANI reportedAmid uproar after 4 motions of the opposition under rule 267 were dismissed, Rajya Sabha adjourned till 2 PMMinutes after beginning, Lok Sabha proceedings adjourned till 2 PMThe BJP triggered another row over alleged insult to BR Ambedkar by sharing an edited photo of the opposition MPs' protest. The pictures of Dr. Ambedkar were replaced by that of George Soros.Congress' KC Venugopal reacted to it and said,\" The BJP is brazen in its insult and ridicule of Dr. Ambedkar. Instead of submitting ensuring the Home Minister is removed from his post for the immense hurt caused to the crores of Babasaheb’s followers by Amit Shah’s statements, they are doubling down on the ridicule.\"Lashing out at the BJP over Amit Shah's remarks on Babasaheb Ambedkar, Congress MP Priyanka Gandhi Vadra said on Thursday that they do not have basic respect for the person who is regarded as the Constitution maker.BJP MPs staged a protest in front of the parliament building alleging insult to BR Ambedkar amid Amit Shah remarks row.Amid a controversy over Union Home Minister's remarks on Babasaheb Ambedkar, Rashtriya Janata Dal Chief Lalu Prasad Yadav said on Thursday that Amit Shah has gone mad and he should renounce politics and leave.\"Amit Shah has gone mad. He must have hatred for Babasaheb Ambedkar. We condemn this madness of his. Babasaheb Ambedkar is great. He should renounce politics and leave,\" Lalu Yadav said, according to ANI.Former Union ministers Anurag Thakur and P P Chaudhary from the BJP, and Priyanka Gandhi Vadra of the Congress are set to be among the 21 Lok Sabha members, who will be part of the joint committee of Parliament that will scrutinise two bills on simultaneous elections.Parshottambhai Rupala, Bhartruhari Mahtab, Anil Baluni, C M Ramesh, Bansuri Swaraj, Vishnu Dayal Ram and Sambit Patra are among the BJP's Lok Sabha members to be part of the panel.Manish Tewari and Sukhdeo Bhagat of the Congress, Shrikant Shinde of the Shiv Sena, Dharmendra Yadav of the Samajwadi Party, Kalyan Banerjee of the TMC, T M Selvaganapathi of the DMK, G M Harish Balayogi of the TDP, Supriya Sule of the NCP (Sharad Pawar), Chandan Chauhan of the RLD and Balashowry Vallabhaneni of the Jana Sena Party are other Lok Sabha members, according to PTI.Dr BR Ambedkar's grandson Prakash Ambedkar on Wednesday alleged that Home Minister Amit Shah's remarks on the father of the Constitution reflected the Bharatiya Janata Party’s (BJP) ‘same old mentality’. Read here what the Vanchit Bahujan Agadi leader said.The Congress has planned a countrywide protest on Thursday seeking Union home minister Amit Shah's resignation amid a row related to his remarks on BR Ambedkar, which he made on Tuesday in Rajya Sabha. More details here.HM Amit Shah held a press conference and accused Congress of being \"anti-BR Ambedkar and anti-Constitution\".Shah responded to Congress chief Mallikarjun Kharge's call for his resignation, saying it won't make a difference to the Congress party's fate. Shah claimed that the Congress party will remain in the opposition for the next 15 years, regardless of his resignation. More details hereCongress MP Manickam Tagore on Thursday submitted an Adjournment Motion notice in the Lok Sabha, demanding an urgent discussion on remarks made by Union Home Minister Amit Shah during his Constitution Day speech in the Rajya Sabha, and called for both an apology and resignation from him, PTI reported.The Union government will formally move a motion in the Lok Sabha on Thursday to constitute a joint parliamentary committee (JPC) on two bills that aim to usher in simultaneous national and state elections, and propose the names of 21 lawmakers of the Lower House as members. More details here."}},{"headline":"Ambedkar row: Parl in chaos, Rahul's 'push' sends BJP MPs to ICU; Cong reacts","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/ambedkar_remarks_amit_shah_parliament_1734589150646_1734589175764.jpg","summary":"Leader of Opposition in the Lok Sabha Rahul Gandhi and his MP sister Priyanka Gandhi were part of the opposition leaders who protested on Makar Dwar.","link":"/india-news/ambedkar-row-amit-shah-high-drama-parliament-opposition-makar-dwar-rahul-gandhi-push-injures-bjp-mp-101734587183028.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/ambedkar_remarks_amit_shah_parliament_1734589150646_1734589175764.jpg","text":"Subscribe Now! Get features likeThe political slugfest over Amit Shah's remarks on BR Ambedkar saw dramatic escalation on Thursday, placing the Opposition atop the 'Makar Dwar' of Parliament in protest and leaving two Bharatiya Janata Party (BJP) MP injured due to what allegedly was the result of a push by Congress MP Rahul Gandhi.Amit Shah's remarks on BR Ambedkar he made in Rajya Sabha on Tuesday have stirred a massive row, with the Congress-led Opposition seizing on the comments to corner the Bharatiya Janata Party (BJP)-led central government and also demanding the Home Minister's resignation. Amping up their attack on Amit Shah and the BJP-led central government, MPs of opposition camp 'INDIA' climbed the Makar Dwar of Parliament on Thursday with placards demanding an apology and resignation of Home Minister Amit Shah.Trouble began when the INDIA bloc members insisted on entering Parliament through the BJP MPs holding a protest instead of using the space left empty on one side of the staircase of the Makar Dwar, used by members to enter and exit the building.Leader of Opposition in the Lok Sabha Rahul Gandhi and his MP sister Priyanka Gandhi were part of the opposition leaders who protested on Makar Dwar.Parallely to opposition's protest in Parliament, BJP MP Pratap Chandra Sarangi alleged that he was left injured after Rahul Gandhi pushed a parliamentarian who, taking him along, fell down. \"Rahul Gandhi pushed an MP who fell on me after which I fell down...I was standing near the stairs when Rahul Gandhi came and pushed an MP who then fell on me,\" said Pratap Chandra Singh, who was being moved on a wheelchair with a handkerchief placed on his forehead, seemingly over a wound.Mukesh Rajput and Pratap Sarangi, the BJP MPs injured, were admitted to the Intensive Care Unite (ICU) of Delhi's Ram Manohar Lohiya (RML) Hospital over the injuries they sustained. While it was learnt that BJP was considering legal action against Congress over the matter, Congress president Mallikarjun Kharge also later alleged he was physically pushed in Parliament.Responding to the allegations, Rahul Gandhi said BJP MPs were trying to stop him and were threatening him. “I was just trying to go inside the Parliament and BJP MPs were trying to stop me, threatening me. This is what has happened... This is the entrance of Parliament House and we have a right to go inside.”BJP's Anurag Thakur, Bansuri Swaraj and Hemang Joshi were reportedly planning to file an FiR against Rahul Gandhi over the alleged push that injured two BJP MPs.Congress later also shared a video of MP Priyanka Gandhi Vadra and party chief and Rajya Sabha LoP Mallikarjun Kharge when they were allegedly being stopped by ruling party MPs while entering Parliament on Thursday.Congress president Mallikarjun Kharge, alleging he was physically pushed by BJP MPs, said in a letter to Lok Sabha Speaker, “This morning INDIA party MPs marched from the statue of Dr Ambedkar t Prerna Sthal to Maka Dwar. This was to protest against the insulting remarks on Dr Ambedkar made by Union Home Minister in his speech in Rajya Sabha on December 17, 2024.”  “When I reached Makar Dwar along with the IDNIA parties MPS, I was physically pushed by BJP MPs. I lost my balance and was forced to sit down on the ground in front of Makar Dwar, this inflicted injury on my knees which have already undergone surgery,” Kharge added. The Director and Medical Superintendent of RML informed that Pratap Sarangi and Mukesh Rajput were in ICU, adding that a team of doctors is providing treatment to stabilise them.Investigations like CT scan and others are undergoing, told RML MS Ajay Shukla.\"MP Pratap Sarangi was brought to the hospital, with a deep cut on his head, and till the time of arrival at the hospital, had lost a lot of blood. \"Doctors have stitched the cut for him,\" Shukla said.“Meanwhile, MP Mukesh Rajput, was brought with some head injury and high blood pressure. The team is providing all necessary treatment to the two,” he added.It all started from Amit Shah's remarks on Tuesday in Rajya Sabha that Congress leaders would have got a place in heaven had they chanted the name of God rather than following the “fashion of repeating Ambedkar’s name”.\"Abhi ek fashion ho gaya hai - Ambedkar, Ambedkar, Ambedkar, Ambedkar, Ambedkar, Ambedkar. Itna naam agar bhagwan ka lete to saat janmon tak swarg mil jata (It has become a fashion to say Ambedkar, Ambedkar, Ambedkar, Ambedkar, Ambedkar, Ambedkar'. If they had taken God's name so many times, they would have got a place in heaven),\" Shah had said.Amit Shah had also said the BJP is happy that the Congress is taking Ambedkar's name but the party should also speak about its real sentiments towards him."}},{"headline":"Who is Pratap Sarangi, BJP MP in ICU after scuffle at Parliament today?","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/PTI12-19-2024-000065B-0_1734593768176_1734594279223.jpg","summary":"Protests over Amit Shah's remarks on Ambedkar turned violent in Parliament, injuring BJP MPs Mukesh Rajput and Pratap Sarangi.","link":"/india-news/pratap-chandra-sarangi-mukesh-rajput-parliament-protests-icu-amit-shah-ambedkar-remarks-101734593497351.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/PTI12-19-2024-000065B-0_1734593768176_1734594279223.jpg","text":"Subscribe Now! Get features likeProtests over Home Minister Amit Shah's 'Ambedkar is the fashion' remarks turned violent today as Parliamentarians pushed each other while standing on stairs. Both the BJP and Congress allege that the other side used force to harass and prevent their rivals from entering the Parliament.Two BJP MPs - Mukesh Rajput and Pratap Chandra Sarangi - were injured during the scuffle. Both of them have been rushed to the Ram Manohar Lohia Hospital in Delhi, where they are currently being treated in the Intensive Care Unit (ICU).\"Two MPs Pratap Sarangi and Mukesh Rajput are hospitalised at RML. The two are currently in ICU at the hospital, and the doctor's team is providing treatment to stabilize them. Investigations like CT scan and others are undergoing,\" RML spokesperson Ajay Shukla said.\"MP Pratap Sarangi was brought to the hospital, with a deep cut on his head, and till the time of arrival at the hospital, had lost a lot of blood. Doctors have stitched the cut for him. Meanwhile, MP Mukesh Rajput, was brought with some head injury and high blood pressure,\" the hospital added.Both the Lok Sabha and the Rajya Sabha have been adjourned following noisy protests by the Opposition seeking an apology from Amit Shah for his remarks on Ambedkar.Dressed in blue, a colour associated with B R Ambedkar, INDIA bloc MPs, including the Congress' Mallikarjun Kharge and Rahul Gandhi, staged a protest in the Parliament premises demanding Amit Shah's resignation for his remarks related to the chief architect of the Constitution.BJP-led NDA parliamentarians also carried out a march within Parliament premises, raising slogans and carrying placards demanding an apology from the opposition Congress for allegedly insulting Ambedkar.As parliamentarians from the INDIA bloc confronted MPs from the ruling coalition near the Makar Dar of Parliament, the two groups engaged in loud sloganeering, each trying to outshout the other.The INDIA bloc members began their protest by gathering at the statue of B.R. Ambedkar within the Parliament premises, holding signs that read \"Main Bhi Ambedkar,\" \"Jai Bhim,\" and \"Amit Shah maafi maango.\"They then organized a protest march across the Parliament grounds. MPs from various parties, including Congress, DMK, RJD, SP, Left, and NCP(SP), participated in the demonstration. Several opposition MPs, such as Rahul Gandhi, Priyanka Gandhi Vadra, and K. Kanimozhi, were seen wearing blue.Mukesh Rajput, a prominent BJP leader, is currently the Member of Parliament (MP) from the Farrukhabad constituency in Uttar Pradesh. He defeated Naval Kishor Shakya of the Samajwadi Party in the 2024 Lok Sabha elections.The 55-year-old holds a Bachelor of Science degree from RP Degree College, Kamalganj Janpad Farrukhabad, Chhatrapati Shahuji Maharaj University, which he completed in 1990.Mukesh Rajput's assets are valued at approximately ₹9.36 crores, with no reported liabilities, according to the affidavit filed by him for the 2024 Lok Sabha elections.BJP leader Pratap Chandra Sarangi is a Member of Parliament from the Balasore constituency in Odisha.Sarangi's educational background includes a Bachelor's degree from Fakir Mohan College, Balasore, under Utkal University, which he completed in 1975. His early life was marked by a strong spiritual inclination, and he even considered becoming a monk of the Ramakrishna Math.Before entering politics, Sarangi worked as a Head Clerk at Nilgiri College, Nilgiri, Balasore, Odisha. His political career began as a district-level volunteer of the Rashtriya Swayamsevak Sangh (RSS), and he also worked for the Vishwa Hindu Parishad (VHP) and Bajrang Dal.Sarangi's political journey includes being elected as a Member of the Odisha Legislative Assembly twice, from 2004 to 2009 and from 2009 to 2014, both times from the Nilagiri constituency. He also contested in the 2014 Lok Sabha elections from Balasore, Lok Sabha constituency, but lost. However, he won in 2019 from the same constituency, defeating the Biju Janata Dal candidate and sitting MP, Rabindra Kumar Jena, by a margin of 12,956 votes.In May 2019, Sarangi became the Minister of State for Micro, Small and Medium Enterprises and Animal Husbandry, Dairying, and Fisheries. He has been instrumental in revolutionizing primary education in rural areas through the innovative concept of community-funded Ekal Vidyalaya or single-teacher schools.However, Sarangi has also been involved in some controversies, including his alleged involvement in the 1999 Australian Christian missionary Graham Staines' murder case. Although he denied any involvement, the incident has been a subject of debate."}},{"headline":"RG Kar rape case: Parents of victim move Calcutta HC seeking fresh probe","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/rg_kar_rape_case_kolkata_1734596134094_1734596134424.jpg","summary":"Parents of the victim cited lack of confidence in the ongoing probe into the incident that led to huge protests.","link":"/india-news/rg-kar-hospital-rape-case-parents-of-victim-move-calcutta-hc-seeking-fresh-probe-101734595239638.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/rg_kar_rape_case_kolkata_1734596134094_1734596134424.jpg","text":"Subscribe Now! Get features likeParents of the trainee doctor who was allegedly raped and murdered at the RG Kar hospital of West Bengal's Kolkata in August this year moved the Calcutta High Court on Thursday, seeking a fresh investigation into the alleged crime.Citing lack of confidence in the ongoing probe into the incident that led to huge protests, the parents of the RG Kar Hospital rape and murder victim prayed for a direction for a fresh investigation into the rape and murder of their daughter, news agency PTI reported.Justice Tirthankar Ghosh asked their lawyer to add the Central Bureau of Investigation (CBI), which is probing the case, as a party in the petition and mention the matter again before the court on Monday, December 23.The on-duty postgraduate trainee doctor's body was found in the seminar room of the RG Kar Medical College and Hospital on August 9 this year. A Kolkata Police civic volunteer, Sanjay Roy, is the prime accused in the case.The Sealdah court on December 13 granted bail to RG Kar Medical College and Hospital ex-principal Sandip Ghosh and Tala police station's officer-in-charge Abhijit Mondal in the case.They were granted bail as the CBI failed to file charge sheets against them within the 90-day statutory period, according to their lawyers.While Ghosh was accused of tampering with evidence in the case, the police officer was accused of delaying the filing of an FIR after the body was found.CBI has filed a charge sheet against the Sanjay Roy.In its charge sheet, the CBI said Roy, who was working as a civic volunteer with the local police, allegedly committed the crime when the victim had gone to sleep in the hospital's seminar room during a break."}},{"headline":"Virat Kohli involved in heated argument with Australian TV journalist: ‘You…’","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/wmremove-transformed_1734595001504_1734595007873.jpeg","summary":"Virat Kohli was miffed because he thought he was being filmed with his children at the Melbourne airport.","link":"/cricket/virat-kohli-involved-in-heated-argument-with-australian-tv-journalist-i-need-privacy-with-my-kids-you-just-cant-101734594763726.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/wmremove-transformed_1734595001504_1734595007873.jpeg","text":"Subscribe Now! Get features likeVirat Kohli was reportedly involved in a heated exchange with Australian media upon his arrival in Melbourne on Friday ahead of the Boxing Day Test match against Australia. Kohli was miffed because he thought he was being filmed with his children at the airport. The former India captain is known to be fiercely protective of his family, and when he realised they were being filmed without his consent, he could not keep his calm.According to a Channel 7 report, Kohli had a heated argument with an Australian TV journalist after spotting video cameras pointed towards his children.\"It was upon seeing the waiting cameras that Kohli became a little heated over what is largely a misunderstanding when he thought the media was filming him with his children,\" Channel 7 reporter Theo Doropoulos said.Kohli then made his position clear. \"With my kids I need some privacy, you just can't film without asking me,\" he was heard saying according to the report.The report claimed that the journalist and cameraperson in question cleared the air and convinced Kohli that they were not filming him with his family members.Things settled and Kohli walked off after shaking hands with a Channel 7 cameraperson.Kohli has not been in good form in the Border-Gavaskar Trophy. Despite scoring a century in the second Test in Perth - his 30th in Test cricket - the right-handed batter's Australia tour hasn't really taken off. Apart from that century, Kohli has registered scores of 5, 7, 11 and 11.The biggest concern for the former captain, who has seven centuries on Australian soil, is his mode of dismissal. He has been trapped with deliveries way outside the off stump, raising doubts about his technique and reflexes.The five-match series is currently locked 1-1. India won the series opener in Perth against all odds. Their 295-run win was their biggest win in overseas Tests.Australia came back strongly in the day-night Test in Adelaide, registering a commanding 10-wicket victory to square the series.Rain played spoilsport to what could have been a fascinating third Test at the Gabba, forcing a draw.The fourth assignment will be at the MCG, starting on December 26. "}},{"headline":"‘People crying’: First responders recount horrific Mumbai boat mishap","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/mumbai_boat_1734582959478_1734582959705.jpg","summary":"Thirteen people died after a Navy craft, undergoing engine trials, lost control and collided with a passenger ferry near Mumbai's Karanja on Wednesday","link":"/india-news/people-crying-screaming-first-responders-recount-horrific-mumbai-boat-accident-101734581738141.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/mumbai_boat_1734582959478_1734582959705.jpg","text":"Subscribe Now! Get features likeThe drivers of boats who rushed to help the victims of Wednesday's deadly ferry tragedy off the Mumbai coast were among the first responders at the scene and described the incident as something they had never witnessed before.A total of 13 people lost their lives while others were rescued after a Navy craft, undergoing engine trials, lost control and collided with the passenger ferry Neel Kamal near Mumbai's Karanja at around 4 pm on Wednesday. The ferry had been carrying passengers from the Gateway of India to Elephanta Island, a popular tourist destination.One Naval personnel and two from the OEM (Original Equipment Manufacturer) on board the Naval craft were among those who died in the mishap, the Navy said. According to the Mumbai police, the deceased included seven men, four women and two children.\"When we reached there, the situation was tragic and completely chaotic. People were screaming for help, and some were crying,\" news agency PTI quoted as saying Arif Bamane, the driver of the Mumbai Port Trust (MBPT) pilot boat Poorva.Bamane recalled a small girl lying motionless after water had entered her lungs. The driver and other rescuers performed chest compressions on her, helping her breathe again, and gradually, her breathing returned to normal.Bamane said that they focused on rescuing women and children first.A fishing trawler and another tourist boat had already arrived at the site before Bamane's team. Bamane said that they had been heading back to Mumbai from Jawahar Deep when they were alerted about the accident. Their boat, with only four people aboard, immediately proceeded to the accident site near JD5.\"We tried to save as many people as possible,\" Bamane said, adding that they managed to rescue around 20-25 people before they were transferred to naval boats that arrived shortly after.Bamane, having 18 years of boat driving experience, stated that while he had been part of smaller rescue operations before, this one was by far the most horrific.\"This is the biggest rescue operation that I have seen so far,\" he added.Iqbal Gothekar, the driver of a small tourist boat, told the news agency that 25 to 30 minutes after his boat departed from Elephanta Island at 3:35 pm, he learned of the incident and was also among the first to reach the site.Gothekar, a native of Raigad district and a boat driver since 2004, described how people on the capsized ferry were frantically waving their hands for help. He said that by the time they reached the scene, a fishing trawler had also arrived.Gothekar's boat successfully rescued 16 people and brought them safely back to the Gateway of India, where they were handed over to the police. \"In my career, I have never witnessed such an incident,\" Gothekar said, recounting the tragedy.The capsized ferry, which had a capacity of 80 passengers, had left the Gateway of India for Elephanta Island about 45 minutes before the collision occurred near Butcher Island, according to sources cited in the report."}},{"headline":"Starbucks is not exiting India: Tata Consumer denies ‘baseless’ report","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/SBX20240820-FallMenu-Feature_1724323233675_1734598057984.webp","summary":"Tata Consumer Products has denied a report suggesting American coffee chain Starbucks could exit India soon due to rising losses and high operating costs","link":"/trending/starbucks-is-not-exiting-india-tata-consumer-denies-baseless-report-of-coffee-chain-quitting-country-101734598006571.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/SBX20240820-FallMenu-Feature_1724323233675_1734598057984.webp","text":"Subscribe Now! Get features likeTata Consumer Products has denied a report suggesting American coffee chain Starbucks could exit India soon due to rising losses and high operating costs. In letters to three major Indian stock exchanges, Tata Consumer Products called the report “baseless.”On December 19, a Rajasthan-based media organisation, called The Philox, published a report suggesting Starbucks could soon leave India. Published with the headline “Starbucks to Exit India Due to High Costs, Bad Taste, and Mounting Losses,” the report speculated that the hugely popular coffeehouse chain could shut shop in India due to price-conscious Indian consumers preferring cheaper local substitutes.Starbucks had entered India in 2012 through a partnership with Tata Consumer Products. The Philox report did not quote any Tata official and acknowledged that “no official statement has been made” even as it claimed that Starbucks beverages are perceived as “overpriced and shallow” in India.“Despite its ambitious plans, Starbucks has struggled to turn significant profits in the Indian market,” the report said.It was published days after Starbucks India confirmed that it would delay the planned launch of new store openings.Tata Starbucks Private Limited, the joint venture of Tata Consumer Products Limited and American coffee chain Starbucks, saw its losses widen to ₹81 crore and revenue from operations grow 12% in fiscal year 2024, according to TCPL's annual report released in May this year.However, TCPL denied the possibility of exiting India in a letter titled “Clarification on News Article Titled - Starbucks to Exit India Due to High Costs, Bad Taste, and Mounting Losses.”“The Company would like to state that the information in the said article is Baseless,” Tata Consumer Products said in a letter addressed to the National Stock Exchange of India, Bombay Stock Exchange, and Calcutta Stock Exchange.“Reports of Starbucks looking to exit India (are) completely false and baseless. Tata’s relationship with Starbucks stands strong with shared values and commitment to India,” the company further told CNBC-TV18.However, Tata Consumer CEO Sunil D'Souza told Reuters on Monday that it will delay plans for some new Starbucks store openings until as fewer customers are walking into its cafes in India."}},{"headline":"Kia Syros unveiled in India, bookings to open in Feb 2025","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/Kia_syros_1734598032112_1734598036689.jpg","summary":"Kia India launched the Syros compact SUV in New Delhi, with bookings starting February 2025.","link":"/business/kia-syros-unveiled-in-india-bookings-to-open-in-feb-2025-101734597805550.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/Kia_syros_1734598032112_1734598036689.jpg","text":"Subscribe Now! Get features likeKia India unveiled its all-new compact premium SUV, the Syros, in a global debut on Thursday in New Delhi. Bookings for the Syros will open in early February 2025, with the company anticipating strong interest from buyers in the competitive Indian market.During the unveiling, Kia highlighted that the Syros is equipped with advanced features, including ADAS Level 2 technology and 20 safety features as standard, ensuring a safer driving experience. Additionally, the SUV offers a premium in-car experience with a Harman Kardon speaker system, providing exceptional sound quality.Hardeep Singh Brar, Senior Vice President and Head of Sales at Kia India, told ANI, \"Today marks the global unveiling of the Syros. It's the first time this car has been showcased. We want people to see it, and based on their feedback, we'll consider their expected price. We plan to announce the pricing by the end of this month or early February.\"In the compact and mid-SUV segments, Kia currently holds a 15% market share. With the Syros launch, the company aims to increase this to 20% in the coming months.Brar added, \"Currently, in the mid-SUV, small SUVs, and mid-MPVs segments, we have a market share of around 15%. With the Syros, we aim to grow this to 20%.\"The name \"Syros\" is inspired by the scenic Greek island, symbolizing the vehicle's combination of elegance and sophistication.Kia also shared that it has expanded its customer outreach by adding 200 new touchpoints in 2024, bringing the total to over 700 touchpoints across 300 cities in India. This expansion underscores Kia's commitment to improving access to its products and services.The Syros offers two engine options: the Smartstream 1.0-liter turbo petrol with 88.3 kW (120PS) and 172Nm torque, and the 1.5-liter CRDi diesel engine with 85 kW (116PS) and 250Nm torque. Both engines are available with manual and automatic transmission options. The SUV features a wheelbase of 2550mm."}},{"headline":"Black Warrant teaser: Shashi Kapoor's grandson Zahan in Motwane seriesBlack Warrant teaser: Zahan Kapoor collaborates with Vikramaditya Motwane for ‘India’s first-of-a-kind prison drama.","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/black_warrant_teaser_1734594923478_1734594928726.png","summary":"","link":"/entertainment/web-series/black-warrant-teaser-shashi-kapoors-grandson-zahan-kapoor-stars-as-a-newbie-jailer-in-motwanes-prison-drama-101734591477882.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/black_warrant_teaser_1734594923478_1734594928726.png","text":"Subscribe Now! Get features likeVikramaditya Motwane is all set to take the audience into the world of 'India's most unforgiving jail' with his series Black Warrant. Netflix unveiled the teaser of the series, starring Zahan Kapoor as the rookie jailer trying to survive in the unforgiving world of Tihar jail.(Also Read: Vikramaditya Motwane on why genre-hopping is liberating for him: I really like making movies)On Thursday, Netflix shared an intriguing teaser of Vikramaditya Motwane's prison drama on YouTube. The teaser shows how Zahan Kapoor, a newly appointed jailer in Tihar Jail who struggles to survive in the environment as his colleagues ask him to be strong. The teaser also gives a glimpse into the raw and unfiltered reality of prison life. Rahul Bhat is also seen in the teaser, in the role of an authoritative cop who thinks jail is a circus.“The series offers a thrilling exploration of the morally charged world of Asia’s largest prison, Tihar, through the eyes of rookie jailer Sunil Kumar Gupta as he takes on some of India’s most notorious offenders. As Sunil grapples with moral dilemmas and power struggles, the drama reveals the raw and unfiltered reality of prison life,” reads the logline.People on the internet shared their views about Vikramaditya Motwane's prison drama. One of the YouTube users wrote, \"something different.\" Another comment read, \"looks good, I hope it's fun.\" Another commented, \"Vikramaditya Motwane never disappoints.\"Created and run by Vikramaditya Motwane and Satyanshu Singh, who also serve as co-directors alongside Ambiecka Pandit, Arkesh Ajay and Rohin Raveendran Nair, the show marks Zahan Kapoor's web series debut along with Rahul Bhat, Paramvir Singh Cheema, Anurag Thakur and Sidhant Gupta in pivotal roles. Zahan is the grandson of late star, Shashi Kapoor.Presented by Applause Entertainment, an Andolan Production in collaboration with Confluence Media, the series is inspired by true events and is a dramatised adaptation of the author and former superintendent at Tihar Jail, Sunil Gupta and journalist-author Sunetra Choudhury’s book, “Black Warrant: Confessions Of A Tihar Jailer.”Created and show run by Vikramaditya Motwane and Satyanshu Singh, who also serve as co-directors alongside Ambiecka Pandit, Arkesh Ajay and Rohin Raveendran NairRahul Bhat, Paramvir Singh Cheema, Anurag Thakur and Sidhant Gupta, each playing pivotal roles in this gripping and gritty tale."}},{"headline":"David Ayer reacts after he gets threats for supporting James Gunn's Superman","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/David_Ayer_Superman_1734590364632_1734590371214.png","summary":"Suicide Squad director David Ayer has faced online attacks from a section of DCEU fans after he said he was excited for ‘rival’ James Gunn's Superman.","link":"/entertainment/hollywood/david-ayer-takes-social-media-break-as-he-gets-threats-for-supporting-james-gunns-superman-101734589744183.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/David_Ayer_Superman_1734590364632_1734590371214.png","text":"Subscribe Now! Get features likeThe trailer for James Gunn's Superman is set to be released later on Thursday, and the entire fandom is excited. David Ayer, the filmmaker best known for Suicide Squad, also threw his weight behind the upcoming reboot. However, the director did not anticipate the hate coming his way after that, causing him to step back from social media for a while. (Also read: James Gunn's next Superman project repurposes Leader Building into The Daily Planet)Gunn's Superman will launch a new DC Universe, different from the DCEU (DC Extended Universe), in which Henry Cavill played Superman and Zack Snyder was the leading creative force. As David Corenswet's Superman replaces Cavill now, many of Snyder's fans are angry and openly campaigning against the new film, as Ayer found out.David Ayer's Suicide Squad, part of the DCEU, has been the subject of a revival campaign. The filmmaker recently asked fans to halt that campaign as Superman's trailer was launching and urged them to support the new film. \"I didn’t realize James was dropping Creature Commandos when the last Ayer cut campaign hit. The new Superman trailer is dropping soon and I know there’s intentions of another campaign for my version of Skwad. As a film makers I want to support other film makers. I’m excited to see the trailer and have heard through the rumor mill it’s pretty incredible. I just want to publicly say it would be nice to stay far clear of Thursday for any campaigning. I appreciate everyone hearing me out. At the end of the day I’m riding a tiger here. Just going in heard on this,\" he wrote on social media.This request, however, was met with opposition from DCEU fans, who accused Ayer of being a 'traitor to the cause'. Many wrote vile comments in response, even sending him threats and calling him a 'sellout' on various social media platforms.On Wednesday, Ayer took to X (formerly Twitter) again and expressed his disappointment at the online attacks. \"My Lord. If supporting another film maker is so contentious, I’m just lost at this point. When I was a kid I had a nightmare childhood. My best friends were comic books. They held me and gave me company when no one else did. Batman spoke to my injured soul. Superman’s optimism was an example how to see the world without darkness. I cannot fucking wait to see Jame’s trailer. Real talk. And I cannot wait to see his film. And absolutely am sure he crushed it. Because that simple optimism of Superman is all over it. And the little kid in me needs that right now. I’m a bad guy for that? So be it. I do troll what I can control. And can’t what I can’t. Gonna step back from all this for a moment,\" he said.Superman stars David Corenswet in the titular role and is the third film reboot of the character in the last two decades after the ones starring Brandon Routh and Henry Cavill. James Gunn directs the film, which also features Rachel Brosnahan, Nicholas Hoult, Edi Gathegi, Anthony Carrigan, Nathan Fillion, Isabela Merced, Skyler Gisondo, Sara Sampaio, María Gabriela de Faría, Wendell Pierce, Alan Tudyk, Pruitt Taylor Vince, and Neva Howell. It is set to be released on July 11, 2025."}},{"headline":"Virat Kohli 'leaving India', to move to London with Anushka, Vamika, Akaay soon","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/Virat_Kohli_wraps_his_arm_around_Anushka_Sharma_1721790935768_1734595833806.jpg","summary":"Virat Kohli's childhood coach Rajkumar Sharma has confirmed that the cricketer will leave India and move to London with Anushka Sharma and kids Vamika, Akaay.","link":"/cricket/virat-kohli-leaving-india-cricketer-to-move-to-london-with-anushka-sharma-kids-vamika-akaay-soon-confirms-excoach-101734595736235.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/Virat_Kohli_wraps_his_arm_around_Anushka_Sharma_1721790935768_1734595833806.jpg","text":"Subscribe Now! Get features likeRajkumar Sharma, Virat Kohli's childhood coach, has confirmed that the cricketer, his wife Anushka Sharma, and their children Vamika and Akaay are set to move to London soon. Sharma didn't dwell much on further details but hinted that Kohli would be leaving India and shifting base to the UK, where he eventually plans on spending the rest of his life post-retirement. Over the last couple of years, Kohli has been spotted in London frequently; in fact, their son Akaay was born in the city earlier this year on February 15. The couple owns a property in London and will most likely live there once the move is complete.\"Yes, Virat plans to move to London with his children and wife, Anushka Sharma. He is going to be leaving India and shifting very soon. However, right now, Kohli is spending most of his time with his family apart from cricket,\" Sharma told Dainik Jagran.Kohli and family were in London for the most part this year. After his son's birth, Kohli returned after India won the T20 World Cup in June. Although he returned for the ODI series against Sri Lanka in July, Kohli boarded the flight to the UK and stayed there till August. He returned to India for the start of their home season – two Tests against Bangladesh, followed by three more against New Zealand. After India lost 0-3 to the Kiwis, Kohli and his family have remained in India ever since, celebrating his birthday with his loved ones.Currently playing the Border-Gavaskar Trophy in Australia, Kohli's next big assignment will be the Champions Trophy – the schedule and venues of which have yet to be announced. It is unknown when his next trip to London is planned, but it could likely be between CT and the start of the IPL 2025.Sharma expects many more runs from Kohli's bat despite failing in the last two Tests. After starting the five-Test series against Australia with a brilliant century in Perth, Kohli combined to score just 21 runs in the next three innings. Having said that, Sharma is confident Kohli would set MCG's Boxing Day and Sydney's New Year Test on fire, insisting that his form is not a concern.\"Virat Kohli is playing the best cricket of his career. He also scored a century against Australia in the first Test. I believe two more centuries will come from his bat in the next two matches. This is a player who has always enjoyed his game. When a player enjoys his game, he gives his best. Virat's form is not a matter of concern. This player knows how to bat in difficult situations and make the team win,\" he said.With Ravichandran Ashwin's retirement, the gaze has already switched to Kohli and fellow senior player Rohit Sharma, who are in the second half of their 30s. A lot has been speculated about whether Kohli can go on until the next ODI World Cup in 2027. Sharma confidently stated that not only is Kohli nowhere close to retirement, but he is likely to carry on for five more years, which means playing the next World Cup in South Africa.\"Virat is still very fit and not too old to retire. I believe that Virat will play cricket for five more years. Virat will also be seen playing in the 2027 World Cup. The rapport between Virat and me is very good. I have known him well since Virat was not even 10 years old. I have been with him for more than 26 years. That is why I can say that Virat still has a lot of cricket left in him,\" said Sharma."}},{"headline":"Indian man rejects fresher's LinkedIn text for not calling him sir. Here's why","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/businessman-working-analysis-business-information_27d266a6-7b3f-11e7-ba32-a280bea68af6_1734595533712.jpg","summary":"A LinkedIn message from a fresh graduate to a senior sparked debate over addressing conventions on social media.","link":"/trending/indian-man-rejects-freshers-linkedin-message-for-not-calling-him-sir-son-you-are-101734595195608.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/businessman-working-analysis-business-information_27d266a6-7b3f-11e7-ba32-a280bea68af6_1734595533712.jpg","text":"Subscribe Now! Get features likeUsing LinkedIn messages to connect with recruiters, hiring managers, or professionals in desired industries to seek job opportunities is a common practice. Job seekers also reach out to alumni from their university to seek guidance or help in securing positions.However, one such routine message by a young man did not sit well with one of his college senior. Writer and columnist Saket took to X to share his reaction to a message he received on LinkedIn. He said a young fresher reached out to him in a message and informed him that they both graduated from the same institute.However, the writer said that he \"lost\" him when he addressed him by his name and did not user \"sir\".\"Call me old fashioned but had connected with a young fresh 2025 pass out from my college when he sent message on LinkedIn. His first message started with - Hi Saket, we are from same college…. And he lost me there itself. Son, you are 2025 pass out and address 1994 pass out with first name. I still address 1993 and earlier pass out as ‘Sir’. This Americanised culture,\" he wrote in the post.When someone asked him, if using \"Saket ji\" would be better, he said: \"No. I would still be surprised. It isn’t about what but who. Matters little when addressed by first name by people in work place. In my college, this wasn’t a thing. It isn’t still. So I was amused.\"The post quickly went viral and gained over 1.1 million views. Some users were taken aback by the writer's response, while others agreed that the young seeker should have addressed him “properly”.\"The college rule of calling seniors as \"sir\" is outdated. It was rooted in the culture of bullying and servitude, and with a fake assumption of preparing for the corporate India of those years that people need to call someone at a higher designation than them as sir,\" opined one user.(Also read: 'Don't build careers, rent people': CEO's advice on hiring confuses internet)\"I seriously get this. The GenZ are mostly entitled. They don't believe in respect and discipline. Forget respect, I feel good if they come to work on all days of the week,\" wrote another user."}},{"headline":"Chinese man arrested for operating 400 phones to win gifts","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/Scam_1734590709234_1734590713388.jpg","summary":"A man in China was arrested for using over 400 mobile phones to increase his chances of winning prizes in live streaming.","link":"/trending/chinese-man-arrested-for-operating-400-phones-to-win-gifts-in-live-stream-raffles-101734588618312.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/Scam_1734590709234_1734590713388.jpg","text":"Subscribe Now! Get features likeA man in Jiangsu province, eastern China, was arrested for running a large-scale operation to cheat in live streams. The suspect, identified as Ma, was discovered using over 400 mobile phones simultaneously from a garage in a residential compound in August, reported The Star.The unusual activity was noticed by an elderly passer-by, who suspected it to be a scam operation and reported it to the police. This led to an investigation by authorities, who found that Ma was managing hundreds of devices linked to separate live-streaming platform accounts.Ma explained that he used the phones to access the same live stream, which hosted “lucky bags” that offered prizes to audience members who clicked a button and sent a specific message. The live-streamers were responsible for providing the gifts and determining the contents of the lucky bags.Also read: China to build world’s largest artificial-island airport to handle 43 million passengersMa admitted to using this system to win various items, ranging from everyday necessities to high-value products like printers and iPhones, which he later sold on second-hand e-commerce platforms. He claimed to earn between 10,000 and 20,000 yuan (approximately US$1,400 to US$2,800) a month from this scheme.Ma circumvented the need for SIM cards by purchasing existing accounts, which were already registered with personal information. The police charged him with infringing on personal information, which is a violation of Chinese law. While the specific penalty was not disclosed, individuals found guilty of obtaining, selling, or providing personal information can face up to three years in prison or fines.The case has sparked reactions on social media, with many expressing surprise at Ma’s determination to win gifts. One user on Douyin commented, “It’s not inexpensive to buy 400 smartphones and secure the bandwidth necessary for all his operations. He must have been very obsessed with the lucky bags.” Another user pointed out that others have also used multiple phones to enter raffles for lucky bags during live-streams, calling it a “lazy alternative” for some to make a living.Also read: Malaysian woman loses over ₹4 crore in decade-long love scam without ever meeting scammer"}},{"headline":"Virat Kohli 'leaving India', to move to London with Anushka, Vamika, Akaay soonVirat Kohli's childhood coach Rajkumar Sharma has confirmed that the cricketer will leave India and move to London with Anushka Sharma and kids Vamika, Akaay.","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/Virat_Kohli_wraps_his_arm_around_Anushka_Sharma_1721790935768_1734595833806.jpg","summary":"","link":"/cricket/virat-kohli-leaving-india-cricketer-to-move-to-london-with-anushka-sharma-kids-vamika-akaay-soon-confirms-excoach-101734595736235.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/Virat_Kohli_wraps_his_arm_around_Anushka_Sharma_1721790935768_1734595833806.jpg","text":"Subscribe Now! Get features likeRajkumar Sharma, Virat Kohli's childhood coach, has confirmed that the cricketer, his wife Anushka Sharma, and their children Vamika and Akaay are set to move to London soon. Sharma didn't dwell much on further details but hinted that Kohli would be leaving India and shifting base to the UK, where he eventually plans on spending the rest of his life post-retirement. Over the last couple of years, Kohli has been spotted in London frequently; in fact, their son Akaay was born in the city earlier this year on February 15. The couple owns a property in London and will most likely live there once the move is complete.\"Yes, Virat plans to move to London with his children and wife, Anushka Sharma. He is going to be leaving India and shifting very soon. However, right now, Kohli is spending most of his time with his family apart from cricket,\" Sharma told Dainik Jagran.Kohli and family were in London for the most part this year. After his son's birth, Kohli returned after India won the T20 World Cup in June. Although he returned for the ODI series against Sri Lanka in July, Kohli boarded the flight to the UK and stayed there till August. He returned to India for the start of their home season – two Tests against Bangladesh, followed by three more against New Zealand. After India lost 0-3 to the Kiwis, Kohli and his family have remained in India ever since, celebrating his birthday with his loved ones.Currently playing the Border-Gavaskar Trophy in Australia, Kohli's next big assignment will be the Champions Trophy – the schedule and venues of which have yet to be announced. It is unknown when his next trip to London is planned, but it could likely be between CT and the start of the IPL 2025.Sharma expects many more runs from Kohli's bat despite failing in the last two Tests. After starting the five-Test series against Australia with a brilliant century in Perth, Kohli combined to score just 21 runs in the next three innings. Having said that, Sharma is confident Kohli would set MCG's Boxing Day and Sydney's New Year Test on fire, insisting that his form is not a concern.\"Virat Kohli is playing the best cricket of his career. He also scored a century against Australia in the first Test. I believe two more centuries will come from his bat in the next two matches. This is a player who has always enjoyed his game. When a player enjoys his game, he gives his best. Virat's form is not a matter of concern. This player knows how to bat in difficult situations and make the team win,\" he said.With Ravichandran Ashwin's retirement, the gaze has already switched to Kohli and fellow senior player Rohit Sharma, who are in the second half of their 30s. A lot has been speculated about whether Kohli can go on until the next ODI World Cup in 2027. Sharma confidently stated that not only is Kohli nowhere close to retirement, but he is likely to carry on for five more years, which means playing the next World Cup in South Africa.\"Virat is still very fit and not too old to retire. I believe that Virat will play cricket for five more years. Virat will also be seen playing in the 2027 World Cup. The rapport between Virat and me is very good. I have known him well since Virat was not even 10 years old. I have been with him for more than 26 years. That is why I can say that Virat still has a lot of cricket left in him,\" said Sharma."}},{"headline":"'Did Ashwin want to break Kumble's record?': Gavaskar claims legend lost steam","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/gavaskar_ashwin_steam_1734592179438_1734592188540.jpg","summary":"With 537 wickets in Test cricket, R Ashwin finished his career as India's second-highest wicket-taker in the format behind Anil Kumble","link":"/cricket/did-r-ashwin-want-to-break-anil-kumble-record-sunil-gavaskar-india-legend-lost-steam-lack-of-chances-led-to-retirement-101734591797070.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/gavaskar_ashwin_steam_1734592179438_1734592188540.jpg","text":"Subscribe Now! Get features likeFormer India captain Sunil Gavaskar, on Wednesday, admitted that Ravichandran Ashwin's retirement announcement was always on the cards given India's Test fixtures for 2025, before speculating that the veteran bowler had lost his steam and realised the lack of opportunities in the future, which played a key role in him taking the call midway through the Australia Test series.Speaking to India Today after Ashwin retired at the end of the drawn third Test match of the Border-Gavaskar Trophy series in Brisbane, Gavaskar, who was also in the city owing to broadcasting duties, said that with India not play anytime soon at home next year, and the next assignment being the tour of England in June, the 38-year saw that he was unlikely to feature in any of the matches during the series and hence made a conscious decision to bid adieu to the sport.He said: \"It was coming—for sure. Because, look, India is not playing anything now until next year. There is just the five-Test match series in England. And clearly, I think what has happened is that Ashwin, who's been a wonderful player for India, saw that he was not being considered in the playing 11 when India played overseas. It's been an aspect that has been there for the last several tours: when you go to South Africa, you go to Australia, you go to England.\"He doesn't get selected in the 11. So I think at that, recognising that the England tour was going to be the next five test series and perhaps thinking that he might not get picked, he decided to call it a day. So in, in a sense it was coming.\"Despite a record-breaking wicket tally at home in Test cricket, which includes the best strike rate and most five-wicket hauls, Ashwin played just 26 matches across his 13-year career in SENA nations, picking 72 wickets at 39.55.With 765 international scalps in his bag, Ashwin is the second-highest wicket-taker from India after Anil Kumble. Ashwin has taken 537 wickets at an average of 24 in 106 Test matches. He is also seventh on the overall list of wicket-takers.Had Ashwin remained an international cricketer, he could have had the opportunity to emerge as India's highest-ever wicket-taker in Test cricket. But Gavaskar reckoned that the senior off-spinner lacked that mental drive amid the limited opportunities.\"He could have gone on to do that for sure. But did he want to do that? That's the thing. Did he want to be under that? You know, look, you might take, you know, you might score hundreds of hundreds. You might; you might take, you know, plenty of five, five-wicket hauls or 10-wicket hauls in test matches. But that drive, do you have that drive,\" he said.Gavaskar reiterated Rohit Sharma's remark from the post-match presser on Wednesday, where the India captain revealed that he had to convince Ashwin to play the second Test in Adelaide.\"Rohit Sharma said that he had to persuade him to play the Adelaide Test, which means that even for the Adelaide Test, the previous Test, Ashwin wasn't really in the mental sort of frame, maybe, to play that test match. That's, I think, what would have been, that certainly would have been the consideration that he was not going to be the number one pick. And look, anybody who's got 500 plus wickets, 530, 540 wickets like he has, there is pride in your own performance. There is a feeling that you know you are somebody who has delivered in the past, and therefore, when you are not selected, it hurts you. It hurts you,\" he added."}},{"headline":"'I felt it on Day 4 and called it on Day 5...': Ashwin on retirement decision","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/CRICKET-AUS-IND-74_1734587537042_1734587551216.jpg","summary":"R Ashwin clarified that the cricketer in him is not yet done as he revealed his CSK plan after announcing retirement from international cricket","link":"/cricket/felt-it-on-day-4-and-called-it-on-day-5-ravichandran-ashwin-fresh-details-retirement-decision-csk-plan-101734587141378.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/CRICKET-AUS-IND-74_1734587537042_1734587551216.jpg","text":"Subscribe Now! Get features likeLess than 24 hours after announcing his retirement from international cricket, which came as a surprise for the cricket fraternity, having revealed his decision in the middle of the ongoing Test series in Australia, Ravichandran Ashwin labelled it as an \"instinctive\" call after landing in Chennai on Thursday. The 38-year-old also opened up on his plan for Chennai Super Kings (CSK) in the 2025 season of the Indian Premier League (IPL).Speaking to news agency ANI after reaching Chennai from Brisbane, Ashwin admitted that although thoughts about drawing curtains on his career was on his mind for a long time, his decision to make the announcement after the end of the rain-marred Gabba Test, which ended in a draw, was purely instinctive.The veteran India bowler revealed that he first felt taking the decision on Day 4 of the match, when KL Rahul, Ravindra Jadeja and the tail-enders fought valiantly to avoid a follow-on, but eventually waited till the end of the match.\"When asked if announcing retirement was a difficult decision, he says, \"...It's not. It's emotional for a lot of people. It will be emotional, maybe it will sink in. But for me, it's a great sense of relief and satisfaction...It had been running in my head for a while but it was very instinctive. I felt it on day 4 and called it on day 5...,\" he said.Leading up to the big announcement, there were no rumours in the media, until Virat Kohli was spotted sharing an emotional hug with Ashwin in the Indian dressing room, just moments before umpires called off the final session on Wednesday, resulting in a draw in the third match. The off-spinner then accompanied captain Rohit Sharma to the post-match presser, made the quick announcement, before leaving without taking any questions from the reporters.Ashwin, who will reunite with CSK in IPL 2025after franchise picked up at the mega auction in Jeddah last month, clarified that he will continue his career as a cricketer and play as long as possible.“I am going to play for CSK and don't be surprised if I try and aspire to play for as long as I can. I don't think Ashwin the cricketer is done, I think Ashwin the Indian cricketer has probably called it time. That's it,” he concluded."}},{"headline":"Ashwin contradicts Rohit shortly after retirement; 'unusual' act irks IND legend","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/ANI-20241218423-0_1734584146547_1734584155573.jpg","summary":"Ravichandran Ashwin left Brisbane hours after announcing his retirement, hours after Rohit Sharma's statement that the spin great will be departing a day later.","link":"/cricket/ravichandran-ashwin-contradicts-rohit-sharma-after-retirement-unusual-behaviour-irks-india-legend-sunil-gavaskar-101734548033373.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/ANI-20241218423-0_1734584146547_1734584155573.jpg","text":"Subscribe Now! Get features likeAnd just like that, it was over. Ravichandran Ashwin, the perennial workhorse of Indian cricket, rode into the sunset, announcing his retirement at the end of the third Test between India and Australia in Brisbane without maximum fuss. He kept it simple, yet it turned out to be a highly-emotional series of events. That pre-announcement hug with Virat Kohli, making it official with captain Rohit Sharma next to him, delivering one final hair-raising speech to almost leave the entire dressing room in tears, everything was laden with Ashwin vibes. If, for an entire generation of 90s kids, Sachin Tendulkar's retirement was the end of their childhood, Ashwin's curtain call could be the beginning of the end of their youth. Yep, it's still hitting hard.Ashwin's decision was similar to MS Dhoni's. During the 2014/15 Border-Gavaskar Trophy, Dhoni helped India draw the MCG Test and announced his Test retirement with one match to go. Here, too, Ashwin pretty much did the same, pulling the curtains down on his legendary career even as the series is tantalizingly tied at 1-1. In fact, only a few hours Rohit Sharma informed that Ashwin would be leaving for India a day after, but contrary to what his skipper had to say, the India spinner sped up his departure and took the flight back home later in the day itself. Ashwin took the 11:45 PM flight from Brisbane which landed in Chennai today morning. Before his departure though, Ashwin received a very nice and emotional send-off. However, because he had to leave early due to lack of time, the players, coaches and support staff couldn't have a proper gathering at the team hotel.\"He left from Brisbane on Wednesday night, he wants to be with this family,\" a source close to the team told The Hindustan Times.But while everyone is wishing Ashwin well for the next chapter of his life, the fact that the former India spinner opted to leave Brisbane in the middle of a tour poses some questions. The legendary Sunil Gavaskar was surprised to see Ashwin pack his bags and head back home when the series was undecided with two matches left. For all we know, Ashwin could have started for India in the final Test at Sydney, where playing two spinners has historically been the norm. Gavaskar reckons Ashwin's premature departure now leaves India to arrange a replacement, which, at the last moment, could derail one or more things.\"Even when Mahendra Singh Dhoni retired at the end of the third Test almost 9-10 years ago, it actually leaves you one short. A selection committee has picked so many players for the tour with a purpose. If there's an injury, etc. then someone from the reserves may take up that place. But Sydney is somewhere where everybody talks about there being help for spinners. So, he could have played. India could have played with two spinners you never know. And he would have been there for sure. But yes, normally, you tend to say 'look, at the end of the series, that's it. But in the middle is no usual',\" said Gavaskar on the Star Sports broadcast.However, as Rohit mentioned, he only got to know about Ashwin's decision after landing in Perth last month. And his revelation that he had to 'convince' Ashwin to take part in the pink-ball Test at Adelaide, is a strong indication that Ash's mind was made up. Not getting a place constantly in India's Playing XI when playing in SENA Nations is a debate that has lasted for far too long and it was about time, Ashwin went out on his own terms rather than the decision being forced on him. But then again, with a series, let alone a high-profile one involving two of the top Test teams in the world, how much of a sense does Ashwin leaving make, Gavaskar isn't sure.\"At the end of the day, the person himself knows whether he's got it in him. You could possibly have the ability; it may still be there. But mentally, you may not want to be in the battle. It could happen that way. And therefore, Ashwin, who is a very intelligent person, took the call, thinking he did not really have the drive in him to play international cricket after today. It's a bit surprising because, generally, you expect that when you're picked on a tour, you should honour your commitment and stick around till the end of the tour. Even Dhoni's decision was a surprise because when the selection committee picks you it's for a reason. If you're injured that's another matter, but if in the middle you say that you're not available and are retiring, it just disrupts the whole planning,\" Gavaskar said while speaking to Sports Today.\"I'm certain that the selection committee would be saying to themselves 'look, this is something that could have been avoided'. In Melbourne and Sydney, his bowling and batting could have come in very handy.\""}},{"headline":"Gill, Pant devastated; Jaiswal's voice trembles as R Ashwin bids adieu","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/gill_pant_ashwin_1734573243941_1734573252543.jpg","summary":"Ravichandran Ashwin bid goodbye to international cricket after a celebrated career, leaving teammates like Shubman Gill and Rishabh Pant highly emotional.","link":"/cricket/shubman-gill-devastated-rishabh-pant-absolutely-crushed-as-ashwin-says-goodbye-to-entire-indian-dressing-room-101734572135381.html","contents":{"text":"Subscribe Now! Get features likeIt was an emotional evening for the Indian team in Brisbane as Ravichandran Ashwin bid adieu to international cricket moments after the third Test match of the Border-Gavaskar Trophy series was drawn. Although it was a sudden revelation, Ashwin had reportedly been contemplating the decision for a long time, given his long struggle with knee injuries, but the announcement did leave his teammates devastated.On Wednesday, BCCI shared a video on social media on the Gabba scenes after Ashwin's retirement. It began with the India legend wrapping up his press conference, where he sat alongside captain Rohit Sharma to make the quick announcement. He did not take any question from the media, and left immediately amid a silence in the conference room.Ashwin then met his Aussie counterpart Nathan Lyon and captain Pat Cummins, who handed him a signed Australian jersey, before making his way past the media contingent to the Indian dressing room. The veteran off-spinner was greeted with emotional hugs from Rishabh Pant, who was absolutely crushed, and Yashasvi Jaiswal, who admitted that he is yet to come to terms with the announcement. The video also showed a devastated Shubman Gill sitting alone watching the proceedings from afar.The 38-year-old confirmed in his emotional dressing room speech that he would return back to Chennai on Thursday, and hence won't be part of the series from hereon. However, he assured his teammates that he would keep an eye on the remaining two matches.\"I will be taking a flight back home. But I will be tuned in to watch how well you guys go in Melbourne. I will be looking forward to each one of your performances.\"The international cricketer in me might have come to an end, but the cricket nut in me will never come to an end. All the very best. If at all, you guys need anything, I am just a phone call away,\" Ashwin added.With 765 international scalps in his bag, Ashwin is the second-highest wicket-taker from India after Anil Kumble. Ashwin has taken 537 wickets at an average of 24 in 106 Test matches. He is also seventh on the overall list of wicket-takers."}},{"headline":"Kareena Kapoor channels Anjali from K3G as she cheers for Jeh at school functionKareena Kapoor reminds fans of Anjali from Kabhi Khushi Kabhie Gham as she cheers for son Jeh during his school function.","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/Kareena_Kapoor_Jeh_1734597857526_1734597885157.png","summary":"","link":"/entertainment/bollywood/kareena-kapoor-channels-anjali-from-kabhi-khushi-kabhie-gham-as-she-cheers-for-jeh-at-his-school-function-watch-101734594365619.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/Kareena_Kapoor_Jeh_1734597857526_1734597885157.png","text":"Subscribe Now! Get features likeKareena Kapoor was recently seen attending her son Jeh's school function, along with husband Saif Ali Khan and elder son Taimur. A video of her cheering for Jeh went viral on social media, reminding fans of Anjali from Kabhi Kushi Kabhie Gham.(Also Read: Kareena Kapoor shows PM Modi’s note for her sons ‘Tim and Jeh’, shares pics from Ranbir, Alia, Saif, Neetu's Delhi visit)On Thursday, a Reddit user shared a video of Kareena Kapoor cheering for Jeh. The video showed the actor unable to control her pride and excitement as she saw her son, dressed in an elephant costume, dancing on the stage. Saif Ali Khan, on the other hand, was capturing the moment on his phone while holding Taimur.Many fans remarked on Jeh's charming stage presence and how he seemed to thrive under the spotlight, while others were reminded of Kajol's Anjali from Kabhi Khushi Kabhie Gham. One Reddit user wrote, \"I was instantly reminded of Anjali from K3G. And Jeh for some reason is resembling Krish too.\" Another wrote, \"Kareena has turned into real-life Anjali.\" Another fan commented, \"She's literally so expressive n that one enthusiastic mother, this is cute seeing how much she is interested in Jeh's life.\" Another comment read, \"After seeing that Kareena jeh video I suddenly want to be a mom.\"In her book, Kareena Kapoor Khan’s Pregnancy Bible, the actor said that she loves being a mom as well as acting and didn’t want to give up on anything. Kareena wrote about the advice her mother-in-law, veteran actor Sharmila Tagore gave her, “Her advice was to do whatever I wanted but with confidence. She did some great work in the movies after her marriage and kids and was a real inspiration. My mother is also a strong role model for me, and she and my father both told me I must keep at it. So I thought what the heck! I plunged headlong into not one but two pregnancies and I now have these two tots in my life who make every day feel a little crazy, a little special, a little exhausting, and a little rewarding.”"}},{"headline":"Ram must embody Ram; shouldn’t look like Ravan: Shaktimaan on Ranbir’s Ramayana","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/Ramayana_Ranbir_1734596370928_1734596416850.jpg","summary":"Shaktimaan actor Mukesh Khanna has shared his opinion on Ranbir Kapoor’s casting in Nitesh Tiwari’s Ramayana","link":"/htcity/cinema/ramayanas-rama-ranbir-kapoor-comes-under-mukesh-khanna-s-radar-after-sonakshi-if-they-re-a-lampat-chhichhora-101734595740904.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/Ramayana_Ranbir_1734596370928_1734596416850.jpg","text":"Subscribe Now! Get features likeMukesh Khanna has been dominating headlines all week thanks to his recent comments regarding Sonakshi Sinha’s upbringing. Reminding netizens that Sonakshi didn’t know who Hanuman brought the Sanjeevani herb for in Ramayana during an old episode of Kaun Banega Crorepati, the Shaktimaan star blamed her father Shatrughan Sinha. Slamming Mukesh, Sonakshi had shared a long message which resulted in an ‘apology’ from the former. Well, Mukesh has now turned his focus to Bollywood actor Ranbir Kapoor’s casting as Lord Rama in Nitesh Tiwari’s two-part adaptation of Ramayana.A post shared by Dwapar Promoters (@dwaparpromoters)In a chat with Mid Day, Mukesh remembered Arun Govil, the lead star of Ramanand Sagar's iconic TV series Ramayan. The Shaktimaan actor was quoted saying, “What Arun Govil did with the role has become the gold standard. All I can say is that whoever plays Ram must embody Ram; he shouldn’t look like Raavan. In their real life, if they are a (lampat chhichhora) lewd hooligan, then it will show on screen. If you’re playing Ram, you’re not allowed to party and drink. But who am I to decide who plays Ram?”.Mukesh further talked about Prabhas’ casting as Lord Rama in Om Raut’s 2023 film Adipurush, which was a box office bomb. He explained that despite being a superstar, Prabhas wasn’t accepted in the role because ‘he doesn’t look like Ram’. Coming back to Ranbir, who he described as ‘Kapoor family’s beacon’, Mukesh claimed, “He’s a fine actor… But I will look at his face, and he should look like Ram. He’s just done Animal, and his negative personality was highlighted in that movie. I hope that doesn’t disturb this…”Well, Ranbir’s casting in Ramayana: Part 1 and Ramayana: Part 2 has been a topic of discussion ever since the project was first announced. Some are sure he’ll do justice to the role, whereas others remain sceptical. While RK will be seen as Lord Rama, Sai Pallavi and Rocking Star Yash have joined him as Sita and Ravana. Ramayana: Part 1 is all set to arrive in theatres on Diwali 2026, part two will release on Diwali 2027. How excited are you?"}},{"headline":"Britney Spears drops ‘wildest’ dancing video with spins and slaps; fans worried","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/britneyspears_1734596086233_1734596090452.jpg","summary":"Britney Spears' latest energetic dance video on Instagram has fans divided, with some expressing concern over her behavior while others celebrate her freedom.","link":"/entertainment/music/britney-spears-drops-her-wildest-dancing-video-with-spins-and-slaps-fans-say-scary-to-watch-101734595614433.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/britneyspears_1734596086233_1734596090452.jpg","text":"Subscribe Now! Get features likeBritney Spears is twirling her way back into the spotlight. The pop icon's latest Instagram post has fans talking, with a dance routine that’s equal parts energetic and chaotic. Dressed in a blue bikini during her Mexican getaway, Britney delivered spins, slaps, twirls, and sassy hand moves that left some cheering for her freedom and others reaching for their metaphorical seatbelts. The singer has since shared multiple posts on her IG while also teasing something upcoming.The Toxic crooner turned up the energy in her latest Instagram post, treating fans to a high-energy dance routine. Clad in a bikini, with her hair let loose, and channeling her inner Blackout era, Britney grooved with her signature moves: from playful hip slaps to cheeky thumbs hooked into her bikini bottoms, twirls, and the chaotic energy only she can pull off. She even threw in a surprise cameo from a stuffed animal, just for fun!A post shared by TMZ (@tmz_tv)Also read: Taylor Swift already engaged to Kelce? Fans spot odd detail in Brittany Mahomes’ party picturesWhile fans were thrilled to see her dancing freely, some couldn't help but express concern over her intense energy, pointing out that she twirled with such vigor she nearly lost her balance and kept guessing the meaning behind her bizarre hand gestures.The clip felt like a nostalgic nod to the Britney of pre-conservatorship days. In the caption, she shifted focus from her moves to highlight her new bikini, freshly styled hair, and even a casual mention of a jet-skiing mishap that left her with an injured hand.“It‘s just heartbreaking , she‘s just a shadow of herself now,” a fan commented on the video. “Well on the bright side…30 mins of cardio activity a day is recommended sooo at least she’s moving,” another chimed in. “Is it just me or is this not “normal”?” a third added. “I wish somebody could help her, I see a woman in pain and self-medicating. I don't know many old addicts do you ?” a fourth expressed concern. “Everyone who participated In the #freebritney movement 👏🏼 Now do you think she needs help?” “Scary to watch…”The #FreeBritney movement brought her struggles to light, eventually leading to the end of the conservatorship in 2021. The singer has a history of struggling with fame and mental health issues, which led to a conservatorship in the past.A post shared by XILA MARIA RIVER RED (@britneyspears)Britney Spears is once again grabbing headlines with her latest social media antics, leaving fans torn between admiration and concern. From claiming she’s started a kindergarten in Mexico and is now “five years old” to posting her signature high-energy dance videos, the pop icon continues to keep everyone guessing.Also read: Katie Holmes reveals ‘touching’ birthday gift from daughter Suri Cruise: ‘Grateful’While some close to Britney worry about her unpredictable behavior, others say it’s just her way of having fun and seeking a bit of attention. “Britney is brushing off new concerns for her wellbeing and angrily insisting that people back off and leave her alone – even though there are justifiable fears about her erratic behavior that are growing inside her inner circle,” a source told InTouch.However, the singer’s journey from conservatorship to reclaiming her freedom hasn’t been easy, and she’s determined to live on her own terms and that's what keeps her fans convinced everything is ok with the popstar. Others though, are left walking the fine line between celebrating her independence and wondering if they should be worried—or just let her be.While the source dismissed any serious concerns, they noted that Britney enjoys sharing her quirky side but also gets frustrated when people react or speculate about her behavior. Those close to her try to check in without overstepping boundaries. "}},{"headline":"Starbucks is not exiting India: Tata Consumer denies ‘baseless’ reportTata Consumer Products has denied a report suggesting American coffee chain Starbucks could exit India soon due to rising losses and high operating costs","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/SBX20240820-FallMenu-Feature_1724323233675_1734598057984.webp","summary":"","link":"/trending/starbucks-is-not-exiting-india-tata-consumer-denies-baseless-report-of-coffee-chain-quitting-country-101734598006571.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/SBX20240820-FallMenu-Feature_1724323233675_1734598057984.webp","text":"Subscribe Now! Get features likeTata Consumer Products has denied a report suggesting American coffee chain Starbucks could exit India soon due to rising losses and high operating costs. In letters to three major Indian stock exchanges, Tata Consumer Products called the report “baseless.”On December 19, a Rajasthan-based media organisation, called The Philox, published a report suggesting Starbucks could soon leave India. Published with the headline “Starbucks to Exit India Due to High Costs, Bad Taste, and Mounting Losses,” the report speculated that the hugely popular coffeehouse chain could shut shop in India due to price-conscious Indian consumers preferring cheaper local substitutes.Starbucks had entered India in 2012 through a partnership with Tata Consumer Products. The Philox report did not quote any Tata official and acknowledged that “no official statement has been made” even as it claimed that Starbucks beverages are perceived as “overpriced and shallow” in India.“Despite its ambitious plans, Starbucks has struggled to turn significant profits in the Indian market,” the report said.It was published days after Starbucks India confirmed that it would delay the planned launch of new store openings.Tata Starbucks Private Limited, the joint venture of Tata Consumer Products Limited and American coffee chain Starbucks, saw its losses widen to ₹81 crore and revenue from operations grow 12% in fiscal year 2024, according to TCPL's annual report released in May this year.However, TCPL denied the possibility of exiting India in a letter titled “Clarification on News Article Titled - Starbucks to Exit India Due to High Costs, Bad Taste, and Mounting Losses.”“The Company would like to state that the information in the said article is Baseless,” Tata Consumer Products said in a letter addressed to the National Stock Exchange of India, Bombay Stock Exchange, and Calcutta Stock Exchange.“Reports of Starbucks looking to exit India (are) completely false and baseless. Tata’s relationship with Starbucks stands strong with shared values and commitment to India,” the company further told CNBC-TV18.However, Tata Consumer CEO Sunil D'Souza told Reuters on Monday that it will delay plans for some new Starbucks store openings until as fewer customers are walking into its cafes in India."}},{"headline":"Chinese man gets ₹3.2 crore gift after discovering his ex's affair","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/Breakup_1734597561426_1734597567622.jpg","summary":"A court in China ruled that a man is not obligated to return the 300,000 yuan his ex-girlfriend gave him as an apology.","link":"/trending/chinese-man-gets-3-2-crore-gift-after-discovering-exs-affair-with-his-nephew-101734597021529.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/Breakup_1734597561426_1734597567622.jpg","text":"Subscribe Now! Get features likeA Shanghai court has ruled that a man, surnamed Li, is not obligated to return the 300,000 yuan ( ₹3.2 crore) his ex-girlfriend, Xu, gave him in an attempt to salvage their relationship after he discovered her affair with his nephew, reported the South China Morning Post (SMRC).Li and Xu began dating in 2018, but their relationship hit a significant setback in 2020 when Li learnt about Xu’s infidelity with his nephew, according to the Shanghai Morning Post. Furious over the betrayal, Li wanted to end their relationship. However, Xu wrote him a letter of apology, admitting to her actions.“I have deeply reflected on my mistakes. Yes, I’ve cheated on you multiple times, causing you immense pain,” Xu wrote in her letter. “I am sincerely remorseful. I will correct my mistakes and compensate you with my sincerity,” SMRC reported.In the two days following her apology, Xu transferred 300,000 yuan to Li in several bank transactions as a gesture of remorse. Li forgave her, and the couple continued their relationship.Also read: China to build world’s largest artificial-island airport to handle 43 million passengersHowever, in 2022, Li discovered that Xu was still involved with his nephew, prompting him to end the relationship for good. Following their breakup, Xu demanded the return of the 300,000 yuan, arguing that the money had been intended as a conditional gift tied to their eventual marriage. Since the marriage never occurred, she claimed Li was obligated to return the amount.Li refused, stating that Xu’s repeated infidelities had caused him significant emotional pain and that the money was given voluntarily as compensation for her actions.Xu took the matter to court in Shanghai earlier this year. After reviewing the case, the court determined that the funds were voluntarily transferred by Xu to mend their relationship and could not be classified as a conditional gift. The court ruled in Li’s favour, concluding that he was not required to return the money.The case has generated widespread discussion on Chinese social media. One netizen remarked, “My God, their relationship is so chaotic!” Another commented, “It’s more dramatic than novels or television dramas.”Also read: Chinese man arrested for operating 400 phones to win gifts in Live-Stream rafflesOthers viewed the issue from a different angle, with one user noting, “The money was compensation for the loss of love and loyalty.”Infidelity has been a recurring theme in recent headlines in China. In August, a violent altercation in Zhejiang province between two senior doctors over a nurse they were both romantically involved with left one of the doctors hospitalised in the intensive care unit he oversees. "}},{"headline":"Indian man rejects fresher's LinkedIn text for not calling him sir. Here's why","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/businessman-working-analysis-business-information_27d266a6-7b3f-11e7-ba32-a280bea68af6_1734595533712.jpg","summary":"A LinkedIn message from a fresh graduate to a senior sparked debate over addressing conventions on social media.","link":"/trending/indian-man-rejects-freshers-linkedin-message-for-not-calling-him-sir-son-you-are-101734595195608.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/businessman-working-analysis-business-information_27d266a6-7b3f-11e7-ba32-a280bea68af6_1734595533712.jpg","text":"Subscribe Now! Get features likeUsing LinkedIn messages to connect with recruiters, hiring managers, or professionals in desired industries to seek job opportunities is a common practice. Job seekers also reach out to alumni from their university to seek guidance or help in securing positions.However, one such routine message by a young man did not sit well with one of his college senior. Writer and columnist Saket took to X to share his reaction to a message he received on LinkedIn. He said a young fresher reached out to him in a message and informed him that they both graduated from the same institute.However, the writer said that he \"lost\" him when he addressed him by his name and did not user \"sir\".\"Call me old fashioned but had connected with a young fresh 2025 pass out from my college when he sent message on LinkedIn. His first message started with - Hi Saket, we are from same college…. And he lost me there itself. Son, you are 2025 pass out and address 1994 pass out with first name. I still address 1993 and earlier pass out as ‘Sir’. This Americanised culture,\" he wrote in the post.When someone asked him, if using \"Saket ji\" would be better, he said: \"No. I would still be surprised. It isn’t about what but who. Matters little when addressed by first name by people in work place. In my college, this wasn’t a thing. It isn’t still. So I was amused.\"The post quickly went viral and gained over 1.1 million views. Some users were taken aback by the writer's response, while others agreed that the young seeker should have addressed him “properly”.\"The college rule of calling seniors as \"sir\" is outdated. It was rooted in the culture of bullying and servitude, and with a fake assumption of preparing for the corporate India of those years that people need to call someone at a higher designation than them as sir,\" opined one user.(Also read: 'Don't build careers, rent people': CEO's advice on hiring confuses internet)\"I seriously get this. The GenZ are mostly entitled. They don't believe in respect and discipline. Forget respect, I feel good if they come to work on all days of the week,\" wrote another user."}},{"headline":"Indian techie says she’s happier in London: 'I’ve been groped in locals, metros'","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/Bengaluru_London_1734594448569_1734594485061.png","summary":"An Indian software engineer says she is happier after relocating from Bengaluru to London, despite the high cost of living in the British capital.","link":"/trending/indian-techie-says-she-s-happier-in-london-i-ve-been-groped-in-locals-metros-in-delhi-mumbai-101734593829506.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/Bengaluru_London_1734594448569_1734594485061.png","text":"Subscribe Now! Get features likeAn Indian software engineer says she is generally happier after relocating from Bengaluru to London, despite the high cost of living in the British capital. Sayani B took to the social media platform X last night to talk about her newfound sense of contentment, starting a lively discussion on the pros and cons of living in India vs abroad.In her X post, Sayani said she relocated to London a couple of months ago and has since found herself to be happier, even though she could not pinpoint the exact reason. “It's been a couple of months living in London, and I am in general, happier. I can't point at what exactly has been a game changer, but it's an overarching feeling,” she tweeted. People in the comments section offered their own opinions on why the Indian techie was happier living abroad.Several people said that the cleaner air of London could be one major factor. “It's the cleaner air, walkable roads and freedom that makes you feel happier,” X user Shravani wrote.Sayani agreed to this, adding that the added safety of living in London also played a part in her happiness. She revealed that she had been groped in several Indian cities like Delhi and Mumbai, but nothing like that had ever happened to her in London.“Add - general sense of safety to that list. I have been groped in crowded local trains and crowded metros in Delhi, Kolkata, Mumbai. Never here. And I take public transport every day here,” the Indian techie wrote. Another X user pointed to a drawback of living in London - the wretched weather, to which Sayani replied: “It's not as bad, especially for someone who has lived through the clogged roads of Bangalore everytime it rained.”“Everything is good with London except it’s crazy expensive & public mugging in centre has increase a lot,” X user Alex Shore said.Sayani replied: “It is indeed one of the most expensive cities to live in the world. Happiness comes at a cost I guess.”The topic of living in India vs abroad has been discussed and dissected thoroughly on social media. Earlier this year, an IITian couple moved back to India after 10 years of living abroad and went viral after they shared their take on the differences between the two countries."}},{"headline":"Mumbai boat accident survivor recalls ‘mutilated body’ crashing on ferry deck","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/ANI-20241218391-0_1734532956512_1734583868503.jpg","summary":"A survivor of the Mumbai boat accident shared his harrowing account of the crash and its aftermath, where 13 people lost their lives.","link":"/trending/mumbai-boat-accident-survivor-recalls-mutilated-body-crashing-on-ferry-deck-after-impact-101734583609874.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/ANI-20241218391-0_1734532956512_1734583868503.jpg","text":"Subscribe Now! Get features likeA survivor of the Mumbai boat accident that claimed 13 lives has opened up about the moment of impact and its aftermath. At least 13 people died and two were critically injured after a passenger ferry capsized off the coast of Mumbai on Wednesday evening. The ferry was hit by an out-of-control Indian Navy speedboat while plying tourists to Elephanta Island.The collision occurred close to Butcher Island around 4 pm on Wednesday, December 18.The ferry had approximately 110 passengers including 20 children, according to Indian Navy officials. Among the deceased, 10 were civilians, and three were Navy personnel.Gautam Gupta was travelling on the ferry between Mumbai and Elephanta Island when the collision occurred. The 25-year-old recorded a video of the moment of impact. Gupta told Times of India that he presumed the Indian Navy speedboat was doing stunts in the sea, and therefore started recording it. He said that the force of the impact was such that the speedboat’s passengers were flung into the air.\"I was recording the video of a speedboat presuming it was doing stunts when it suddenly hit our ferry. To my utter disbelief and shock, on impact, one of the speedboat's passengers was flung into the air and crashed on the deck of our ferry just beside me. His motionless body was badly mutilated,\" said Gautam Gupta.Gupta was on his way to Elephanta Caves with his aunt and his cousin when the collision occurred. His aunt remains missing. He and his cousin, Rinta Gupta, are currently receiving treatment at St George’s Hospital with other survivors.“Mumbai boat accident” has become one of the top trends on Google after the tragedy. In the past 24 hours, the term has seen over 20,000 searches. According to Google Trends, the search interest began around 5.30 pm on December 18 and peaked in the early hours of December 19. At around 4.10 am on December 19, the search term reached peak popularity.The maximum interest came from Maharashtra, followed by Goa and Tripura. Related search queries included “Boat accident in Mumbai” and Elephanta Caves."}},{"headline":"Parliament Live: BJP to file FIR against Rahul Gandhi after 2 MPs injuredParliament Winter Session LIVE: Session entered its penultimate day on Thursday amid the row over Home Minister Amit Shah's remarks on Dr BR Ambedkar, for which the opposition has been demanding Shah's resignation.","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/parliament_winter_session_amit_shah_ambedkar_1734590783330_1734590783647.jpg","summary":"","link":"/india-news/parliament-winter-session-live-jpc-one-nation-one-election-amit-shah-ambedkar-remarks-congress-bjp-lok-sabha-101734576537945.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/parliament_winter_session_amit_shah_ambedkar_1734590783330_1734590783647.jpg","text":"Parliament Winter Session LIVE: The Winter Session is set to end on Friday and some big business remains amid political slugfest over several issues, the biggest one at present being Amit Shah's remarks on BR Ambedkar. Two BJP MPs were injured in what they claimed was a result of pushing by Congress and opposition members....Read MoreParliament Winter Session | Key points   Parliament Winter Session LIVE: Rajya Sabha deputy chairman Harivansh dismissed the opposition's impeachment notice seeking the removal of the chairman, sources told news agency PTI.Parliament Winter Session LIVE: Union minister Rijiju has demanded an apology from Rahul Gandhi for using force against women in the parliament complex after two BJP MP's were injured during a commotion.Parliament Winter Session LIVE: Leader of Rajya Sabha J P Nadda condemned Rahul Gandhi's conduct with BJP MPs in Parliament complex. Members of both parties have arrived at the Parliament complex police station to file FIRs against the other. Rajya Sabha proceedings adjourned for the day amid continuous uproar by treasury, opposition benches over Ambedkar issue.Lok Sabha proceedings adjourned for the day amid continuous uproar by treasury, opposition benches over Ambedkar issue.BJP legal team along with party MPs Anurag Thakur, Bansuri Swaraj, and others reached Parliament Street police station to file a complaint against Congress MP and Lok Sabha LoP Rahul Gandhi.AAP convener Arvind Kejriwal said on Thursday: \"A day before yesterday, Union Home Minister Amit Shah made a statement in Parliament. His words were insulting but his tone clearly expressed his repressed anger for Babasaheb Ambedkar. If he had said it only once, we could have thought it was a mistake. However, PM Modi supported his statement the next day.\" Samajwadi Party MP Awadesh Prasad arrived at Delhi's RML Hosptial to meet injured BJP MP Pratap Chandra Sarangi.\"Whatever happened is sad and against democratic beliefs. This should not happen by anyone. There is some decorum of the House, and it should be maintained by everyone,\" he said to the mediaAnurag Thakur, Bansuri Swaraj and Hemang Joshi will file an FiR against Rahul Gandhi for pushing two BJP MPsUnion Ministers Pralhad Joshi and Shivraj Singh Chouhan meet BJP MPs Pratap Sarangi and Mukesh Rajput at Delhi's Ram Manohar Lohia Hospital.Pratap Sarangi and Mukesh Rajput allegedly sustained injuries during commotion between INDIA and BJP MPs.BJP MP Nishikant Dubey confronted LoP Rahul Gandhi while checking on BJP's Pratap Sarangi, who was allegedly injured. PM Modi has called BJP's Pratap Sarangi and Mukesh Rajput and inquired about their health after the injuries in Parliament today.BJP is exploring legal options against Congress MPs for pushing Pratap Sarangi and Mukesh Rajput of the BJP, who have sustained injuries.Competing marches by opposition and NDA MPs led to shoving and jostling inside Parliament House premises on Thursday with BJP's Sarangi and Rajput getting injured in the melee amid allegations that Congress leader Rahul Gandhi pushed him.Amid opposition's faceoff with the ruling BJP-led alliance in Parliament, in which 2 BJP MPs were injured on Thursday, Union Minister Shivraj Singh Chouhan said, \"...This is a black day in Parliamentary history. Decorum has been torn apart. Democracy has been shredded and sullied. There is no other example like that of the hooliganism of Rahul Gandhi and Congress party...Such conduct was never seen in the Parliamentary history of India. Why are they releasing their frustration in Parliament if they lost Haryana and Maharashtra?...A workshop should be called to train Rahul Gandhi and Congress people to understand the conduct in democracy...I am sad...Amit Shah's speech exposed Congress...They are so frustrated with it that they have stooped to hooliganism now. We condemn this hooliganism...\" TDP MP Appalanaidu Kalisetti met BJP MPs Mukesh Rajput and Pratap Chandra Sarang at RML Hospital. They have been after sustaining injuries during jostling with INDIA Alliance MPs.  Samajwadi Party MPs, including actor-politician Jaya Bachchan, and other INDIA bloc members protested at Parliament premises over Union Home Minister Amit Shah's statement on Babasaheb Ambedkar.BJP MP Mukesh Rajput got injured allegedly due to a push by Rahul Gandhi in Parlisment. His condition is serious and he has been admitted to the ICU of RML hospital, according to news agency ANI.Leader of the Opposition in the Rajya Sabha and Congress president Mallikarjun Kharge has submitted a privilege notice against the Union Home Minister for remarks on Dr Ambedkar in the Rajya Sabha on December 17.According to ANI, BJP MP Pratap Chandra Sarangi says, \"Rahul Gandhi pushed an MP who fell on me after which I fell down...I was standing near the stairs when Rahul Gandhi came and pushed an MP who then fell on me...\"MPs of INDIA bloc climb the walls of Makar Dwar at the Parliament and protest with placards demanding an apology and resignation of Union Home Minister Amit Shah over his remarks on Babasaheb Ambedkar in Rajya Sabha, ANI reportedAmid uproar after 4 motions of the opposition under rule 267 were dismissed, Rajya Sabha adjourned till 2 PMMinutes after beginning, Lok Sabha proceedings adjourned till 2 PMThe BJP triggered another row over alleged insult to BR Ambedkar by sharing an edited photo of the opposition MPs' protest. The pictures of Dr. Ambedkar were replaced by that of George Soros.Congress' KC Venugopal reacted to it and said,\" The BJP is brazen in its insult and ridicule of Dr. Ambedkar. Instead of submitting ensuring the Home Minister is removed from his post for the immense hurt caused to the crores of Babasaheb’s followers by Amit Shah’s statements, they are doubling down on the ridicule.\"Lashing out at the BJP over Amit Shah's remarks on Babasaheb Ambedkar, Congress MP Priyanka Gandhi Vadra said on Thursday that they do not have basic respect for the person who is regarded as the Constitution maker.BJP MPs staged a protest in front of the parliament building alleging insult to BR Ambedkar amid Amit Shah remarks row.Amid a controversy over Union Home Minister's remarks on Babasaheb Ambedkar, Rashtriya Janata Dal Chief Lalu Prasad Yadav said on Thursday that Amit Shah has gone mad and he should renounce politics and leave.\"Amit Shah has gone mad. He must have hatred for Babasaheb Ambedkar. We condemn this madness of his. Babasaheb Ambedkar is great. He should renounce politics and leave,\" Lalu Yadav said, according to ANI.Former Union ministers Anurag Thakur and P P Chaudhary from the BJP, and Priyanka Gandhi Vadra of the Congress are set to be among the 21 Lok Sabha members, who will be part of the joint committee of Parliament that will scrutinise two bills on simultaneous elections.Parshottambhai Rupala, Bhartruhari Mahtab, Anil Baluni, C M Ramesh, Bansuri Swaraj, Vishnu Dayal Ram and Sambit Patra are among the BJP's Lok Sabha members to be part of the panel.Manish Tewari and Sukhdeo Bhagat of the Congress, Shrikant Shinde of the Shiv Sena, Dharmendra Yadav of the Samajwadi Party, Kalyan Banerjee of the TMC, T M Selvaganapathi of the DMK, G M Harish Balayogi of the TDP, Supriya Sule of the NCP (Sharad Pawar), Chandan Chauhan of the RLD and Balashowry Vallabhaneni of the Jana Sena Party are other Lok Sabha members, according to PTI.Dr BR Ambedkar's grandson Prakash Ambedkar on Wednesday alleged that Home Minister Amit Shah's remarks on the father of the Constitution reflected the Bharatiya Janata Party’s (BJP) ‘same old mentality’. Read here what the Vanchit Bahujan Agadi leader said.The Congress has planned a countrywide protest on Thursday seeking Union home minister Amit Shah's resignation amid a row related to his remarks on BR Ambedkar, which he made on Tuesday in Rajya Sabha. More details here.HM Amit Shah held a press conference and accused Congress of being \"anti-BR Ambedkar and anti-Constitution\".Shah responded to Congress chief Mallikarjun Kharge's call for his resignation, saying it won't make a difference to the Congress party's fate. Shah claimed that the Congress party will remain in the opposition for the next 15 years, regardless of his resignation. More details hereCongress MP Manickam Tagore on Thursday submitted an Adjournment Motion notice in the Lok Sabha, demanding an urgent discussion on remarks made by Union Home Minister Amit Shah during his Constitution Day speech in the Rajya Sabha, and called for both an apology and resignation from him, PTI reported.The Union government will formally move a motion in the Lok Sabha on Thursday to constitute a joint parliamentary committee (JPC) on two bills that aim to usher in simultaneous national and state elections, and propose the names of 21 lawmakers of the Lower House as members. More details here."}},{"headline":"Ambedkar row: Parl in chaos, Rahul's 'push' sends BJP MPs to ICU; Cong reacts","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/ambedkar_remarks_amit_shah_parliament_1734589150646_1734589175764.jpg","summary":"Leader of Opposition in the Lok Sabha Rahul Gandhi and his MP sister Priyanka Gandhi were part of the opposition leaders who protested on Makar Dwar.","link":"/india-news/ambedkar-row-amit-shah-high-drama-parliament-opposition-makar-dwar-rahul-gandhi-push-injures-bjp-mp-101734587183028.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/ambedkar_remarks_amit_shah_parliament_1734589150646_1734589175764.jpg","text":"Subscribe Now! Get features likeThe political slugfest over Amit Shah's remarks on BR Ambedkar saw dramatic escalation on Thursday, placing the Opposition atop the 'Makar Dwar' of Parliament in protest and leaving two Bharatiya Janata Party (BJP) MP injured due to what allegedly was the result of a push by Congress MP Rahul Gandhi.Amit Shah's remarks on BR Ambedkar he made in Rajya Sabha on Tuesday have stirred a massive row, with the Congress-led Opposition seizing on the comments to corner the Bharatiya Janata Party (BJP)-led central government and also demanding the Home Minister's resignation. Amping up their attack on Amit Shah and the BJP-led central government, MPs of opposition camp 'INDIA' climbed the Makar Dwar of Parliament on Thursday with placards demanding an apology and resignation of Home Minister Amit Shah.Trouble began when the INDIA bloc members insisted on entering Parliament through the BJP MPs holding a protest instead of using the space left empty on one side of the staircase of the Makar Dwar, used by members to enter and exit the building.Leader of Opposition in the Lok Sabha Rahul Gandhi and his MP sister Priyanka Gandhi were part of the opposition leaders who protested on Makar Dwar.Parallely to opposition's protest in Parliament, BJP MP Pratap Chandra Sarangi alleged that he was left injured after Rahul Gandhi pushed a parliamentarian who, taking him along, fell down. \"Rahul Gandhi pushed an MP who fell on me after which I fell down...I was standing near the stairs when Rahul Gandhi came and pushed an MP who then fell on me,\" said Pratap Chandra Singh, who was being moved on a wheelchair with a handkerchief placed on his forehead, seemingly over a wound.Mukesh Rajput and Pratap Sarangi, the BJP MPs injured, were admitted to the Intensive Care Unite (ICU) of Delhi's Ram Manohar Lohiya (RML) Hospital over the injuries they sustained. While it was learnt that BJP was considering legal action against Congress over the matter, Congress president Mallikarjun Kharge also later alleged he was physically pushed in Parliament.Responding to the allegations, Rahul Gandhi said BJP MPs were trying to stop him and were threatening him. “I was just trying to go inside the Parliament and BJP MPs were trying to stop me, threatening me. This is what has happened... This is the entrance of Parliament House and we have a right to go inside.”BJP's Anurag Thakur, Bansuri Swaraj and Hemang Joshi were reportedly planning to file an FiR against Rahul Gandhi over the alleged push that injured two BJP MPs.Congress later also shared a video of MP Priyanka Gandhi Vadra and party chief and Rajya Sabha LoP Mallikarjun Kharge when they were allegedly being stopped by ruling party MPs while entering Parliament on Thursday.Congress president Mallikarjun Kharge, alleging he was physically pushed by BJP MPs, said in a letter to Lok Sabha Speaker, “This morning INDIA party MPs marched from the statue of Dr Ambedkar t Prerna Sthal to Maka Dwar. This was to protest against the insulting remarks on Dr Ambedkar made by Union Home Minister in his speech in Rajya Sabha on December 17, 2024.”  “When I reached Makar Dwar along with the IDNIA parties MPS, I was physically pushed by BJP MPs. I lost my balance and was forced to sit down on the ground in front of Makar Dwar, this inflicted injury on my knees which have already undergone surgery,” Kharge added. The Director and Medical Superintendent of RML informed that Pratap Sarangi and Mukesh Rajput were in ICU, adding that a team of doctors is providing treatment to stabilise them.Investigations like CT scan and others are undergoing, told RML MS Ajay Shukla.\"MP Pratap Sarangi was brought to the hospital, with a deep cut on his head, and till the time of arrival at the hospital, had lost a lot of blood. \"Doctors have stitched the cut for him,\" Shukla said.“Meanwhile, MP Mukesh Rajput, was brought with some head injury and high blood pressure. The team is providing all necessary treatment to the two,” he added.It all started from Amit Shah's remarks on Tuesday in Rajya Sabha that Congress leaders would have got a place in heaven had they chanted the name of God rather than following the “fashion of repeating Ambedkar’s name”.\"Abhi ek fashion ho gaya hai - Ambedkar, Ambedkar, Ambedkar, Ambedkar, Ambedkar, Ambedkar. Itna naam agar bhagwan ka lete to saat janmon tak swarg mil jata (It has become a fashion to say Ambedkar, Ambedkar, Ambedkar, Ambedkar, Ambedkar, Ambedkar'. If they had taken God's name so many times, they would have got a place in heaven),\" Shah had said.Amit Shah had also said the BJP is happy that the Congress is taking Ambedkar's name but the party should also speak about its real sentiments towards him."}},{"headline":"SC stays Kerala HC’s ‘impractical’ guidelines on using elephants in temple festivals","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/150x84/Priests-and-devotees-perform-rituals-of-15-caparis_1734596568677.jpg","summary":"The bench passed the order in response to appeals filed by the Thiruvambady and Paramekkavu devaswoms, organisers of Kerala’s iconic Thrissur Pooram festival.","link":"/india-news/sc-stays-kerala-hc-s-impractical-guidelines-on-using-elephants-in-temple-festivals-101734596575709.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/Priests-and-devotees-perform-rituals-of-15-caparis_1734596568677.jpg","text":"Subscribe Now! Get features likeThe Supreme Court on Thursday stayed a series of restrictions imposed by the Kerala high court on the use of elephants in temple festivals, describing them as “impractical” and exceeding judicial authority. Among the high court’s directives were mandates for a minimum 3-metre gap between two elephants, an 8-metre distance between elephants and the public or percussion displays, and a 100-metre buffer from areas where fireworks are used. Additionally, the high court required elephants to have at least three days of rest between public exhibitions.“Any direction issued by the high court contrary to the Kerala Captive Elephants (Management and Maintenance) Rules, 2012, shall remain stayed,” ordered a bench of justices BV Nagarathna and N Kotiswar Singh, in effect staying the additional guidelines issued by the high court in November. The bench passed the order in response to appeals filed by the Thiruvambady and Paramekkavu devaswoms, organisers of Kerala’s iconic Thrissur Pooram festival. The bench remarked that the high court’s directions ventured into the domain of rule-making, which is the prerogative of legislative and executive authorities.The high court had in previous proceedings last month observed that using elephants in temple festivals was not an essential religious practice. It had also noted that the guidelines were issued to complement the existing rules and make them more effective.Last week, the high court also issued a contempt notice to an officer of the Cochin Devaswom Board for allegedly breaching its guidelines on parading elephants at temple festivals. The high court had based its guidelines on recommendations from experts, including PS Easa, a former director of the Kerala Forest Research Institute. Easa, a member of the expert committee in the Arikomban elephant case, had warned that relaxing the 3-meter rule could increase risks of mishaps involving the animals. The devaswoms, however, argued before the Supreme Court that the directives were not only impractical but also posed a significant threat to the continuity of traditional festivals. For instance, under the high court’s 3-metre distance rule, the number of elephants at festivals like the one held at Thripunithura Poornathrayeesa temple, which typically parades 15 elephants, would have to be drastically reduced. This, the devaswoms argued, would disrupt the cultural and religious significance of poorams, central to Kerala’s temple traditions.Staying the high court order for the time being, the Supreme Court bench clarified that its intervention was not to compromise safety but to ensure that judicial directions do not conflict with the 2021 rules which is a piece of valid legislation.The court’s stay brings relief to temple authorities as the annual festival season in central Kerala is underway, beginning with the Thripunithura Poornathrayeesa festival in late November."}},{"headline":"RG Kar rape case: Parents of victim move Calcutta HC seeking fresh probe","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/rg_kar_rape_case_kolkata_1734596134094_1734596134424.jpg","summary":"Parents of the victim cited lack of confidence in the ongoing probe into the incident that led to huge protests.","link":"/india-news/rg-kar-hospital-rape-case-parents-of-victim-move-calcutta-hc-seeking-fresh-probe-101734595239638.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/rg_kar_rape_case_kolkata_1734596134094_1734596134424.jpg","text":"Subscribe Now! Get features likeParents of the trainee doctor who was allegedly raped and murdered at the RG Kar hospital of West Bengal's Kolkata in August this year moved the Calcutta High Court on Thursday, seeking a fresh investigation into the alleged crime.Citing lack of confidence in the ongoing probe into the incident that led to huge protests, the parents of the RG Kar Hospital rape and murder victim prayed for a direction for a fresh investigation into the rape and murder of their daughter, news agency PTI reported.Justice Tirthankar Ghosh asked their lawyer to add the Central Bureau of Investigation (CBI), which is probing the case, as a party in the petition and mention the matter again before the court on Monday, December 23.The on-duty postgraduate trainee doctor's body was found in the seminar room of the RG Kar Medical College and Hospital on August 9 this year. A Kolkata Police civic volunteer, Sanjay Roy, is the prime accused in the case.The Sealdah court on December 13 granted bail to RG Kar Medical College and Hospital ex-principal Sandip Ghosh and Tala police station's officer-in-charge Abhijit Mondal in the case.They were granted bail as the CBI failed to file charge sheets against them within the 90-day statutory period, according to their lawyers.While Ghosh was accused of tampering with evidence in the case, the police officer was accused of delaying the filing of an FIR after the body was found.CBI has filed a charge sheet against the Sanjay Roy.In its charge sheet, the CBI said Roy, who was working as a civic volunteer with the local police, allegedly committed the crime when the victim had gone to sleep in the hospital's seminar room during a break."}},{"headline":"Love and Relationship Horoscope for December 19, 2024Daily Love Horoscope December 19, 2024: Favourable stars in love today. Find daily astrological predictions for all sun signs.","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/18/550x309/photo-1504122398460-c635d6377010_1731621144550_1734526258168.jpg","summary":"","link":"/astrology/horoscope/love-and-relationship-horoscope-for-december-19-2024-101734526163193.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/18/550x309/photo-1504122398460-c635d6377010_1731621144550_1734526258168.jpg","text":"Subscribe Now! Get features likeAries: Your kind and loving disposition is the focus of your interactions today. Your attentiveness to your partner’s needs and ability to meet them emotionally and physically will make everything magical. If you are in a relationship, your partner will feel valued and may, in turn, shower you with more affection than you expected. Singles might attract someone who is attracted to your kind nature, creating the foundation for a deep relationship.Taurus: Today, partnership is the key to the success of your relationships. Achieving our goals is not a one-man show; it is all about teamwork. If you are in a relationship, this is the time to share your dreams and feelings with your partner. If you are ready to share your dreams and difficulties with them, you will find them supportive. This is a day to rely on your immediate circle of friends for single people.Gemini: Your energy is in harmony with someone with enthusiasm for life like yours. Friendships have a special energy today, so go ahead and call or message your friends to maintain those bonds. It doesn’t matter if it is love or an old-time connection; the positive interactions will take your bonding to the next level. Be receptive and watch the miracles happen! If committed, work on the communication and add more fun to the relationship.Cancer: The cosmic energy for today is perfect for the creative manifestation of love in your relationship. Expressing your feelings in the most romantic way possible might be good. Such gestures of self-exposure and imagination can enhance the connection and give both of you the sense of being valued. For single people, this is a day to be creative. It is always good to let out your emotions through words, music or art to find someone who will vibe with your energy.Leo: Today holds many romantic opportunities and sweet moments to fill your heart with happiness. Your partner will look at your gestures differently, making you realise there is still some magic in your relationship. Your attempts to cheer them up will not be ignored, and the appreciation you receive will strengthen your relationship. For singles, this energy could be expressed in flirty gestures towards that special someone.Virgo: Pay attention to your emotional self and adopt a more accurate definition of what makes you happy. This is a good time to sit down with your partner and discuss your expectations in the relationship. This means that it is possible to free yourself from certain patterns that do not allow for a new positive change. Your partner may shock you by supporting your new-found clarity. Singles believe in this process of rejuvenation.Libra: Today is all about being present with the people you love. Be attentive and try to listen to your partner carefully with interest. By listening to them, you will enhance the rapport and trust that is required in any relationship. Do not be quick to assume something about your partner. Encourage them to celebrate their achievements, no matter how little, and make them feel appreciated for their work. Laughter and encouragement can strengthen the bond.Scorpio: Today feels like a fairy tale in the making, as you and your partner are in a dreamy state of connection. The energy is sweet and uplifting, but do not be carried away by the idealism. If you are in a relationship, do not be upset about each other’s flaws because they make you both real people. Singles should embrace the beauty of new relationships, but they should also be ready to stay grounded.Sagittarius: This is a day of romance, and there is someone special that will catch your eye. This person is relaxed and truly cares about what you like, and you start to feel like you are becoming friends. Now is the best time to step back from the daily grind and see this new relationship develop. Embrace this new energy in your life. Whether it is a conversation that becomes more serious or enjoyable, this will create fresh energy in your life.Capricorn: If you’re in a situation where you’re confused about what to do next, it is possible that the best way to find out is to show your love and care to your partner. For those in a relationship, try to be gentle with your partner rather than over-analysing and over-communicating. These gestures will speak louder of your love. Singles, this is your opportunity to show interest in a more discreet but powerful way. A smile or an offer to assist can go a long way.Aquarius: Real love is one in which you can be happy and grow together without changing who you are. If previous relationships have made you feel like you had to lose parts of yourself, then this is a time to pause and recover. You should have a love that embraces you and encourages you to be the best person that you can be. It is high time for those in a relationship to assess if you are being genuine to yourself. Be honest with your partner.Pisces: You are loyal and dependable, qualities that will make you a strong support for whoever you are with. Today, the stars suggest that you should share your feelings with others as this will strengthen your relationships. Whether through words of affirmation or acts of care, demonstrating emotions will help your partner—or someone special—remember that they are safe with you. But do not be overly possessive of your feelings.Neeraj Dhankher(Vedic Astrologer, Founder - Astro Zindagi)Email: info@astrozindagi.in, neeraj@astrozindagi.inUrl: www.astrozindagi.inContact: Noida: +919910094779            Choose sun sign to read horoscope"}},{"headline":"Pisces Daily Horoscope Today, December 19, 2024 predicts pink of health","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/18/148x111/Pisces_1728478870554_1734544615802.jpg","summary":"Pisces Daily Horoscope Today, December 19, 2024 to know your astrological predictions. Your love life will be cheerful and health is also positive.","link":"/astrology/horoscope/pisces-daily-horoscope-today-december-19-2024-predicts-pink-of-health-101734544335062.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/18/550x309/Pisces_1728478870554_1734544615802.jpg","text":"Subscribe Now! Get features likeKeep the love life intact through discipline and commitment. Make the professional one productive today. Keep a watch on your expenditure. Health is also good.Avoid office gossip today and instead, focus on the task at the office. Your love life will be cheerful and health is also positive. Today is also good for smart investments.Ensure you settle the existing issues in the love affair with a positive attitude. Single Pisces natives may find a partner and your love life will get stronger. Today is good to have a romantic dinner where you may also surprise the lover with gifts. Married female natives can seriously think about starting a family today. Some love affairs may turn toxic and you need to be careful about it.  Despite the minor ego-related troubles, you will have a productive day. Your commitment and sincerity will play a major role in accomplishing every assigned task. Be ready to do multitasking today. Marketing and salespersons will travel today and clients will demand additional service. Architects, civil engineers, interior designers, and fashion designers will get new job offers with better packages. The students who are also appearing in competitive examinations need to work a little more. Avoid blind expenditure. Today, you may try the fortune in the stock market. You need to have proper knowledge about trading as losing money is the last thing you want. Some natives will try luck in the realty business. Females will also have plans to travel abroad on a vacation. Your relationship with siblings will also help you raise funds for business. You may also donate them to NGOs and a good social cause. Start the day with mild exercise and a balanced diet. Females may complain about pain in joints and children may also have viral fever today. Maintain a good relationship with the family members for a mentally healthy life. Make exercise a part of your routine and practice yoga to stay fit. You should refrain from the stress of work, love, and other aspects of life.  By: Dr. J. N. PandeyVedic Astrology & Vastu Expert Website: www.astrologerjnpandey.com E-mail: djnpandey@gmail.com Phone: 91-9811107060 (WhatsApp Only)Choose sun sign to read horoscope"}},{"headline":"Capricorn Daily Horoscope Today, December 19, 2024 predicts luck for traders","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/18/148x111/Capricorn_1728478974232_1734547374110.jpg","summary":"Capricorn Daily Horoscope Today, December 19, 2024 to know your astrological predictions. Traders and entrepreneurs will make money today.","link":"/astrology/horoscope/capricorn-daily-horoscope-today-december-19-2024-predicts-luck-for-traders-101734546379917.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/18/550x309/Capricorn_1728478974232_1734547374110.jpg","text":"Subscribe Now! Get features likeGive up egos in the relationship and consider spending more time at the workplace today to meet the deadlines. Traders and entrepreneurs will make money today.Shower love and affection on the partner the relationship will be vibrant. You’ll get opportunities to display your professional skills. Financial hiccups won't exist and health will be good today.You may fall in love with someone working at your office and this relationship can become serious in the future. Females will be surprised to receive a proposal from someone whom they have known for a long time. Some lucky Capricorns will regain the lost love, which will bring back fun and joy in life. Spare the best for your partner today. Be fair in your dealings and always value the personal space of the partner.Those who hold crucial responsibilities may need to spend more hours in meetings and decision-making today. You are suggested to build healthy relations with your colleagues and seniors. Those who are in the creative industry like authors, designers, and animation experts will earn more money today. New opportunities in business may come in and based on them, try expanding your turf. Athletes may succeed in winning new contracts. Traders may develop minor issues with local authorities that demand immediate settlement. You will see prosperity today and the second part of the day is good to donate money to charity. A legal dispute over a property will be settled with you receiving a good share. You may also renovate the home or buy a new house. Take the initiative to resolve a monetary issue involving a friend or relative. Some females will require spending on a celebration at the office or in the classroom. Businessmen will raise funds through promoters that will help in taking the trade to new areas. Be careful while you part in adventurous activities on a vacation. Females may also develop gynecological issues. Digestion issues may occur and it is good to avoid outside food. Seniors should not skip medicines and must consult a doctor whenever necessary. Ensure you have a healthy diet and drink plenty of water.   By: Dr. J. N. PandeyVedic Astrology & Vastu ExpertWebsite: www.astrologerjnpandey.comE-mail: djnpandey@gmail.comPhone: 91-9811107060 (WhatsApp Only) Choose sun sign to read horoscope"}},{"headline":"Sagittarius Daily Horoscope Today, December 18, 2024 predicts fortune in wealth","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/18/148x111/Sagittarius_1728479012112_1734548622752.jpg","summary":"Sagittarius Daily Horoscope Today, December 19, 2024 to know your astrological predictions. Money status is also good.","link":"/astrology/horoscope/sagittarius-daily-horoscope-today-december-18-2024-predicts-fortune-in-wealth-101734548506678.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/18/550x309/Sagittarius_1728479012112_1734548622752.jpg","text":"Subscribe Now! Get features likeA happy romantic life backed by a successful professional life makes your day. Despite minor health issues, you’ll enjoy the day. Money status is also good.Avoid office gossip today and instead, focus on the task at the office. Your love life will be cheerful but your health may not be good throughout the day. However, today is good for smart investments.Do not get into false relationships today. You may meet someone new and interesting. However, it is good to analyze every angle before you take a call on the relationship or even propose. Females may pick the day to introduce the lover to the family. Some fortunate natives may go back to the ex-lover after settling the past issues. If you have serious trouble staying inside a relationship, consider moving out of it.There can be challenges at work and it is crucial to give up egos. Some additional responsibilities will come to you today. This will be most visible in the professional lives of politicians, contractors, construction managers, lobbyists, legal professionals, or accounting persons. Those who are into arts, music, publishing, law, architecture, copywriting, advertisement, movies, and academics will have many opportunities to grow today. Be careful while attending team discussions and ensure your suggestions do not upset the seniors. Businessmen should be careful while making investments in new territories.You are fortunate in terms of wealth. A previous investment will bring a good return. You may also buy a vehicle or property today. Some females will resolve a monetary issue with a friend. Some male natives may also get income through an online lottery. Businessmen will clear all pending dues. The second part of the day is also good for traders in terms of money. Health need not be a concern today as many people will have a balance between both personal and professional lives. Do not take the office pressure to home. You may join a gym today. Do not lift heavy objects casually as accidents may happen. Some people may have pain in their joints and seniors may complain about sleeplessness.  Choose sun sign to read horoscope"}},{"headline":"Scorpio Daily Horoscope Today, December 19, 2024 predicts a new property","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/18/148x111/scorpio_1728479075489_1734548447821.jpg","summary":"Scorpio Daily Horoscope Today, December 19, 2024 to know your astrological predictions. Stay happy in the relationship by avoiding gossip.","link":"/astrology/horoscope/scorpio-daily-horoscope-today-december-19-2024-predicts-a-new-property-101734548256230.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/18/550x309/scorpio_1728479075489_1734548447821.jpg","text":"Subscribe Now! Get features likeThe love life will be creative and you may prefer spending more time with your partner. Ensure you continue the discipline in your career. Health is also fine.Stay happy in the relationship by avoiding gossip. Handle multiple responsibilities at the office today. While you will be wealthy today, health will also be at your side.You should also be expressive when it comes to emotions. Today is also good to propose or to receive a proposal. Some females will be fortunate to share emotions with the crush and also to settle the issues of the past to bring back happiness. Those who are married can be serious about expanding the family. There can be the interference of a third person in a few love affairs which needs to be controlled to avoid future mishaps. Married females may get conceived today.Ensure your coworkers are in a good mood and your professional instincts will work out while dealing with short short-tempered clients. IT and healthcare professionals will see new opportunities to relocate abroad. Lawyers need to be careful about the new tasks as some complications may arise. Your communication skills will work out at the client meeting today. Businessmen will have minor troubles related to licensing policies but this will be resolved in a day or two.There will be financial success today. All old financial issues will be resolved and you will also repay the pending dues including a bank loan. Some females will buy a new property while today is also auspicious to renovate the home. Those who are traveling should also be careful while making online payments. Before you invest in a speculative business, study the market as you don’t need to blindly invest and lose money.Minor health issues may come up in the first part of the day. Seniors should be careful while boarding a train or bus. Those who are suffering from hypertension may also need to be extra careful. Some children will also have rashes on their skin today. Avoid junk food, oily stuff, aerated drinks, and alcohol. If you are keen to quit smoking, this is the right time.  By: Dr. J. N. PandeyVedic Astrology & Vastu ExpertWebsite: www.astrologerjnpandey.comE-mail: djnpandey@gmail.comPhone: 91-9811107060 (WhatsApp Only) Choose sun sign to read horoscope"}},{"headline":"2024's interior design trends: Cosy minimalism meets bold colour palettesYear ender 2024 best design trends: Minimalist interiors just got a makeover – thanks to these bold colour palettes.","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/12/550x309/Minimalist_interiors_1734001310002_1734001328994.jpg","summary":"","link":"/lifestyle/art-culture/year-ender-2024-interior-design-trends-were-all-about-cosy-minimalism-meets-bold-colour-palettes-101734000674490.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/12/550x309/Minimalist_interiors_1734001310002_1734001328994.jpg","text":"Subscribe Now! Get features likeIn 2024, the world of interior design was a play of various trends creating unique spaces but one trend that stayed in the industry was the elegance of cosy minimalism infused with the vibrancy of bold colour palettes. The trend celebrated the balance between serenity and self-expression, crafting interiors that were as calming as they were captivating.From materials and textures to colour theory, this trend embraced minimalism in the home or workspace. Read on as top designers in the industry delve into the world of cosy minimalism and how it captured the design trend of the year.In an interview with HT Lifestyle, Ar. Rajkumar Kumawat, Founder and Principal Architect at Rajkumar Architects, shared, “Starting with a neutral, minimalist base serves as a ground for the design. Using soft, warm tones for walls and flooring can create a serene backdrop. These lend a refined aesthetic to any space fostering a sense of minimalism. Further, adding bold colours in measured doses can create a unique fusion. For instance, a jewel-toned velvet sofa can instantly transform the mood without disrupting the minimalist core.” Contrasting the subdued tones of cosy minimalism, bold colour palettes add personality and vibrancy to interiors. “For example, deep emerald green and amethyst purple are paired with earthy tones like terracotta to strike a perfect balance between drama and harmony. Further, for a retro minimalist look, warm mustard yellow and olive green, reminiscent of the 1970s are reimagined in contemporary ways, often paired with sleek furnishings”, added Ar. Rinki Kotak, Principal Architect at 4th Dimension. 2024’s interior design trends invited us to embrace the best of both worlds: the calming simplicity of cosy minimalism and the invigorating energy of bold palettes. So, great design is about following trends and curating spaces that inspire, nurture, and reflect your essence."}},{"headline":"Last-minute Secret Santa? Check out these Christmas gift ideas for everyone","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/last_minute_gifts_for_christmas_1734591650387_1734591658342.jpg","summary":"Christmas is just around the corner, and if you’re in a panic about gift shopping, fear not! This guide offers thoughtful, last-minute gift ideas for everyone.","link":"/lifestyle/fashion/be-the-ultimate-last-minute-secret-santa-get-perfect-gifts-for-men-women-and-kids-101734584454611.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/last_minute_gifts_for_christmas_1734591650387_1734591658342.jpg","text":"Subscribe Now! Get features likeChristmas is just around the corner! One moment, you’re sipping piping hot chocolate in your favourite sweater, and the next, you’re realising that oh no, Christmas is only a few days away, and your gift list is still a blank page. But don’t panic just yet because we’ve got the ultimate guide to help you channel your inner elf and pull off some last-minute gifting magic. Yes, even if you’re the world’s most skilled procrastinator, there’s still hope left for you!For the well-seasoned last-minuter, the key to succeeding is embracing the chaos and making it work for you. You certainly don’t have time to be super ambitious and aim to get custom-engraved ornaments or intricate handmade crafts. What you do have is a chance to grab something awesome that’ll make you look like you’ve been planning it for weeks. From quirky wallets for men to delicate jewellery for women and playful surprises for kids, this guide is like your Christmas GPS, rerouting you from “oh no” to “oh wow!” in no time.We get it, time isn’t just ticking; it’s sprinting. That’s why this guide is packed with ideas that are easy to find, thoughtful to give, and guaranteed to bring smiles all around. These options will make your loved ones think you’ve been in Santa’s workshop all along and you might even start to believe it yourself.So, fellow festive procrastinators, grab your reindeer by the antlers and dive into this gift guide. Because while Christmas might be sneaking up on you sooner than you think, you’re about to come out on top with gifts so good, no one will suspect they were picked out at the eleventh hour. Now, let’s make this the merriest Christmas yet!  Perfumes:When in doubt, freshen him up! A crisp, masculine fragrance is a subtle way of saying, “Merry Christmas and please stop secretly using mine!” It’s practical, thoughtful, and guaranteed to get him compliments all year round.  Wallets:We all know a guy whose wallet looks like it has been chewed by his dog. So be rest assured, gifting a wallet to a man is always a safe bet! It’s the perfect way to upgrade his daily essential without him even realising he needed it. And who knows, he might finally stop losing his cash!Also read: Santa’s cheat sheet: Fun and fabulous Christmas gifts for women Pocket squares:For the guy who is old-school at heart and secretly wishes he lived in the 1920s, a pocket square adds instant finesse to any outfit. It’s a small touch but is noticed by all and makes the guy's presence felt. Plus, they come in endless patterns, so you can match his personality to a tee.  Perfumes:A bottle of her favourite scent is not always just a predictable gift, it’s a compliment for her in a spritz! Gift her a fragrance that perfectly resembles her personality so that she’ll think of you every time she wears it. After all, who doesn’t love a little luxury in a bottle?Jewellery:A little sparkle never hurt anyone. Pamper the woman in your life with a flattering piece of jewellery to remind her how precious she is for you. Whether it’s dainty or bold, it’s the perfect way to make her shine brighter this Christmas. Plus, jewellery always feels personal, even when it’s last-minute!Also read: Christmas season lounge looks: Comfortable yet stylish fashion for men and women Watches:Give her a gift that makes her look forward to every second! It's a gift that will surely bring good times to her and is also the perfect mix of fashion and function, hence procrastinator-approved. Choose something chic or timeless, and she’ll be ready to attend any occasion in style.  Bags:From superhero backpacks to pink, fairy-themed ones, a fun bag is a practical yet exciting gift for kids who love carrying their world on their shoulders. It’s a gift that combines style with utility and is ideal for school, travel, or playdates!Watches:Give kids a fun time with a colourful, kid-friendly watch that will have them checking the clock and racing to unwrap the next gift in record time. And what's even better is that it's a sneaky way to teach them responsibility without them even noticing!Games:Keep their Christmas merry with a board game or puzzle that will urge your kids to ditch the laptop and phone screens for some good old-fashioned fun! It’s a gift that brings the whole family together for memories, laughs, and maybe a little friendly competition.Similar stories for you:Secret Santa sorted: Find the perfect bags for your better half this ChristmasSleigh the Christmas gifting game: Perfect picks for every man on your listDress up to sleigh: Christmas outfit ideas for all your holiday celebrationsOpt for versatile yet personal gifts like perfumes, wallets, or jewellery. Even practical items like a stylish watch or a fun board game can feel meaningful with a little thought behind them.Check out local stores, gift shops, or even online platforms with same-day or next-day delivery options. Many department stores and malls also offer gift-wrapping services to save time!Add a handwritten note or pair the gift with something small, like chocolates or a meaningful card. It’s the little touches that show you care, even if you’re short on time.Absolutely! Gift cards allow your loved ones to choose what they want while showing you thought of them. Pair it with a small token gift, like a pocket square or a bag of festive treats, for a personal touch. Disclaimer: At Hindustan Times, we help you stay up-to-date with the latest trends and products. Hindustan Times has an affiliate partnership, so we may get a part of the revenue when you make a purchase. We shall not be liable for any claim under applicable laws, including but not limited to the Consumer Protection Act, 2019, with respect to the products. The products listed in this article are in no particular order of priority."}},{"headline":"Want to be a better friend? Science says these 7 habits can strengthen any bond","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/photo-1536010305525-f7aa0834e2c7_1734593882310_1734593919847.jpg","summary":"Research reveals seven strategies to enhance friendships, including support, trust, and communication.","link":"/lifestyle/relationships/want-to-be-a-better-friend-science-says-these-7-habits-can-strengthen-any-bond-101734592866801.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/photo-1536010305525-f7aa0834e2c7_1734593882310_1734593919847.jpg","text":"Subscribe Now! Get features likeFriendships are a cornerstone of human life, providing emotional and practical support that bolsters well-being. However, not all friendships hold equal appeal. A recent study in Evolutionary Psychological Science identifies seven key strategies people use to nurture and solidify bonds with friends they value most. These insights shed light on how individuals actively enhance their relationships for deeper connections and mutual growth. (Also read: 10 reasons to give someone a chance, according to a relationship coach )Menelaos Apostolou and his team highlighted a gap in friendship research, which has primarily examined how relationships are maintained rather than the active strategies used to strengthen them. Using an evolutionary framework, the researchers proposed that these strategies likely revolve around showcasing support and trust, which are essential factors for cultivating deeper, more meaningful bonds.The study uncovered seven key strategies people use to strengthen friendships: offering support, increasing interaction, maintaining regular communication, giving gifts, building trust, fostering family connections, and expressing agreement. Of these, providing support was the most commonly reported, highlighting individuals’ readiness to help friends emotionally, materially, or practically during challenging times. Planning activities together and maintaining frequent contact, such as through calls or messages, were also prominent strategies.The findings revealed noteworthy differences in the use of friendship-strengthening strategies based on sex, age, and personality traits. Women were significantly more likely than men to employ all seven strategies, showcasing a greater inclination toward nurturing relationships. Younger participants demonstrated a pronounced preference for strategies that emphasised building trust and fostering interactions.Personality traits also played a critical role; individuals with higher levels of agreeableness were more inclined to adopt support-oriented strategies, while those high in openness tended to utilise a wider range of approaches, reflecting a more versatile approach to strengthening friendships.However, the study had limitations. Self-reported intentions might not accurately represent real-life behaviours, and the focus on Greek-speaking populations may restrict the broader applicability of the results."}},{"headline":"Top winter getaways for Christmas 2024: Hidden gems to escape the crowd","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/18/148x111/houseboat_1734519753371_1734519759511.jpg","summary":"Yearender 2024: In this hyper-connected world, you may have trouble finding peaceful getaways. But these options can help you find tranquility.","link":"/lifestyle/travel/top-winter-getaways-christmas-2024-hidden-gems-rann-of-kutch-kerala-himachal-pradesh-odisha-101734519381084.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/18/550x309/houseboat_1734519753371_1734519759511.jpg","text":"Subscribe Now! Get features likeYearender 2024: As the temperature drops and summer becomes a distant memory, our minds begin to wander to beach getaways. But if you're planning a quick escape from your city this Christmas, be sure to consider these destinations in north, east, south and west India that will satisfy your travel lust. Also read | Top travel trends of 2024Four hidden gems from across India that will give you a sense of being calm, peaceful and untroubled this Christmas:A post shared by Rann Utsav Official (@rannutsav)Celebrate Christmas with a touch of magic at a tent in Rann Of Kutch, a massive salt marsh in the Thar Desert in western Gujarat, where all you can see is white sand. Immerse yourself in the vibrant culture and serene beauty of the white desert for a truly unforgettable Christmas experience. Don't be surprised if you find yourself getting pleasantly lost in the mesmerising landscape. This is the best to visit, which means you can enjoy the white desert in all its glory while driving through in broad daylight and also feel the pleasant chill in the air at night as you watch the stars slowly come out.A post shared by Rudralika (@rudralika)This Christmas, if you are planning a trip to Kerala, stay in a houseboat for an unforgettable experience in God's Own Country. What could be better than cruising along Kerala's chain of interconnected lagoons and lakes linked by canals and fed by dozens of rivers on a houseboat? These boats serve as a luxe stay option for couples looking for a romantic escape this Christmas. If you are on a family holiday or want to see a side of Kerala that you've never seen before with your friends, don't miss the chance to witness dreamy sunsets from the deck and starry skies at night.A post shared by HMT Igloos (@igloostay)An igloo stay in Himachal Pradesh's Manali is all about soaking in the Eskimo way of life. These campsites have igloos with about zero degrees, all equipped with warm mattresses, sleeping bags, and winter essentials. When not out exploring local activities, you can sit around a bonfire if you please. These freezing igloos, nestled in quaint little villages in Himachal Pradesh, are only open for the season once snowfall hits the valley, mostly around mid-December.A post shared by Captures of Odisha (@captures_of_odisha)Want to explore both the touristy and non-touristy parts of Odisha by road? You could plan day trips and explore the beaches of Puri and Gopalpur, temples of Bhubaneswar and Konark, Chilka Lake and other places in the eastern state if you want to stick to the tourist map. But apart from Chilka Lake, Cuttack, Puri, and Kheonjar, some popular destinations for road trips in Odisha could be ecological campsites to spend time away from the crowds."}},{"headline":"AIMA MAT CBT 2 admit card 2024 out, link to download hereThe AIMA MAT CBT 2 admit card 2024 has been released at mat.aima.in. Candidates download via the direct link given below.","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/AIMA_MAT_2024_CBT_2_admit_card_1734591776023_1734591793486.png","summary":"","link":"/education/direct-link-to-download-aima-mat-cbt-2-admit-card-2024-from-mat-aima-in-important-details-here-101734589984571.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/AIMA_MAT_2024_CBT_2_admit_card_1734591776023_1734591793486.png","text":"Subscribe Now! Get features likeAll India Management Association, AIMA, has released the Admit Cards for MAT December 2024 exam. Candidates who are appearing for the second CBT (Computer-Best Test) of Management Aptitude Test can download their hall tickets from the official website at mat.aima.in.To download the hall tickets, candidates will need to enter their registered email address and password on the login module.Notably, the CBT 2 is scheduled to be conducted on Sunday, December 22, 2024.Prior to this, the CBT 1 was conducted on December 7 and the Paper-Based Test or PBT was held on December 14, 2024.Also read: UPSSSC X-Ray technician 2024 provisional answer key released at upsssc.gov.in, direct link to file objections hereAs per the official schedule, the AIMA MAT December 2024 results will likely be released by the first week of January 2025 on the official website.Also read: DSE Haryana directs schools in Faridabad to conduct classes for students up to 9th and 11th in hybrid modeRegistrations for MAT December 2024 exam began on September 6 on the official website at mat.aima.in. To be eligible for the examination, candidates were required to meet the following criteria:Besides, the application fee for MAT December 2024 was ₹2100. Candidates could opt for an additional test mode by paying an extra fee of ₹1500.The Management Aptitude Test is a popular and trusted national-level entrance exam that serves as a gateway to 20,000+ prestigious management seats in top-tier colleges nationwide. It is approved by the Ministry of Education and is accepted by over 600 esteemed B-schools in India.Also read: MP Class 5, 8 Annual Exam 2025 datesheet out at educationportal.mp.gov.in, check timetable hereTo download the AIMA MAT December 2024 admit card for CBT 2, candidates can follow the steps mentioned below:For more related details, candidates are advised to visit the official website."}},{"headline":"Where, how to check CAT Result 2024 when announced- Live Updates here","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/programme-courses-campus-saxena-graduates-students_1734574358771_1734574358957.jpg","summary":"CAT Result 2024 will be announced on the official website of IIM CAT at iimcat.ac.in. Follow the blog for latest updates.","link":"/education/exam-results/cat-result-2024-live-iim-cat-result-direct-link-scorecard-toppers-how-to-check-cut-offs-latest-updates-at-iimcatacin-101734494586814.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/programme-courses-campus-saxena-graduates-students_1734574358771_1734574358957.jpg","text":"Indian Institute of Management, IIM Calcutta will release CAT Result 2024 on the official website of IIM CAT. When declared, all the candidates who have appeared for the Common Admission Test can check the results at iimcat.ac.in.  The Institute has released the IIM CAT final answer key 2024 on December 17, 2024. The final answer key is available on the candidates' login. ...Read MoreAs per past trends, the Institute will release the IIM CAT cut off scores, CAT toppers, scorecard and other details along with the CAT Result 2024. The Common Admission Test was conducted on November 24, 2024 at 389 test centres spread across 170 cities in India. The duration of the test was for 120 minutes and for each section time allotted was 40 minutes. The written test was held in three sessions- the first session from 8:30 AM to 10:30 AM, the second session from 12:30 PM to 2:30 PM, and the third session from 4:30 PM to 6:30 PM. The IIM CAT response sheet was released on November 29 and the provisional answer key was released on December 3, 2024. The objection window was closed on December 5, 2024. IIM CAT 2024 exam date: November 24, 2024.Response sheet released on November 29, 2024.Provisional answer key released on December 3, 2024. Objection window closed on December 5, 2024.Final answer key released on December 17, 2024. Along with IIM CAT Results 2024, IIM Calcutta will likely release the IIM CAT cut off scores, CAT toppers, scorecard and other details.IIM CAT 2024 examination was conducted on November 24, 2024. The IIM CAT final answer key 2024 was released on December 17, 2024 and had no changes in comparison to the provisional key. As per past trends, the Institute will release the IIM CAT cut off scores, CAT toppers, scorecard and other details along with the CAT Result 2024.The Institute has released the IIM CAT final answer key 2024 on December 17, 2024. The final answer key is available on the candidates' login.When declared, all the candidates who have appeared for the Common Admission Test can check the results at iimcat.ac.in.IIM Calcutta has not released CAT Result 2024 yet. The duration of the IIM CAT was 120 minutes and for each section time allotted was 40 minutes.The IIM CAT results 2024 will be released at iimcat.ac.in.IIM Calcutta will likely release IIM CAT cut off scores, CAT toppers, scorecard and other details along with the CAT Result 2024.The IIM CAT response sheet was released on November 29 and the provisional answer key was released on December 3, 2024. The objection window was closed on December 5, 2024.When announced, all appeared candidates can check IIM Common Admission Test results on the official website of IIM CAT at iimcat.ac.in.The first slot was held from 8:30 AM to 10:30 AM, the second slot from 12:30 PM to 2:30 PM, and the third slot from 4:30 PM to 6:30 PM. The exam was held in various test centres across the country in 170 cities.Visit the official website of IIM CAT at iimcat.ac.in.Click on CAT 2024 final answer key link available on the home page.A new page will open where candidates will have to enter the login details.Click on submit and the final answer key will be displayed.Check the final answer key and download it.Keep a hard copy of the same for further need.91 non-IIM institutions will also use CAT 2024 scores this year for admission into their management programmes.Visit the official website at iimcat.ac.in.Log in using your credentialsCheck the resultsTake the printout for future reference.IIM AhmedabadIIM AmritsarIIM BangaloreIIM Bodh GayaIIM CalcuttaIIM IndoreIIM JammuIIM KashipurIIM KozhikodeIIM LucknowIIM MumbaiIIM NagpurIIM RaipurIIM RanchiIIM RohtakIIM SambalpurIIM ShillongIIM SirmaurIIM TiruchirappalliIIM UdaipurIIM VisakhapatnamWhen announced, all appeared candidates can check IIM Common Admission Test results on the official website of IIM CAT at iimcat.ac.in.The official brochure of IIM CAT says that the result will likely be announced in the second week of January 2025.There is no change in the IIM CAT 2024 final answer key as compared to provisional answer key.CAT response sheet release date: November 29 CAT provisional answer key release date: December 3CAT objection window closed: December 5CAT final answer key out- December 17 The written test was held in three sessions- first session from 8:30 AM to 10:30 AM, the second session from 12:30 PM to 2:30 PM, and the third session from 4:30 PM to 6:30 PM.The duration of the test was for 120 minutes and for each section time allotted was 40 minutes.The CAT Centre received a total of 405 objections across 3 sections and 3 shifts out of which 21 for Data Interpretation and Logical Reasoning (DILR), 13 for Quantitative Ability (QA) and 371 for Verbal Ability and Reading Comprehension (VARC). Visit the official website of IIM CAT.Click on CAT Result 2024 Link available on the home page.A new page will open where candidates will have to enter the login details.Click on submit and your result will be displayed.Check the result and download the page.Keep a hard copy of the same for further need.The Common Admission Test was conducted on November 24, 2024 at 389 test centres spread across 170 cities in India.As per past trends, the Institute will release the IIM CAT cut off scores, CAT toppers, scorecard and other details along with the CAT Result 2024.Visit the official website of IIM CAT at iimcat.ac.in.Click on IIM CAT 2024 login link available on the home page.A new page will open where candidates will have to enter the login details.Click on submit and your answer key will be displayed.Check the answer key and download the page.Keep a hard copy of the same for further need.The CAT Result 2024 is expected to be declared next. Candidates who have appeared for Common Admission Test can check their results on the official website of IIM CAT at iimcat.ac.in after it is announced.The Institute has released IIM CAT 2024 final answer key on the official website of IIM CAT at iimcat.ac.in. Candidates can check the final key by logging into their account. The date and time of announcement of CAT Result 2024 have not been done by the Institute yet. "}},{"headline":"How, where to check UGC NET exam city slip 2024 when released- Live Updates Here","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/A-total-675-444-students-gave-the-exam-and-are-awa_1718129269664_1734574700382.jpg","summary":"UGC NET exam city slip 2024 will be available to appeared candidates on the official website of UGC NET at ugcnet.nta.ac.in. Follow the blog for updates.","link":"/education/competitive-exams/ugc-net-exam-city-slip-2024-live-ugc-net-december-city-intimation-slip-direct-link-how-to-download-at-ugcnetntaacin-101734498339418.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/A-total-675-444-students-gave-the-exam-and-are-awa_1718129269664_1734574700382.jpg","text":"The National Testing Agency, NTA will release UGC NET exam city slip 2024 on the official website of UGC NET at ugcnet.nta.ac.in. Candidates who have appeared for the test can check and download it from the official website.  The date and time of release of NTA UGC NET exam city slip have not been announced yet....Read MoreThe UGC NET December 2024 exam will be held from January 1 to January 19, 2025. The exam duration is 180 minutes. The UGC NET December 2024 will be conducted in Computer-Based Test (CBT) mode. The Test paper will consist of two sections. Both sections will consist of objective-type, multiple-choice questions. There will be no break between the papers. Paper I will have 50 questions for 100 marks. The questions in Paper I intend to assess the teaching/ research aptitude of the candidate. It will primarily be designed to test reasoning ability, reading comprehension, divergent thinking and general awareness of the candidate and Paper II will have 100 questions for 200 marks. This is based on the subject selected by the candidate and will assess domain knowledge. The admit card will be released after the city intimation slip has been issued. Follow the blog for latest updates on UGC NET exam city slip, direct link and more. The NTA has not released the UGC NET exam city slips so far. Once the UGC NET exam city intimation slips are released, the NTA will released UGC NET admit cards. Paper II will have 100 questions for 200 marks. It will be based on the subject selected by the candidate and will assess domain knowledge.The NTA will release UGC NET exam city slip 2024 on the official website of UGC NET at ugcnet.nta.ac.in.The exam duration is 180 minutes. The UGC NET December 2024 will be conducted in Computer-Based Test (CBT) mode. The Test paper will consist of two sections. Both sections will consist of objective-type, multiple-choice questions. There will be no break between the papers.The UGC NET December 2024 exam will be held from January 1 to January 19, 2025.The National Testing Agency, NTA will release UGC NET exam city slip 2024 on the official website of UGC NET at ugcnet.nta.ac.in.The UGC NET 2024 city intimation slip has not been released yet. Paper I will consist of 50 questions with a total of 100 marks. It will assess the teaching/ research aptitude of the candidate.The duration of UGC NET December 2024 exam is 180 minutes.The UGC NET December 2024 exam is scheduled from January 1 to January 19, 2025.ugcnet.nta.ac.inugcnetdec24.ntaonline.inPaper I will have 50 questions for 100 marks. The questions in Paper I intend to assess the teaching/ research aptitude of the candidate. It will primarily be designed to test reasoning ability, reading comprehension, divergent thinking and general awareness of the candidate and Paper II will have 100 questions for 200 marks. This is based on the subject selected by the candidate and will assess domain knowledge.The exam duration is 180 minutes. The UGC NET December 2024 will be conducted in Computer-Based Test (CBT) mode. The Test paper will consist of two sections. Both sections will consist of objective-type, multiple-choice questions. There will be no break between the papers.The UGC NET December 2024 exam will be held from January 1 to January 19, 2025.The National Testing Agency, NTA, has not released the UGC NET exam city slip 2024 yet.Visit the official website of UGC NET. Click on UGC NET exam city slip 2024 link available on the home page. A new page will open where candidates will have to enter the login details. Click on submit and your city intimation slip will be displayed. Check the city intimation slip and download it. Keep a hard copy of the same for further need. (a) To answer a question, the candidate needs to choose one option as correct option.(b) Each question carries 02 (two) marks.(c) For each correct response, candidate will get 02 (two) marks.(d) There is no negative marking for incorrect response.(e) No marks will be given for questions un-answered/un-attempted/marked for Review.(f) If a question is found to be incorrect/ambiguous or has multiple correct answers, only those candidates who have attempted the question and chosen one of the correct answers would be given the credit.(g) If a question is found to be incorrect and the Question is dropped, then two marks (+2) will be awarded to only those candidates who have attempted the question. The reason could be due to human error or technical error. Since, there is no negative marking, candidate needs to choose one of the most appropriate options as correct answer.The medium of Question Paper shall be in English & Hindi only, except language papers.UGC-NET is a test to determine the eligibility of Indian nationals for ‘award of Junior Research Fellowship and appointment as Assistant Professor’, ‘appointment as Assistant Professor and admission to Ph.D.’ and ‘admission to Ph.D. only’ in Indian universities and colleges.The admit card will be released after the city intimation slip has been issued.Paper I will have 50 questions for 100 marks. The questions in Paper I intend to assess the teaching/ research aptitude of the candidate. It will primarily be designed to test reasoning ability, reading comprehension, divergent thinking and general awareness of the candidate and Paper II will have 100 questions for 200 marks. This is based on the subject selected by the candidate and will assess domain knowledge.The exam duration is 180 minutes. The UGC NET December 2024 will be conducted in Computer-Based Test (CBT) mode. The Test paper will consist of two sections. Both sections will consist of objective-type, multiple-choice questions. There will be no break between the papers.The UGC NET December 2024 exam will be held from January 1 to January 19, 2025.ugcnet.nta.ac.inugcnetdec24.ntaonline.inWhen released, candidates can check the NTA UGC NET December city intimation slip through the official website of UGC NET at ugcnet.nta.ac.in.NTA has not announced the UGC NET Exam City Slip 2024 date and time yet. "}},{"headline":"Where, how to check SSC MTS Result 2024 when released- Live updates here","pic":"https://www.hindustantimes.com/ht-img/img/2024/12/19/148x111/SSC_GD_final_result_1734142404647_1734574059584.png","summary":"SSC MTS Result 2024 is not out yet. When released, candidates can check it on the official website of SSC. Follow the blog for latest updates.","link":"/education/exam-results/ssc-mts-2024-how-to-check-ssc-mts-havaldar-results-when-released-at-ssc-gov-in-live-updates-101734518675203.html","contents":{"image":"https://www.hindustantimes.com/ht-img/img/2024/12/19/550x309/SSC_GD_final_result_1734142404647_1734574059584.png","text":"The Staff Selection Commission will release the SSC MTS Result 2024 on the official website of SSC. Candidates who have appeared for Multi-Tasking (Non-Technical) Staff and Havaldar (CBIC & CBN) Examination, 2024 (Tier-I) can check the results on official website of SSC at ssc.gov.in after announcement.   The Commission has till now not announced the SSC MTS result date and time....Read MoreThe computer-based test was held from September 30 to November 14, 2024, at various exam centres across the country. The written test was divided into two mandatory sessions, each lasting 45 minutes, and held on the same exam day. The questions were objective-type and multiple-choice. The examination will have negative marking for the wrong answers only in the second session. 1 mark will be deducted for each incorrect answer. The SSC MTS provisional answer key was released on November 29 and the last date to raise objections was till December 2, 2024. This recruitment drive will fill 9583 MTS and Havaldar vacancies, of which 6144 are for Multi-Tasking Staff (Non-Technical) and 3439 are for Havaldar.   The computer-based test was held from September 30 to November 14, 2024.The SSC MTS results have not been out yet on the official website. The SSC MTS 2024 paper included objective-type and multiple-choice questions. The written test was divided into two mandatory sessions, and each lasted 45 minutes. The written test was divided into two mandatory sessions, each lasting 45 minutes, and held on the same exam day. The questions were objective-type and multiple-choice.The computer-based test was held from September 30 to November 14, 2024, at various exam centres across the country.Candidates who have appeared for Multi-Tasking (Non-Technical) Staff and Havaldar (CBIC & CBN) Examination, 2024 (Tier-I) can check the results on official website of SSC at ssc.gov.in after announcement.The SSC MTS Result 2024 date and time have not been announced. As per the commission, the SSC MTS examination will have negative marking for the wrong answers only in the second session. 1 mark will be deducted for each incorrect answer.The written test was divided into two mandatory sessions, and each lasted 45 minutes.The SSC MTS results 2024 will be released on ssc.gov.in.This recruitment drive will fill 9583 MTS and Havaldar vacancies, of which 6144 are for Multi-Tasking Staff (Non-Technical) and 3439 are for Havaldar.The SSC MTS provisional answer key was released on November 29 and the last date to raise objections was till December 2, 2024.The examination will have negative marking for the wrong answers only in the second session. 1 mark will be deducted for each incorrect answer.The written test was divided into two mandatory sessions, each lasting 45 minutes, and held on the same exam day. The questions were objective-type and multiple-choice.The computer-based test was held from September 30 to November 14, 2024, at various exam centres across the country.The MTS and Havaldar results when announced will be available on the official website of SSC at ssc.gov.in.The SSC MTS Result 2024 date and time have not been announced yet. "}},{"headline":"\"With My Kids...\": Kohli Involved In Heated Exchange At Melbourne Airport","pic":"https://c.ndtvimg.com/2024-12/k6dvddjg_virat-kohli-x_625x300_19_December_24.jpeg?im=FaceCrop,algorithm=dnn,width=100,height=120&w=100","link":"https://sports.ndtv.com/australia-vs-india-2024-25/virat-kohli-involved-in-heated-exchange-at-airport-lashes-out-at-cameraman-7283931#pfrom=home-ndtv_lateststories_topstoriesImg","contents":{"image":"https://c.ndtvimg.com/2024-12/k6dvddjg_virat-kohli-x_625x300_19_December_24.jpeg","text":"Indian cricket stalwart Virat Kohli was involved in a heated exchange with a few media persons at the airport, after the conclusion of the third Test against Australia in Brisbane. Kohli, who likes to maintain keep his personal life away from the spotlight that comes with his career, wasn't reportedly happy to see him and his family members being captured by the media. Seeing cameras capturing him and his children at the airport, Kohli reportedly lost his cool. However, it was later discovered that it was only a misunderstanding.It has been reported that a few journalists were interviewing Australian pacer Scott Boland, when Kohli and his family were spotted at the airport. The cameras shifted focus to Kohli, seeing which the India star wasn't happyKohli was taken aback by Channel 7 cameras focusing on him and his family. He was involved in a tense conversation with a TV reporter over the fact that his privacy wasn't being respected.\n\"It was upon seeing the waiting cameras that Kohli became a little heated over what is largely a misunderstanding when he thought the media was filming him with his children,\" a reporter at the airport said on 7NEWS.\"With my kids I need some privacy, you can't film without asking me,\" Virat Kohli could be heard saying.NOT HAPPY VIRAT KOHLI AT THE AIRPORT- Virat Kohli was upset and not happy with Australian journalists in Melbourne airport. He already said that please don't take any pictures & filming videos on my children but still Australia's Media filming video. (7 News). pic.twitter.com/BmNenxtAsPHowever, the matter cooled down when Kohli was assured that his children weren't being filmed. Kohli, as per a report, even shook the hands of a Channel 7 cameraman after getting the required assurances.Kohli hasn't had the most fruitful of outings in Australia. Barring a second innings hundred at Perth, the iconic batter has struggled to score runs. In a total of 4 other outings with the bat, Virat has only managed to score 26 runs.As for the Border-Gavaskar Trophy, the series remains level 1-1, after Australia won the Adelaide Test, cancelling the lead India attained after winning in Perth. The Brisbane encounter, on the other hand, ended in a draw due to frequent rain interruptions.The two teams are scheduled to face-off next in Melbourne, in the Boxing Day Test, starting December 26.\n                                    Advertisement\n                                AdvertisementAdvertisementAdvertisement"}},{"headline":"Box Office: Pushpa 2  To \"Dethrone\" Stree 2 As Highest-Grossing Hindi Film","pic":"https://c.ndtvimg.com/2024-12/8b6ru14_pushpa-_295x200_19_December_24.jpg?downsize=100:120&w=100","link":"https://www.ndtv.com/entertainment/pushpa-2-box-office-collection-day-14-allu-arjuns-film-mints-rs-20-8-crore-7283576#pfrom=home-ndtv_lateststories_topstoriesImg","contents":{"text":"Allu Arjun and Rashmika Mandanna's Pushpa 2: The Rule continues to win a million hearts. The film, released on December 5, shows no sign of slowing down at the box office. On Day 14, Pushpa 2: The Rule earned ₹20.8 crore in India across all languages, reported Sacnilk. The film recorded an overall Telugu occupancy of 20.58% on its second Wednesday. So far, the action-drama has earned an impressive ₹973.3 crore. Directed by Sukumar, Pushpa 2: The Rule serves as the sequel to the 2021 blockbuster Pushpa: The Rise.On Wednesday, Bollywood trade analyst Taran Adarsh shared the day 13 box office figures for the Hindi version of Pushpa 2: The Rule. In a post shared on X (formerly Twitter), he wrote, “600 not out - next stop 700 cr...Pushpa 2 is ready to claim the throne... Pushpa 2 has shattered every record in sight... Will soon dethrone Stree 2 from the No. 1 position, emerging as the highest-grossing Hindi film ever.\" Taran Adarsh added, \"Pushpa 2 is *not* slowing down soon... With the Christmas and New Year holidays around the corner, Pushpa 2 is expected to surpass the ₹ 700 cr mark and could even aim for the monumental ₹ 800 cr milestone. Pushpa2 [Week 2] Fri 27.50 cr, Sat 46.50 cr, Sun 54 cr, Mon 20.50 cr, Tue 19.50 cr. Total: ₹ 601.50 cr.\" 600 NOT OUT - NEXT STOP 700 CR... 'PUSHPA 2' READY TO CLAIM THE THRONE... #Pushpa2 has shattered every record in sight... Will soon dethrone #Stree2 from the No. 1 position, emerging as the highest-grossing #Hindi film ever.#Pushpa2 is *not* slowing down soon... With the… pic.twitter.com/juQ2OT9CBHEarlier, Allu Arjun reacted to the box office success of Pushpa 2: The Rule. Speaking at the success meet in Delhi, the actor said, “The numbers are temporary but the love I hold very close to my heart.  I always say that records are made to be broken,  maybe for the next 2-3 months I will enjoy all these records but hopefully, by the summer I would want all these records to be broken by the next film.”Aside from Allu Arjun and Rashmika Mandanna, Pushpa 2: The Rule features Fahadh Faasil, Jagapathi Babu, Dhananjaya, Rao Ramesh, Sunil and Anasuya Bharadwaj in pivotal roles. \n                    Entertainment I Read Latest News on NDTV Entertainment. Click NDTV Entertainment For The \n                        Latest In, \n                        bollywood , \n                        regional, \n                        hollywood, \n                        tv, \n                        web series, \n                        photos, \n                        videos and More. \n                "}},{"headline":"Actor-Politician Ravi Kishan Gets Candid About Casting Couch Experience","pic":"https://c.ndtvimg.com/2024-12/9kv21evg_ravi-kishan_625x300_19_December_24.jpg?im=FaceCrop,algorithm=dnn,width=100,height=120&w=100","link":"https://www.ndtv.com/entertainment/ravi-kishan-gets-candid-about-casting-couch-experience-7284116#pfrom=home-ndtv_lateststories_topstoriesImg","contents":{"text":"Laapataa Ladies was hailed as one of the biggest hits of 2023 and was eventually chosen as India's official entry to the prestigious 97th Academy Awards in the Best International Feature Film category. Ravi Kishan played the role of a cop Manohar in the film and was mighty impressive as he got into the skin of the character effortlessly.A post shared by Ravi Kishan (@ravikishann)In a recent chat on a podcast, the actor-politician made some revelations about his casting couch experience in the industry.He confessed, \"In every profession, in every industry, such incidents happen. When you are slim,  beautiful, young, fit, you are in your youth, and you don't have money. You have struggles, you don't have anything, then such attempts are often made on you.\"He furthermore expressed that he too, has been a victim of such circumstances. It's a part and parcel of the movie business that is known to everyone.Speaking of doing justice to his onscreen characters, Kishan mentioned how he once met an officer in Bihar who left a lasting impression on him. Right from the mannerisms to the authentic body language as a cop, it truly impacted him and it always happens when he meets a new person.He also shared that he ate about 160 paans for his onscreen performance in Laapataa Ladies, where his character seems to have a weird habit of chewing paan while speaking.He mentioned that director Kiran Rao wanted him to be having snacks while talking. That is when the idea of having paan emerged, and eventually turned into a character quirk.\n                    Entertainment I Read Latest News on NDTV Entertainment. Click NDTV Entertainment For The \n                        Latest In, \n                        bollywood , \n                        regional, \n                        hollywood, \n                        tv, \n                        web series, \n                        photos, \n                        videos and More. \n                "}},{"headline":"Ashwin Contradicts Rohit, Makes Stunning Retirement Revelation In Chennai","pic":"https://c.ndtvimg.com/2024-12/niopsatg_ravichandran-ashwin-bcci_625x300_19_December_24.jpg?im=FaceCrop,algorithm=dnn,width=100,height=120&w=100","link":"https://sports.ndtv.com/australia-vs-india-2024-25/felt-it-on-day-4-r-ashwins-new-retirement-revelation-after-reaching-chennai-7283181#pfrom=home-ndtv_lateststories_topstoriesImg","contents":{"image":"https://c.ndtvimg.com/2024-12/niopsatg_ravichandran-ashwin-bcci_625x300_19_December_24.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605","text":"There was the mandatory shower of flower petals, lots of smiles and a live band too as Ravichandran Ashwin returned home on Thursday after his shock international retirement in the middle of a Test series in Australia, insisting that he made an \"instinctive\" decision and is walking away with \"zero regrets\". He landed at the Chennai International Airport early this morning and was escorted out by officials of the state cricket association. The 38-year-old owner of 765 international wickets did not speak to the waiting media there as he hopped into his car where his wife Prithi and two daughters were waiting for him.However, once he reached home and was surrounded by his parents, and other well-wishers, Ashwin did oblige the waiting newspersons, opening up a bit about his decision.\"It's emotional for a lot of people, and may be it will sink in (in some time) but for me, personally, it is a great sense of relief and satisfaction. It was very instinctive and it has been running in my head for a while. I just felt (it) on Day 4 and I just called it a day,\" Ashwin said, referring to the drawn third Test in Brisbane.\n\"...it (retirement) is a not a big decision as far as I am concerned because I am going to embrace a new path,\" he went on.Asked if he regretted not being the captain of the national side, Ashwin dismissed the suggestion.\"I can't do it now. I have no such regrets. In fact, I have zero regrets. I have seen from a distance those people with regrets but I don't have any such regrets,\" asserted the bowler, who has 537 Test wickets to his credit, making him India's second highest wicket-taker in the format behind the great Anil Kumble (619).As he entered his house, his parents embraced him and the seasoned bowler was garlanded too. A few from among the gathering took his autograph, shook hands and congratulated him for a stellar run as an India player.\"I never thought so many people will come here. I just wanted a quiet entry, and was looking forward to relax at home. But you have made my day. I have played Test cricket for so many years, but the last time (I saw something) like this was after the 2011 World Cup,\" he said.Ashwin on Wednesday announced retirement with immediate effect in the middle of the five-match Test series that is currently locked 1-1 after three games.\"To be honest, we all go through a lot in our career, not only for cricketers but in general. Generally, when I go to sleep I remember a lot of things like taking wickets, making runs, but those memories are not there in the last two years.\"So, that was a clear indication that we need to take a different route now,\" Ashwin said.\"I have not set any new goals, as I just want to relax now. Actually, it's difficult for me to stay inactive, but I want to try that now,\" he added.He will continue to play club cricket, including the IPL, where he will return to play for Chennai Super Kings next year.\"I think that part for me is still burning bright. I am going to play for CSK and don't be surprised if I aspire to play for as long as I can. I don't think Ashwin the cricketer is done, I think only Ashwin the Indian cricketer called time. That's it,\" he reiterated.In the limited-overs format, being part of the 2011 World Cup and the 2013 Champions Trophy-winning teams would count among the major highlights of his 14-year career.Ashwin played 116 ODIs for India, claiming 156 wickets, while his 65 T20 International outings yielded 72 scalps. His career began in 2010 in the one-day format before he made his Test debut a year later.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\n                                    Advertisement\n                                AdvertisementAdvertisementAdvertisement"}},{"headline":"\"Mind Your Business\": Nainital Tourists Argue After Asked To Use Dustbin","pic":"https://c.ndtvimg.com/2024-12/6fb7nb8g_tourist-in-nainital_625x300_19_December_24.jpg?im=FeatureCrop,algorithm=dnn,width=100,height=120&w=100","link":"https://www.ndtv.com/travel/mind-your-business-tourists-argue-after-being-asked-to-use-dustbin-in-nainital-7283118#pfrom=home-ndtv_lateststories_topstoriesImg","contents":{"text":"Viral video shows tourists arguing after asked to throw trash in a dustbin.December in India is perfect for vacations, whether you're soaking up the sun on a beach or bundling up in the mountains. But let's be real - tourists often get called out for messing things up with trash, pollution and traffic in places that should be peaceful. A viral Instagram video with over 4.8 million views is highlighting this issue. In the clip, posted by sisters Shinjini Sengupta and Udita Basu, they confront tourists who allegedly refused to use a dustbin. \"This is how most tourists treat mountains,\" the video text reads.Detailing the incident, Sengupta wrote, \"This is Lovers' Point, Nainital, 14th December, 15:00. These people cut a birthday cake and threw the tissue papers on the road. Next, they threw the cake's bag.\"When asked to throw the trash in a bin, Sengupta said their intervention was dismissed. She wrote, \"My sister intervened, asking them politely to throw it in the dustbin. The lady in red claimed there was no dustbin. The shopkeeper then approached her with the same request, mentioning that police fine people for littering.\"Also Read:Heading To A Hill Station This Winter? Here's How To Beat The ColdAfter further insistence, the family started quarrelling with the sisters. \"The guy (their driver) then picked up the plastic bag and threw it into the adjacent valley. Ab cake ke box ke liye my sister told them again. That's when the situation escalated. The dustbin was hardly 5 feet away. Yet they argued. Let's find them and ensure they don't repeat this. At the very least, let's aim to be better citizens.\"In the video, a family member accuses the sisters of \"fighting with random people.\" The sisters replied, \"We were not fighting. I told you several times, 'Please throw it in the dustbin.' You said there was no dustbin.\" The tourist then retorted, \"Mind your own business.\"A post shared by Shinjini Sengupta (@_dark_hues)The post went viral, sparking a range of reactions in the comments section:\"Happens to me so many times in Dehradun. No matter how much you stop them from littering, they argue back. I am just so fed up,\" an Instagram user wrote. Another added, \"Why is it so hard to own one's mistakes? People's ego is at its peak.\"A viewer remarked, \"Although I don't think posting anyone's photo/video online without their knowledge is right, this is for a good cause. Keeping the environment clean is everyone's business. Kudos to you for calling them out. We should shame people for littering until civic sense improves.\"Also Read:American YouTuber Slams Air India For Offering The \"Worst Business Class Experience\"PromotedAnother said, \"Yes! Call them out always. It's everyone's responsibility to keep places clean. This shows how sensibilities can be lacking even in educated people.\"What do you think of this viral video? Share your reaction in the comments section.Track Latest News Live on NDTV.com and get news updates from India  and around the world. Watch Live News:Follow Us:................................ Advertisement ................................"}},{"headline":"ChatGPT Comes To WhatsApp: OpenAI's Latest Experiment Explained","pic":"https://c.ndtvimg.com/2024-12/rmmaf9pg_chatgpt_625x300_19_December_24.jpeg?downsize=100:120&w=100","link":"https://www.ndtv.com/feature/chatgpt-comes-to-whatsapp-openais-latest-experiment-explained-7284067#pfrom=home-ndtv_lateststories_topstoriesImg","contents":{"text":"OpenAI has launched an experimental service, 1-800-ChatGPT, combining the company's popular chatbot with WhatsApp. The new effort is designed to make the service more accessible by not requiring a separate account or even a specific app. Incidentally, Meta already provides access to Meta AI on WhatsApp.Dialling 1-800-CHATGPT or 1-800-242-8478 in the US and Canada will immediately connect users directly with the AI. In countries where the service is operational, WhatsApp users can even text the same number to have a conversation.Also Read | Think Twice Before Trusting Chatbots With Your Secrets, Warns AI ExpertAdding it through the phone number is not possible in India, but scanning the QR code on the support page of OpenAI did work flawlessly. What is 1-800-ChatGPT, and how can it be used effectively?According to the OpenAI blog, 1-800-ChatGPT is an experimental new launch to enable wider access to ChatGPT. You can now talk to ChatGPT via phone call or message ChatGPT via WhatsApp at 1-800-ChatGPT without needing an account.Also Read | ChatGPT Search Opens To All Users In Challenge To GoogleNote that ChatGPT will never be the one to initiate a call or start a chat with you on WhatsApp. You can start a conversation by calling 1-800-CHATGPT (1-800-242-8478) with a US or Canada number or messaging 1-800-242-8478 on WhatsApp from supported countries. Standard carrier fees may apply. You can also start a conversation in WhatsApp by clicking this link.Track Latest News Live on NDTV.com and get news updates from India  and around the world"}},{"headline":"Keerthy Suresh's Mangalsutra Glimmered Even In A Shimmering Midi Dress","pic":"https://c.ndtvimg.com/2024-12/b50h20co_keerthygrey_625x300_19_December_24.jpg?im=FeatureCrop,algorithm=dnn,width=254,height=143&w=254","link":"https://swirlster.ndtv.com/style/for-her-first-public-appearance-after-her-wedding-to-antony-thattil-keerthy-sureshs-mangalsutra-glimmered-more-than-her-dress-for-baby-john-promotions-7283943#pfrom=home-ndtv_lateststories_topstoriesImg","contents":{"text":"With just a little over a week into marital bliss, Keerthy Suresh is back to business. She is taking some serious measures to look very stylish while at it and the efforts are paying off in plenty. For a dinner with the cast of her upcoming Bollywood debut, Baby John starring Varun Dhawan, she was seen donning a shimmering gunmetal-coloured dress in style. The dress with a plunging neckline, a ruched waist detailing and a slit was the recipe for a glamorous night out. As a newly wedded wife, she also wore her gold mangalsutra. It stood in stark contrast but added dimension to her night-out look in the city in the most unique way. Her makeup and hair, a smokey eye look with mermaid waves bind the seamless blend of the traditional and modern outfit. In addition to the mangalsutra, she wore a pair of hoop earrings, black Dior heels and a black Dior Saddle handbag to complete her outfit.Also Read: Keerthy Suresh Looked Beyond Magical In A White Zuhair Murad Gown For Her Christian WeddingKeerthy Suresh in the cityKeerthy Suresh's fashion choices reflect her ability to balance trends with elements of style that are dear to her. Earlier in the day, when she was busy at work promoting Baby John with Wamiqa Gabbi and Varun Dhawan, she wore a red bodycon corset dress. Even though the pairing of her sleek dress with her traditional gold mangalsutra was not a usual one, they complemented each other in a beautiful way.Keerthy Suresh in the cityWhether celebrating personal or professional milestones, Keerthy Suresh is out and about keeping it stylish.Also Read: Keerthy Suresh's Anita Dongre Bridal Kanjeevaram Saree Had A Love Poem Written By Her Woven In And Took 405 Hours To MakeTrack Latest News Live on NDTV.com and get news updates from India  and around the world"}},{"headline":"Kia Syros SUV Unveiled In India, Bookings Start on January 3","pic":"https://c.ndtvimg.com/2024-12/4dmhjsbo_kia-syros-new_625x300_19_December_24.jpg?im=FaceCrop,algorithm=dnn,width=254,height=143&w=254","link":"https://www.ndtv.com/auto/kia-syros-suv-unveiled-in-india-bookings-start-on-january-3-7283802#pfrom=home-ndtv_lateststories_topstoriesImg","contents":{"text":"Kia India has unveiled its latest SUV in the Indian market called the Syros. The SUV will have six variants: HTX+(O), HTX+,HTX, HTK+, HTK(O), and HTK. The automaker claims that it is the fourth India-inspired product of the brand following the Sonet, Seltos, and Carens. The brand will start taking bookings for the SUV from January 3 with the deliveries beginning from February 2025. Here's all you need to know about the latest model of the South Korean brand.The Kia Syros features a modern design. This is evident in the front fascia, which includes vertically arranged headlamps and daytime running lights (DRLs), along with a robust-looking bumper. A higher bonnet further enhances these aspects, giving the SUV a muscular appearance. These design elements closely resemble those found on the brand's premium electric SUV, the EV9.Also Read: Maruti Suzuki Celerio Limited Edition Launched With Additional Accessories; Check PriceThe vehicle's side profile showcases a tall, upright shape, with a black C-pillar that creates the effect of a floating roof. Additionally, the brand has introduced new alloy wheels. Meanwhile, the rear design mirrors the front, featuring L-shaped LED tail lights that are positioned quite high at the back.The design is complemented by paint schemes like Intense Red, Frost Blue, Pewter Olive, Aurora Black Pearl, Gravity Grey, Imperial Blue, Glacier White Pearl, and Sparking Silver. It has a length of 3,995 mm, width of 1,800 mm and a height of 1,665 mm. The wheelbase stands at 2,550 mm in width. The SUV features a bootspace of 465 litres.The cabin of the Syros features a completely new layout with a 30-inch panoramic screen taking the centre space. This consists of the infotainment system and the digital instrument cluster placed right behind the new two-spoke steering wheel with an off centre logo. Complete with a five seat layout, the SUV aims to offer comfortable seating space further uplifting the feel with a panoramic sunroof.The list of features on the SUV includes elements like wireless Android Auto, Apple CarPlay, ventilated seats, power driver seat, wireless charger, push button start/stop, multi-zone climate control, dedicated screen for AC controls, Harmon Kardon sound system, electronic parking brake, 60:40 split seat, ambient lighting, and more. For safety, the brand is offering features like 360-degree camera with blind spot monitoring, six airbags, hill start assist, a suite of Level 2 ADAS features, and more.Kia Syros will come equipped with a 1.0-litre turbo petrol engine which is tuned to produce 118 bhp of power and 172 Nm of peak torque. It will also get the option of a 1.5-litre diesel engine which puts out 113 hp of power and 250 Nm of peak torque. The transmission options include 6-speed MT, 7-speed DCT, and a 6-speed torque converter automatic gearbox.Track Latest News Live on NDTV.com and get news updates from India  and around the world"}},{"headline":"Anne Hathaway Visits Vikas Khanna's Restaurant, Chef Pens Heartfelt Note","pic":"https://c.ndtvimg.com/2024-12/26vmb9go_anne-hathaway-visits-chef-vikas-khannas-restaurant-he-shares-heartfelt-tribute_625x300_19_December_24.jpg?downsize=254:143&w=254","link":"https://www.ndtv.com/food/anne-hathaway-visits-chef-vikas-khannas-new-york-restaurant-he-shares-heartfelt-tribute-7284032#pfrom=home-ndtv_lateststories_topstoriesImg","contents":{"text":"Chef Vikas Khanna's restaurant has had many celebrity guests (Photo: Instagram/ vikaskhannagroup)Chef Vikas Khanna has hosted numerous celebrities at his New York restaurant, Bungalow, since its opening. In recent weeks, his guests have included Bollywood icons like Shah Rukh Khan, the international star couple Priyanka Chopra and Nick Jonas, and even Amazon founder Jeff Bezos. His latest post revealed that Anne Hathaway, the acclaimed Hollywood star, dined at his restaurant. Chef Vikas Khanna shared on Instagram why her visit held immense significance - not just professionally, but especially on a personal level. Anne Hathaway is renowned for her leading role in the 2006 film The Devil Wears Prada. As it turns out, this movie was one Chef Vikas and his sister often watched together during her hospital stays. It holds a special place in his heart because of the memories he associates with her. He described the movie as his sister's \"painkiller.\"Also Read: Chef Vikas Khanna's Restaurant In New York Received A Michelin \"Bib Gourmand\" Award\"I still remember the day I had to delete all the files of The Devil Wears Prada and Sex and the City from my computer. I had saved these files to watch on a loop on hospital beds with my sister. I can't even recall how many times Radha, Saman Mahmood, and I watched them together. She adored Anne Hathaway and knew all the dialogues by heart. She was happiest reciting every line from DWP. Somehow, I memorized them too. This was her painkiller,\" he wrote.Chef Vikas's sister, Radhika Khanna, passed away in 2022 after battling lupus for many years. In his post's caption, he mentioned deleting those files and trying to forget the dialogue. However, Anne's visit to the Bungalow brought \"every single dialogue and laughter\" back to him. Chef Vikas expressed deep gratitude for the actress. He wrote, \"Somehow, I was so happy to feed her. It's the only way I know to show love and thank people. Thank you, Anne, for taking away her pain when we repeated, 'Everybody wants to be us,' and laughed. I photoshopped my Radha into the photo, right next to her hero. I know she was there.\"A post shared by Vikas Khanna (@vikaskhannagroup)PromotedAlso Read: 11 Times Indian Food Shone Globally In 2024: A Year In ReviewBefore this, when American actress Jenna Fischer (best known for her role as Pam Beesly in the popular sitcom, The Office) dined at Bungalow, Chef Vikas Khanna was also reminded of his sister. Click here to read the full story.Track Latest News Live on NDTV.com and get news updates from India  and around the world. Watch Live News:Follow Us:................................ Advertisement ................................"}},{"headline":"Gavaskar Disagrees With Ashwin Retirement Timing. Says, \"Could've...\"","pic":"https://c.ndtvimg.com/2024-12/mb0ot6b8_ravichandran-ashwin-x-gautamgambhir_625x300_18_December_24.jpg?im=FeatureCrop,algorithm=dnn,width=254,height=143&w=254","link":"https://sports.ndtv.com/australia-vs-india-2024-25/bgt-gavaskar-compares-ashwins-mid-series-retirement-to-dhonis-2014-15-call-7275875#pfrom=home-ndtv_lateststories_topstoriesImg","contents":{"image":"https://c.ndtvimg.com/2024-12/mb0ot6b8_ravichandran-ashwin-x-gautamgambhir_625x300_18_December_24.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605","text":"Former Indian captain and legendary opener Sunil Gavaskar reacted to Ravichandran Ashwin's retirement decision's impact on the team and said the allrounder the same what Dhoni did during 2014-15 Asutralia series. Ashwin announced his retirement from international cricket immediately following the drawn Gabba Test in the ongoing Border-Gavaskar Trophy. Gavaskar drew parallels to MS Dhoni's mid-series retirement during the 2014-15 Test series in Australia, arguing that such decisions disrupt team planning. \"He could have said, listen after the end of the series, I won't be available for selection for India. What it does is that, similarly when MS Dhoni retired at the end of the 3rd Test in 2014-15 series, it leaves you one short,\" Gavaskar told broadcasters.\"The selection committee has picked so many players for a tour with a purpose. If there are any injuries they can select from the reserve players to have in the team. So, Sydney is somewhere where there is a lot of support on offer for spinners. So India could have played with two spinners. You never know. He could have been there for sure. I don't know how the pitch in Melbourne will be like. Normally, you tend to look at the end of the series. That's it. In the middle, it is not usual,\" he added.When asked if Washington Sundar was being groomed to replace Ashwin, Gavaskar admitted it seemed likely. \"Maybe Washington Sundar is ahead of him. Rohit mentioned that Sundar is flying out tomorrow. So, this marks the end of Ashwin as an international cricketer. He has been one heck of a cricketer,\" Gavaskar said.\nMenwahile, Sundar posted a heartfelt post for state-mate Ashwin on Instagram, following the allrounder's retirement. \"More than just a teammate - Ash anna, you have been an inspiration, a mentor and a true champion of the game. It's been an honour to share the field and the dressing room with you.\"\"Coming from the same state of TN, I have grown up watching you from the close corners of Chepauk to playing against you and alongside you. Every moment has been a privilege. The learnings, both on and off the field are something I will carry with me forever. Wishing you success and happiness in whatever comes next,\" the post read.Ashwin's retirement comes at a crucial juncture in the Border-Gavaskar Trophy, with the series delicately poised 1-1 with the drawn Gabba Test. His absence leaves a gap in India's bowling arsenal, especially as they prepare for the upcoming Test in Melbourne and Sydney, traditionally a spinner-friendly venue.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\n                                    Advertisement\n                                AdvertisementAdvertisementAdvertisement"}}]